{
  "episode": {
    "title": "Accor's People-First Approach to Leadership and Transformation",
    "guest": "Pierre Deburaux, Chief Administration Officer of Accor",
    "date": "2025-10-03",
    "duration": "34:31",
    "focus": "Organizational restructuring, financial resilience, people-centered values"
  },
  "transcription": {
    "text": "Welcome to Checking In, a weekly podcast from hotel owner, the UK's trusted source of hotel industry news and analysis. Each week we meet a new guest and learn their story, all the highs and lows, triumphs and disasters they faced and how they got through to the other side. If you like the podcast, make sure to subscribe on whichever podcast platform you listen to. To get more industry Insight, head to hotelowner.co.uk and subscribe for unlimited access. If you're interested in sponsoring episodes of the podcast, drop us a line at podcast and hotelowner.co.uk hi, I'm Heather, host. Of this episode where we speak to Pierre de Bruy, Chief Administration Officer of Accor. Pierre spoke about his career transition from finance roles in transport and beauty to hospitality, the workings behind Accor's major restructure in 2023, and how the streamlining of operations has strengthened the group. How Accor's people centered values create a culture of trust and what hoteliers can do to maintain financial resilience and agility. Welcome, Pierre, and thank you so much for joining us on Checking in. Thank you very much for having me today. So, firstly, could you tell us about your career background prior to joining Accor and take us through some of the roles you've held in the past. I know you have a background in finance, could you take us through that? Sure. Basically spent almost all my professional life in finance roles in various places, various businesses and various capacities. I've worked half of it in engineering, manufacturing, people building and running trains. The second part was fmcg, cosmetics and fragrances and now hospitality. So all very different. And I've worked as a finance actor in a factory. I've done HQ roles, I've done underground roles, diagonal, vertical, horizontal. A bit of a. Everything really up to when I joined Accor and I, I was a CFO for one of the region and then a bigger one. Yeah, it's, it's been quite a journey. Throughout that journey. What were some of the fundamentals you, you learned about finance that, that proved beneficial when you did make that move into hospitality. Are there so many standout lessons from those roles? Yeah, I'd say it's the ability to do two things mainly. First, dealing with a variety of stakeholders from people on the, on the, on, on the floor in a factory, unions, HQ people, very different breed, senior stakeholder executive committees. So that, that's one I'd say. How do you, how do you discuss with various people? They can also be from other functions in finance and that's the Second skill set that's very important in finance. A self standing finance function does not make any sense in any given business. So you're here in finance because there's a business. So it all comes down to your ability to translate the business into numbers so that you can translate those numbers into decision making. Great material. Then start the cycle all over again. So, yeah, dealing with people and translating business. And to that first point, what was your own approach to engaging with such a variety of stakeholders? How did you learn to manage that sufficiently? You learn by doing two things for me. Exposure to various situations. You need, you need to be in very comfortable, uncomfortable, sorry, places from time to time. That's learning by doing, really. And second thing that I use a lot is observing people, observing the way they do and observing the good and the bad. Observing the bad informs you on what not to do because you're not feeling comfortable, you don't really like the way it's being done. And looking at the best as well is very important. Yeah, yeah. Observation is a key skill in, in any career, isn't it? And listening as well. Yeah, exactly, exactly. And having come from industries like beauty and rail transport, was there anything that surprised you or any notable differences that you noticed when moving into hospitality? Or was it more a case of the fundamentals remaining the same and it being more of a lateral move? What was that shift like? So the business is very different. If you compare it to large manufacturing projects that are long term, there's another dimension which is that hospitality is much more simple really from a PNL standpoint, it's much quicker to analyze. From a culture standpoint, it's very, very, very different. Rail business is a lot about engineers, a lot about public tenders. It's quite long, it's usually a lot of manufacturing. It's people to business to business to people, or people to business to public to people. Hospitality is people to people to people. It's quite much, it's very much straightforward. And so the culture that you inherit from the business that's done on the ground is very much different, much more welcoming, it's less processed or if you want to call it differently, it's much more entrepreneurial, which means a bit more messy, right, on a daily basis, but in exchange of that slightly messier ground, you get way more welcoming people. The type of relationship that you have with people on a daily basis and the connection that you have with the business is much greater. So it's a different balance really. And why do you think it is that hospitality lends itself so well to that entrepreneurial spirit, as you say, in that particular culture. What is it about the essence of hospitality that sort of sustains that, do you think? I think it's to do with the, the people who run these businesses. If you're, if you're a brand company like ours or some of our competitors, you want to sell something about the brand. It's, it's, it's emotional. Designing a train is less emotional. Buying a mascara is less emotional probably as well. So there's a brand element that's very important and the emotional connection. Second, usually people who are hotel owners, they share something different with the real estate part of what they do that's different from office real estate. You have less of an emotional connection with your office real estate. Right. You come to the office and then you go back home, you go to the hotel. There's something that's different about it and both the owner side and the guest side feel it. So I think this is very, very genuine on all sides. And last, I'd say no hotel are the same. So no two hotels are the same. Sorry. So it's, it's also a unique experience each and every time for everybody. Yes. You know, it keeps it vibrant and exciting and ever evolving, I suppose, doesn't it? That aspect. It's not generic, such as taking the tube. You take the tube, it's generic, you go to the hotel generic. And so what, what brought you to the core? What led to that shift and can you tell us more about your current role now is Chief Administration Officer. I know you've held roles there prior to that. Interestingly, I was mentioning the people to people to people. Business people brought me to a call. People I had met in the past, people I met during the interview stage. And there was a lot of positive connection with these guys. And so that's what really brought me into the business. I had no knowledge at all about the industry. So what, what kept me there is a curiosity to discover more. You learn a little bit more every day. So it's, it's interesting that there's always something happening in the hotel. Right. And, and after, after doing CFO for one of the region and expanding the role, when we reorganized early 2023, I had expanded my remit to cover more functions. So on top of finance, I also oversee hr. We call them people in culture, legal, communications and also transformation. That's a very varied remit. Yes, indeed. What are your day to day responsibilities? I imagine that no day is the same, but if you could sort of Condense it down for our listener. What does a typical day involve? If you can answer that. Yeah, luckily I don't have a typical day so. And I value that every day. But things that are on the reoccurring side is driving performance for the business and optimize the way we use resources for the business. I lead a team of experts, cross functional experts who are here to enable the business. We share a co lead position. The other co lead is handling operations, development and commercial plus the ESG and that design and technical services functions. And I have, let's call it the support function. So I make sure that everybody is efficiently enabling the rest of the business so that the rest of the business can develop, operate, grow the business and have all the relevant metrics to drive it. And how do you practically approach balancing this oversight of all these diverse areas structurally? Is that in place to help you communicate well with, with co leads and how does that work in, in practice. It'S really about making sure you have the right team and then with the right team comes the trust in all these people. As I was explaining, I have 20 years of experience in finance mainly. So if you think about legal or communications, I'm not an expert. I'm neither a lawyer nor an ex agency guy. So I rely on them as much as they, I rely on their functional expertise as much as they rely on me to drive and organize things and make sure that the information is fluid and, and with trust comes empowerment. I really believe that I don't need to be in all these conversations as long as we are very clear on who does what and we share what needs to be shared. And I'm relying on them really. But you have to trust the guys. Yeah, yeah. It sounds like a very symbiotic relationship in a way. It is, it is. Again, I mean, well, well not that many. And so we are a strong team really handling things all in one go and all in one team. And, and what would your advice be to, to building this trust? Is it a matter of setting those clear boundaries and having faith in, in the ability of others? What, what would you say is, is the best way to, to build such a strong trust and bond within a team? It's all in one sequence really. It's about ensuring you have met the right people, assess that they have the right skill set and then there's something a little bit intangible in the relationship that you have with somebody who's doing a very different job than yours. Do you like that gut feeling? Is it, is it proven to be daily relevant, to trust that person or not. Then you enter into a cycle of, you know, challenging oneself. I challenge myself a lot. Then you challenge the people and then you test the relationship really, without really knowing that you're testing the relationship, but you are. And it's about maintaining that trust on both sides up until it breaks. And then, then unfortunately, you have to have a crucial conversation. But it's, it's maintaining and fueling that intangible feeling. And we touched on this briefly, but I, I wanted to ask you a bit more about your role as CFO for Northern Europe and in Europe and North Africa. Can you tell us more about your time in these roles and, and perhaps some of the, the bigger challenges you faced in these positions and how you navigated those? Looking back, looking back, the main challenge was to join a new company with a new culture, in a new industry, in a. Well, same location. I was in London already, but early November 2020. So actually what happened is I joined on a Monday and on the Wednesday after meeting probably 10 people, physically real human beings, I was sent home by the Prime Minister at that time because of a lockdown. And so I remember taking cab here with a screen and a keyboard under my arm and I had to self induct myself to this business for five months from my kitchen. That was a real challenge. Getting to know the people, getting to know the organization, getting to know the ways of working the culture. How does that work with no people around was complicated. Plus back then, if you remember, 95% of the hotels were closed, so we had no revenue and costs. So we had to carefully manage the cash burn of the company. So doing that from my kitchen was a bit complicated, I must say. It's really hard. It echoes what I was saying about translating the business. If you're not being in the business, you've not visited any hotel, you don't know what it looks like and suddenly you need to manage survival mode. It was complicated. It was quite a challenge, I must say. Looking back on that time, do you think the sort of resilience of that and sort of baptism by fire, did that help strengthen you in any way? Were there any lessons that you, you took away from that, which perhaps you may not have, if that wasn't the situation you, you, you joined in? Yeah, I think it taught us that if we really have to, we can make it work from a very, very uncomfortable setup, which is working from a kitchen or working hundred percent online. No physical meeting, no travel, no nothing. We managed to make it work. We Managed, the group managed to survive from this. So that's one lesson. When you're very scarce on resources and you can't do what you want to do, then you have to make different decisions and accept that it's not running the way you want, but you have to make it run. Yeah. And yeah, we had to rely on different tools as well. I think if I remember correctly, before that we were doing calls, but the technology wasn't working. We were moving and traveling back then. There was suddenly a huge rush on WI fi quality for everyone. Otherwise business couldn't be done the way we wanted. So relying on something different and trusting a different setup was also something we learned back then. Yes, yes. And do you think it showed or revealed a proven agility with a core and I suppose the wider industry in general coming out of that? Yeah. We have to rely on people with a lot of hotel experience who already were very agile. I had the. I had the opportunity and it was great to spend a week of induction in one of our hotels. You have to be extremely agile, regardless of the department you work in, whether you're in rooms or guest facing front desk or restaurant or breakfast, etc. Etc. Etc. You have to be very agile. No two days are the same and you need to welcome a new guest and then there's a VIP and then the VIP is gone and then, et cetera. So the pace that these guys have is also something we managed to benefit from. It's in the culture, it's really in the DNA of the company. In moving on again, we touched on this briefly. Could you take us through some of the bigger developments that have happened at Accor since you've joined? I know, as you say, there was a big change in 2023. Can you tell us more about that and how that process was like for you? The decision was made to pivot from a purely geographical organization to a divisional organization, leveraging the power of the brands and using an organization that's called a segment organization. So we came up from having eight regions to two divisions. One is the premium, midscale and economy division, and the other one is what we call luxury and lifestyle. This was a major shift and was really about increasing the focus on the brands, increasing the focus on the technology, supporting the brand, increasing the focus on what our key markets, key partners are. And it was a success. We announced that in 2022. It was live, early 2023, and it's really fostered a much more efficient, much more tailored execution of our strategy, which is much more brand LED and as, as you know, you, you go to a hotel because you know the brand most of the time. So we wanted to have that vertical to be completely integrated with all the expertise and, and, and, and by that deliver the highest possible level of service to the owners and our guests. This transformation was really yet another step in the journey of Accor in order to transform into one of the best hospitality groups. So we first moved to the asset light model and then we moved to much leaner organization that was regional and then did that step. So it's the ongoing evolution journey. What I can say now is it really was a success. Decision making is much more agile, it's much more data informed, it's much leaner as well. We have local empowerment in all the markets, brand support globally, so it's much more efficient. And I think it's easier to read as well from the outside when we explain what we do. We start by the segment of the brands and then we dive in and it turns out to be a success. With that shift, what did that streamline look like in terms of the finance side of things? Was that effect felt in terms of streamlining finances or were there many significant shifts there? What was that change like behind the scenes? Well, what we had to do back then was to merge three different sub regions. We had no ex Northern Europe, ex Southern Europe and North Africa. And they were basically running on different systems, different processes, different governance, different. A little bit of everything was different. So there was a lot of work to harmonize ways of working, harmonize leadership, harmonize templates, harmonize accounts. So a lot of background work, a lot of back office work and a lot of cultural change as well in order to bring everybody together into one regional leadership structure. And yeah, it probably took us a year, I would say, to explain, make sure that everybody was abiding by the new model and the new leadership and new ways of making decisions really on, on a daily basis. And yeah, a year is very reasonable in order to make the change and make sure that it really sticks. Yeah. Were there any particular challenges with that, particularly with the culture aspect, or was it relatively straightforward journey yet? One that took time. You have to think about what we did as. Some kind of a memory foam blob. So if you push too hard, you will go through. If you push too soft, then you don't move anything. So you have to choose the right pace and the right pressure and it ends up changing shapes. And that's what we did. The real challenge was to adapt the amount of pressure that we were putting on the structure and the organization and the speed in order to make sure that it sticks at the end. So if you want to create something that stays, that's really how you want to think about it here at accurate. Yeah, that's a great analogy. I love that. And it sounds like the move paid its dues for all the work involved. And like you say, it sounds like it's resonated with customers and the business alike on a wider scope. I wanted to ask you, looking at the industry in general, particularly right now with or the macroeconomic challenges, it can be very unpredictable in terms of the finances and shifting demands and costs. From your perspective, what are the strategies that hoteliers should be thinking about when it comes to staying resilient and agile at a time like this? In a people to people to people business, trust is very important. And when it's unpredictable, you need to rely on the ones who have the expertise in various domains. And so we at Accor, for instance, have a lot of expertise in brands and distribution and in loyalty. Those are things you can really, really rely on even when it's unpredictable out there. So building strong partnerships with the brand guys, with your suppliers as well, with all your ecosystem, can really help you unlock anything that could be unpredictably hindering your growth or your strategy. Right. It'll help you build resilience as well because you're leaning on strong partners. We, we talk a lot with a lot of hotel owners and we know that they, they see strong value. When all these partnerships are done well, it can generate a revenue boost, it can generate a cost decrease or cost optimization can be new suppliers going through our platforms, really anything. We have different lines of business as well that support hotel owners to help face when it's shaky out there. I was talking about the procurement platform. Hotel costs are highly dependent on cost of goods. So a little bit of help on the procurement side when you're a little bit overwhelmed by what's happening on the outside, on the booking side, on the sales side, we provide that help that cools down the pressure, if you like. Are there any mistakes that you see people in the wider industry make when it comes to maintaining a strong financial structure? And if so, are there any ways in which they could improve that or things they could be thinking about to become more resilient? We don't see a lot of mistakes in how hotel manager finances unless if we are asked to manage that side, then obviously it's our mistake if we do any. But no, we don't. We see A lot of potential that we know how to unlock with our tools, with our capabilities, with our new services. Whether again, it's procurement or design and technical services, operational support, it can also be something like an FNB concept that we can bring. So no real mistake. Generally speaking, people who run hotels, people who own hotels, they know what they're doing. What they don't always know is the scale of what we at Accor, for instance, can bring to them in order to make their life easier and grow their margin or grow their revenue or grow their profit, depending on what the challenge is. And I suppose, looking ahead, what are some of the perhaps bigger challenges you see facing the industry on the horizon? And what would your advice be for hotel owners to remain resilient and ride out that storm, so to speak? I mean, the obvious answer is to make sure that there's a strong focus on having the right teams on the ground with the right training, with the right experience, in order to make sure that when guests arrive and check out, everybody's happy. Right. So there's a, there's a people element that is the cornerstone of what we do. Beyond that, I'd say picking the right brand, and I know, I realize I'm talking a lot about the brand now, but keeping the right brand and the right flag on top of your hotel is very important so that you create that connection between the brand, the hotel, the room, the experience. And three, I'd say technology and loyalty are very important these days. The amount of booking that now goes through online tools, whether it's a computer, a laptop, a phone, an iPad, whatever, is huge. So the technology parts, including down to the PMS on the ground, is very important, the connectivity and with that comes the data. And with the data comes the loyalty program is super important in order for the guests to feel that they belong. And that loops back to, and that closes the loop with the experience side. So, yeah, I say people, technology loyalty are going to be super important alongside the brand. Yes, absolutely. And like you say, when that system and cycle is just right and self sustaining in a way. And can you tell us, just wrapping up what's next for Accor? Are there any plans or developments that you can share with us? We are on a journey to sustainable, profitable growth and that's very important to, to understand. So we will, we will continue to develop partnership with existing and new partners to make sure that we showcase what we can do. On the brand side, our distribution platform, as it's been announced in the past month, is going to move progressively to a New one with Amadeus. So great and very exciting challenge ahead. Our loyalty program keeps progressing super fast. The growth is absolutely incredible and we're very happy with that. So yeah, it's really about expanding the network and creating new partnership or expanding the existing one using the platform that we have. Yeah, wonderful, wonderful. And you mentioned sustainability there. Which brings us nicely on to the final segment of the show where we ask you a question left by the previous guest. And our last guest was Andrew Eversden who's co founder of Bottle up, which supplies reusable bottles to hotel groups. He asked what is the main challenge hoteliers are facing when implementing sustainable projects? It's a great question and I love to ask it myself. Thinking out loud, I'd say one of the very important point is to strike the right balance between short term and long term. Anything sustainable growth can be detrimental to your short term growth objectives. So you'll probably need to make a choice and a trade off between short term and long term. And for that you need the data. You need to have the right analysis in order to make the right decision. And to do that we don't use robots that much in the industry. So you need the right people. So if you have the right organization with the right people following the right analysis scheme, you should be on the safer side to make an educated decision. And that trade off between short term and long term, there's no easy decision. So what's complicated then is making the decision. That's the real complexity. I guess when it comes to sustainable growth, you can have a lot of analysts analyzing a lot of data and using a lot of PowerPoint decks. It's about making the decision. So what's your plan? Are you changing your plan? Are you sticking to your plan? That's the decision you're going to make. And that's the real difficulty I guess that we are all going to face. Whether hotel owner, brand distribution, loyalty program, it's, it's all in one, one go. Yeah, absolutely. Something to think about. And yes, finally, Pierre, do you have a question to leave for our next guest? Absolutely. So I'll, I'll, I'll bounce back on what we discussed earlier about unpredictable or uncertain times. So here it goes. In moments of uncertainty, what principle or value do you rely on most to guide your choices? That's an excellent question, Pierre. We will pass it on to the next guest. I look forward to that answer. Yes, indeed. Pierre, thank you so much for joining us. It's been lovely speaking with you. It's been a pleasure. Thank you so much. Thanks for listening to Checking In a weekly podcast from hotel owner, the UK's trusted source of hotel industry news and analysis. If you like the podcast, make sure to subscribe on whichever podcast platform you listen to. To get more industry Insight, head to hotelowner.co.uk and subscribe for unlimited access. If you're interested in sponsoring episodes of the podcast, drop us a line at podcastotelowner.co.uk.",
    "words": 4729,
    "confidence": 0.9719451,
    "audio_duration": 2072
  },
  "utterances": [
    {
      "speaker": "A",
      "text": "Welcome to Checking In, a weekly podcast from hotel owner, the UK's trusted source of hotel industry news and analysis. Each week we meet a new guest and learn their story, all the highs and lows, triumphs and disasters they faced and how they got through to the other side. If you like the podcast, make sure to subscribe on whichever podcast platform you listen to. To get more industry Insight, head to hotelowner.co.uk and subscribe for unlimited access. If you're interested in sponsoring episodes of the podcast, drop us a line at podcast and hotelowner.co.uk hi, I'm Heather, host.",
      "start": 960,
      "end": 32980,
      "confidence": 0.9845017
    },
    {
      "speaker": "B",
      "text": "Of this episode where we speak to Pierre de Bruy, Chief Administration Officer of Accor. Pierre spoke about his career transition from finance roles in transport and beauty to hospitality, the workings behind Accor's major restructure in 2023, and how the streamlining of operations has strengthened the group. How Accor's people centered values create a culture of trust and what hoteliers can do to maintain financial resilience and agility. Welcome, Pierre, and thank you so much for joining us on Checking in.",
      "start": 32980,
      "end": 63790,
      "confidence": 0.9773083
    },
    {
      "speaker": "C",
      "text": "Thank you very much for having me today.",
      "start": 64430,
      "end": 66110,
      "confidence": 0.9992981
    },
    {
      "speaker": "B",
      "text": "So, firstly, could you tell us about your career background prior to joining Accor and take us through some of the roles you've held in the past. I know you have a background in finance, could you take us through that?",
      "start": 66430,
      "end": 79070,
      "confidence": 0.9895476
    },
    {
      "speaker": "C",
      "text": "Sure. Basically spent almost all my professional life in finance roles in various places, various businesses and various capacities. I've worked half of it in engineering, manufacturing, people building and running trains. The second part was fmcg, cosmetics and fragrances and now hospitality. So all very different. And I've worked as a finance actor in a factory. I've done HQ roles, I've done underground roles, diagonal, vertical, horizontal. A bit of a. Everything really up to when I joined Accor and I, I was a CFO for one of the region and then a bigger one. Yeah, it's, it's been quite a journey.",
      "start": 79310,
      "end": 132950,
      "confidence": 0.95056593
    },
    {
      "speaker": "B",
      "text": "Throughout that journey. What were some of the fundamentals you, you learned about finance that, that proved beneficial when you did make that move into hospitality. Are there so many standout lessons from those roles?",
      "start": 133270,
      "end": 144630,
      "confidence": 0.9902423
    },
    {
      "speaker": "C",
      "text": "Yeah, I'd say it's the ability to do two things mainly. First, dealing with a variety of stakeholders from people on the, on the, on, on the floor in a factory, unions, HQ people, very different breed, senior stakeholder executive committees. So that, that's one I'd say. How do you, how do you discuss with various people? They can also be from other functions in finance and that's the Second skill set that's very important in finance. A self standing finance function does not make any sense in any given business. So you're here in finance because there's a business. So it all comes down to your ability to translate the business into numbers so that you can translate those numbers into decision making. Great material. Then start the cycle all over again. So, yeah, dealing with people and translating business.",
      "start": 145190,
      "end": 210500,
      "confidence": 0.9693436
    },
    {
      "speaker": "B",
      "text": "And to that first point, what was your own approach to engaging with such a variety of stakeholders? How did you learn to manage that sufficiently?",
      "start": 211860,
      "end": 222740,
      "confidence": 0.9764404
    },
    {
      "speaker": "C",
      "text": "You learn by doing two things for me. Exposure to various situations. You need, you need to be in very comfortable, uncomfortable, sorry, places from time to time. That's learning by doing, really. And second thing that I use a lot is observing people, observing the way they do and observing the good and the bad. Observing the bad informs you on what not to do because you're not feeling comfortable, you don't really like the way it's being done. And looking at the best as well is very important.",
      "start": 223220,
      "end": 258960,
      "confidence": 0.9754969
    },
    {
      "speaker": "B",
      "text": "Yeah, yeah. Observation is a key skill in, in any career, isn't it?",
      "start": 259440,
      "end": 264200,
      "confidence": 0.9469026
    },
    {
      "speaker": "C",
      "text": "And listening as well.",
      "start": 264280,
      "end": 265800,
      "confidence": 0.9510498
    },
    {
      "speaker": "B",
      "text": "Yeah, exactly, exactly. And having come from industries like beauty and rail transport, was there anything that surprised you or any notable differences that you noticed when moving into hospitality? Or was it more a case of the fundamentals remaining the same and it being more of a lateral move? What was that shift like?",
      "start": 266200,
      "end": 289480,
      "confidence": 0.98281074
    },
    {
      "speaker": "C",
      "text": "So the business is very different. If you compare it to large manufacturing projects that are long term, there's another dimension which is that hospitality is much more simple really from a PNL standpoint, it's much quicker to analyze. From a culture standpoint, it's very, very, very different. Rail business is a lot about engineers, a lot about public tenders. It's quite long, it's usually a lot of manufacturing. It's people to business to business to people, or people to business to public to people. Hospitality is people to people to people. It's quite much, it's very much straightforward. And so the culture that you inherit from the business that's done on the ground is very much different, much more welcoming, it's less processed or if you want to call it differently, it's much more entrepreneurial, which means a bit more messy, right, on a daily basis, but in exchange of that slightly messier ground, you get way more welcoming people. The type of relationship that you have with people on a daily basis and the connection that you have with the business is much greater. So it's a different balance really.",
      "start": 290010,
      "end": 383860,
      "confidence": 0.9704853
    },
    {
      "speaker": "B",
      "text": "And why do you think it is that hospitality lends itself so well to that entrepreneurial spirit, as you say, in that particular culture. What is it about the essence of hospitality that sort of sustains that, do you think?",
      "start": 384180,
      "end": 399460,
      "confidence": 0.9817403
    },
    {
      "speaker": "C",
      "text": "I think it's to do with the, the people who run these businesses. If you're, if you're a brand company like ours or some of our competitors, you want to sell something about the brand. It's, it's, it's emotional. Designing a train is less emotional. Buying a mascara is less emotional probably as well. So there's a brand element that's very important and the emotional connection. Second, usually people who are hotel owners, they share something different with the real estate part of what they do that's different from office real estate. You have less of an emotional connection with your office real estate. Right. You come to the office and then you go back home, you go to the hotel. There's something that's different about it and both the owner side and the guest side feel it. So I think this is very, very genuine on all sides. And last, I'd say no hotel are the same. So no two hotels are the same. Sorry. So it's, it's also a unique experience each and every time for everybody.",
      "start": 399780,
      "end": 478580,
      "confidence": 0.9673502
    },
    {
      "speaker": "B",
      "text": "Yes. You know, it keeps it vibrant and exciting and ever evolving, I suppose, doesn't it? That aspect.",
      "start": 478820,
      "end": 484900,
      "confidence": 0.95120126
    },
    {
      "speaker": "C",
      "text": "It's not generic, such as taking the tube. You take the tube, it's generic, you go to the hotel generic.",
      "start": 484900,
      "end": 491540,
      "confidence": 0.9815511
    },
    {
      "speaker": "B",
      "text": "And so what, what brought you to the core? What led to that shift and can you tell us more about your current role now is Chief Administration Officer. I know you've held roles there prior to that.",
      "start": 491700,
      "end": 504680,
      "confidence": 0.9197559
    },
    {
      "speaker": "C",
      "text": "Interestingly, I was mentioning the people to people to people. Business people brought me to a call. People I had met in the past, people I met during the interview stage. And there was a lot of positive connection with these guys. And so that's what really brought me into the business. I had no knowledge at all about the industry. So what, what kept me there is a curiosity to discover more. You learn a little bit more every day. So it's, it's interesting that there's always something happening in the hotel. Right. And, and after, after doing CFO for one of the region and expanding the role, when we reorganized early 2023, I had expanded my remit to cover more functions. So on top of finance, I also oversee hr. We call them people in culture, legal, communications and also transformation.",
      "start": 505000,
      "end": 571590,
      "confidence": 0.9625443
    },
    {
      "speaker": "B",
      "text": "That's a very varied remit.",
      "start": 573350,
      "end": 575910,
      "confidence": 0.9419596
    },
    {
      "speaker": "C",
      "text": "Yes, indeed.",
      "start": 576710,
      "end": 577830,
      "confidence": 0.99397784
    },
    {
      "speaker": "B",
      "text": "What are your day to day responsibilities? I imagine that no day is the same, but if you could sort of Condense it down for our listener. What does a typical day involve? If you can answer that.",
      "start": 579750,
      "end": 593060,
      "confidence": 0.98406446
    },
    {
      "speaker": "C",
      "text": "Yeah, luckily I don't have a typical day so. And I value that every day. But things that are on the reoccurring side is driving performance for the business and optimize the way we use resources for the business. I lead a team of experts, cross functional experts who are here to enable the business. We share a co lead position. The other co lead is handling operations, development and commercial plus the ESG and that design and technical services functions. And I have, let's call it the support function. So I make sure that everybody is efficiently enabling the rest of the business so that the rest of the business can develop, operate, grow the business and have all the relevant metrics to drive it.",
      "start": 593540,
      "end": 656860,
      "confidence": 0.95628947
    },
    {
      "speaker": "B",
      "text": "And how do you practically approach balancing this oversight of all these diverse areas structurally? Is that in place to help you communicate well with, with co leads and how does that work in, in practice.",
      "start": 657100,
      "end": 673320,
      "confidence": 0.9509537
    },
    {
      "speaker": "C",
      "text": "It'S really about making sure you have the right team and then with the right team comes the trust in all these people. As I was explaining, I have 20 years of experience in finance mainly. So if you think about legal or communications, I'm not an expert. I'm neither a lawyer nor an ex agency guy. So I rely on them as much as they, I rely on their functional expertise as much as they rely on me to drive and organize things and make sure that the information is fluid and, and with trust comes empowerment. I really believe that I don't need to be in all these conversations as long as we are very clear on who does what and we share what needs to be shared. And I'm relying on them really. But you have to trust the guys.",
      "start": 674600,
      "end": 732450,
      "confidence": 0.9686865
    },
    {
      "speaker": "B",
      "text": "Yeah, yeah. It sounds like a very symbiotic relationship in a way.",
      "start": 732850,
      "end": 737890,
      "confidence": 0.9813775
    },
    {
      "speaker": "C",
      "text": "It is, it is. Again, I mean, well, well not that many. And so we are a strong team really handling things all in one go and all in one team.",
      "start": 737970,
      "end": 750010,
      "confidence": 0.9464702
    },
    {
      "speaker": "B",
      "text": "And, and what would your advice be to, to building this trust? Is it a matter of setting those clear boundaries and having faith in, in the ability of others? What, what would you say is, is the best way to, to build such a strong trust and bond within a team?",
      "start": 750410,
      "end": 768200,
      "confidence": 0.9759193
    },
    {
      "speaker": "C",
      "text": "It's all in one sequence really. It's about ensuring you have met the right people, assess that they have the right skill set and then there's something a little bit intangible in the relationship that you have with somebody who's doing a very different job than yours. Do you like that gut feeling? Is it, is it proven to be daily relevant, to trust that person or not. Then you enter into a cycle of, you know, challenging oneself. I challenge myself a lot. Then you challenge the people and then you test the relationship really, without really knowing that you're testing the relationship, but you are. And it's about maintaining that trust on both sides up until it breaks. And then, then unfortunately, you have to have a crucial conversation. But it's, it's maintaining and fueling that intangible feeling.",
      "start": 768680,
      "end": 830870,
      "confidence": 0.9790182
    },
    {
      "speaker": "B",
      "text": "And we touched on this briefly, but I, I wanted to ask you a bit more about your role as CFO for Northern Europe and in Europe and North Africa. Can you tell us more about your time in these roles and, and perhaps some of the, the bigger challenges you faced in these positions and how you navigated those?",
      "start": 831190,
      "end": 851260,
      "confidence": 0.98847795
    },
    {
      "speaker": "C",
      "text": "Looking back, looking back, the main challenge was to join a new company with a new culture, in a new industry, in a. Well, same location. I was in London already, but early November 2020. So actually what happened is I joined on a Monday and on the Wednesday after meeting probably 10 people, physically real human beings, I was sent home by the Prime Minister at that time because of a lockdown. And so I remember taking cab here with a screen and a keyboard under my arm and I had to self induct myself to this business for five months from my kitchen. That was a real challenge. Getting to know the people, getting to know the organization, getting to know the ways of working the culture. How does that work with no people around was complicated. Plus back then, if you remember, 95% of the hotels were closed, so we had no revenue and costs. So we had to carefully manage the cash burn of the company. So doing that from my kitchen was a bit complicated, I must say. It's really hard. It echoes what I was saying about translating the business. If you're not being in the business, you've not visited any hotel, you don't know what it looks like and suddenly you need to manage survival mode. It was complicated. It was quite a challenge, I must say.",
      "start": 851420,
      "end": 949710,
      "confidence": 0.9697089
    },
    {
      "speaker": "B",
      "text": "Looking back on that time, do you think the sort of resilience of that and sort of baptism by fire, did that help strengthen you in any way? Were there any lessons that you, you took away from that, which perhaps you may not have, if that wasn't the situation you, you, you joined in?",
      "start": 950280,
      "end": 968360,
      "confidence": 0.9743734
    },
    {
      "speaker": "C",
      "text": "Yeah, I think it taught us that if we really have to, we can make it work from a very, very uncomfortable setup, which is working from a kitchen or working hundred percent online. No physical meeting, no travel, no nothing. We managed to make it work. We Managed, the group managed to survive from this. So that's one lesson. When you're very scarce on resources and you can't do what you want to do, then you have to make different decisions and accept that it's not running the way you want, but you have to make it run.",
      "start": 968840,
      "end": 1008800,
      "confidence": 0.97611946
    },
    {
      "speaker": "B",
      "text": "Yeah.",
      "start": 1008880,
      "end": 1009440,
      "confidence": 0.8531901
    },
    {
      "speaker": "C",
      "text": "And yeah, we had to rely on different tools as well. I think if I remember correctly, before that we were doing calls, but the technology wasn't working. We were moving and traveling back then. There was suddenly a huge rush on WI fi quality for everyone. Otherwise business couldn't be done the way we wanted. So relying on something different and trusting a different setup was also something we learned back then.",
      "start": 1011680,
      "end": 1039330,
      "confidence": 0.96791136
    },
    {
      "speaker": "B",
      "text": "Yes, yes. And do you think it showed or revealed a proven agility with a core and I suppose the wider industry in general coming out of that?",
      "start": 1039810,
      "end": 1051890,
      "confidence": 0.91986084
    },
    {
      "speaker": "C",
      "text": "Yeah. We have to rely on people with a lot of hotel experience who already were very agile. I had the. I had the opportunity and it was great to spend a week of induction in one of our hotels. You have to be extremely agile, regardless of the department you work in, whether you're in rooms or guest facing front desk or restaurant or breakfast, etc. Etc. Etc. You have to be very agile. No two days are the same and you need to welcome a new guest and then there's a VIP and then the VIP is gone and then, et cetera. So the pace that these guys have is also something we managed to benefit from. It's in the culture, it's really in the DNA of the company.",
      "start": 1052690,
      "end": 1099380,
      "confidence": 0.9644467
    },
    {
      "speaker": "B",
      "text": "In moving on again, we touched on this briefly. Could you take us through some of the bigger developments that have happened at Accor since you've joined? I know, as you say, there was a big change in 2023. Can you tell us more about that and how that process was like for you?",
      "start": 1100020,
      "end": 1117630,
      "confidence": 0.97983503
    },
    {
      "speaker": "C",
      "text": "The decision was made to pivot from a purely geographical organization to a divisional organization, leveraging the power of the brands and using an organization that's called a segment organization. So we came up from having eight regions to two divisions. One is the premium, midscale and economy division, and the other one is what we call luxury and lifestyle. This was a major shift and was really about increasing the focus on the brands, increasing the focus on the technology, supporting the brand, increasing the focus on what our key markets, key partners are. And it was a success. We announced that in 2022. It was live, early 2023, and it's really fostered a much more efficient, much more tailored execution of our strategy, which is much more brand LED and as, as you know, you, you go to a hotel because you know the brand most of the time. So we wanted to have that vertical to be completely integrated with all the expertise and, and, and, and by that deliver the highest possible level of service to the owners and our guests. This transformation was really yet another step in the journey of Accor in order to transform into one of the best hospitality groups. So we first moved to the asset light model and then we moved to much leaner organization that was regional and then did that step. So it's the ongoing evolution journey. What I can say now is it really was a success. Decision making is much more agile, it's much more data informed, it's much leaner as well. We have local empowerment in all the markets, brand support globally, so it's much more efficient. And I think it's easier to read as well from the outside when we explain what we do. We start by the segment of the brands and then we dive in and it turns out to be a success.",
      "start": 1117950,
      "end": 1264290,
      "confidence": 0.9788854
    },
    {
      "speaker": "B",
      "text": "With that shift, what did that streamline look like in terms of the finance side of things? Was that effect felt in terms of streamlining finances or were there many significant shifts there? What was that change like behind the scenes?",
      "start": 1268130,
      "end": 1283180,
      "confidence": 0.98808473
    },
    {
      "speaker": "C",
      "text": "Well, what we had to do back then was to merge three different sub regions. We had no ex Northern Europe, ex Southern Europe and North Africa. And they were basically running on different systems, different processes, different governance, different. A little bit of everything was different. So there was a lot of work to harmonize ways of working, harmonize leadership, harmonize templates, harmonize accounts. So a lot of background work, a lot of back office work and a lot of cultural change as well in order to bring everybody together into one regional leadership structure. And yeah, it probably took us a year, I would say, to explain, make sure that everybody was abiding by the new model and the new leadership and new ways of making decisions really on, on a daily basis. And yeah, a year is very reasonable in order to make the change and make sure that it really sticks.",
      "start": 1283420,
      "end": 1359650,
      "confidence": 0.9724176
    },
    {
      "speaker": "B",
      "text": "Yeah. Were there any particular challenges with that, particularly with the culture aspect, or was it relatively straightforward journey yet? One that took time.",
      "start": 1359970,
      "end": 1372150,
      "confidence": 0.97580975
    },
    {
      "speaker": "C",
      "text": "You have to think about what we did as. Some kind of a memory foam blob. So if you push too hard, you will go through. If you push too soft, then you don't move anything. So you have to choose the right pace and the right pressure and it ends up changing shapes. And that's what we did. The real challenge was to adapt the amount of pressure that we were putting on the structure and the organization and the speed in order to make sure that it sticks at the end. So if you want to create something that stays, that's really how you want to think about it here at accurate.",
      "start": 1372550,
      "end": 1417490,
      "confidence": 0.9700949
    },
    {
      "speaker": "B",
      "text": "Yeah, that's a great analogy. I love that. And it sounds like the move paid its dues for all the work involved. And like you say, it sounds like it's resonated with customers and the business alike on a wider scope. I wanted to ask you, looking at the industry in general, particularly right now with or the macroeconomic challenges, it can be very unpredictable in terms of the finances and shifting demands and costs. From your perspective, what are the strategies that hoteliers should be thinking about when it comes to staying resilient and agile at a time like this?",
      "start": 1417730,
      "end": 1461410,
      "confidence": 0.96799713
    },
    {
      "speaker": "C",
      "text": "In a people to people to people business, trust is very important. And when it's unpredictable, you need to rely on the ones who have the expertise in various domains. And so we at Accor, for instance, have a lot of expertise in brands and distribution and in loyalty. Those are things you can really, really rely on even when it's unpredictable out there. So building strong partnerships with the brand guys, with your suppliers as well, with all your ecosystem, can really help you unlock anything that could be unpredictably hindering your growth or your strategy. Right. It'll help you build resilience as well because you're leaning on strong partners. We, we talk a lot with a lot of hotel owners and we know that they, they see strong value. When all these partnerships are done well, it can generate a revenue boost, it can generate a cost decrease or cost optimization can be new suppliers going through our platforms, really anything. We have different lines of business as well that support hotel owners to help face when it's shaky out there. I was talking about the procurement platform. Hotel costs are highly dependent on cost of goods. So a little bit of help on the procurement side when you're a little bit overwhelmed by what's happening on the outside, on the booking side, on the sales side, we provide that help that cools down the pressure, if you like.",
      "start": 1461890,
      "end": 1591010,
      "confidence": 0.9685679
    },
    {
      "speaker": "B",
      "text": "Are there any mistakes that you see people in the wider industry make when it comes to maintaining a strong financial structure? And if so, are there any ways in which they could improve that or things they could be thinking about to become more resilient?",
      "start": 1591410,
      "end": 1606770,
      "confidence": 0.98066336
    },
    {
      "speaker": "C",
      "text": "We don't see a lot of mistakes in how hotel manager finances unless if we are asked to manage that side, then obviously it's our mistake if we do any. But no, we don't. We see A lot of potential that we know how to unlock with our tools, with our capabilities, with our new services. Whether again, it's procurement or design and technical services, operational support, it can also be something like an FNB concept that we can bring. So no real mistake. Generally speaking, people who run hotels, people who own hotels, they know what they're doing. What they don't always know is the scale of what we at Accor, for instance, can bring to them in order to make their life easier and grow their margin or grow their revenue or grow their profit, depending on what the challenge is.",
      "start": 1607330,
      "end": 1674830,
      "confidence": 0.9815506
    },
    {
      "speaker": "B",
      "text": "And I suppose, looking ahead, what are some of the perhaps bigger challenges you see facing the industry on the horizon? And what would your advice be for hotel owners to remain resilient and ride out that storm, so to speak?",
      "start": 1675630,
      "end": 1693950,
      "confidence": 0.97825265
    },
    {
      "speaker": "C",
      "text": "I mean, the obvious answer is to make sure that there's a strong focus on having the right teams on the ground with the right training, with the right experience, in order to make sure that when guests arrive and check out, everybody's happy. Right. So there's a, there's a people element that is the cornerstone of what we do. Beyond that, I'd say picking the right brand, and I know, I realize I'm talking a lot about the brand now, but keeping the right brand and the right flag on top of your hotel is very important so that you create that connection between the brand, the hotel, the room, the experience. And three, I'd say technology and loyalty are very important these days. The amount of booking that now goes through online tools, whether it's a computer, a laptop, a phone, an iPad, whatever, is huge. So the technology parts, including down to the PMS on the ground, is very important, the connectivity and with that comes the data. And with the data comes the loyalty program is super important in order for the guests to feel that they belong. And that loops back to, and that closes the loop with the experience side. So, yeah, I say people, technology loyalty are going to be super important alongside the brand.",
      "start": 1694270,
      "end": 1794580,
      "confidence": 0.9718604
    },
    {
      "speaker": "B",
      "text": "Yes, absolutely. And like you say, when that system and cycle is just right and self sustaining in a way. And can you tell us, just wrapping up what's next for Accor? Are there any plans or developments that you can share with us?",
      "start": 1794980,
      "end": 1811770,
      "confidence": 0.9691691
    },
    {
      "speaker": "C",
      "text": "We are on a journey to sustainable, profitable growth and that's very important to, to understand. So we will, we will continue to develop partnership with existing and new partners to make sure that we showcase what we can do. On the brand side, our distribution platform, as it's been announced in the past month, is going to move progressively to a New one with Amadeus. So great and very exciting challenge ahead. Our loyalty program keeps progressing super fast. The growth is absolutely incredible and we're very happy with that. So yeah, it's really about expanding the network and creating new partnership or expanding the existing one using the platform that we have.",
      "start": 1812410,
      "end": 1868150,
      "confidence": 0.9783812
    },
    {
      "speaker": "B",
      "text": "Yeah, wonderful, wonderful. And you mentioned sustainability there. Which brings us nicely on to the final segment of the show where we ask you a question left by the previous guest. And our last guest was Andrew Eversden who's co founder of Bottle up, which supplies reusable bottles to hotel groups. He asked what is the main challenge hoteliers are facing when implementing sustainable projects?",
      "start": 1868550,
      "end": 1894600,
      "confidence": 0.9730838
    },
    {
      "speaker": "C",
      "text": "It's a great question and I love to ask it myself. Thinking out loud, I'd say one of the very important point is to strike the right balance between short term and long term. Anything sustainable growth can be detrimental to your short term growth objectives. So you'll probably need to make a choice and a trade off between short term and long term. And for that you need the data. You need to have the right analysis in order to make the right decision. And to do that we don't use robots that much in the industry. So you need the right people. So if you have the right organization with the right people following the right analysis scheme, you should be on the safer side to make an educated decision. And that trade off between short term and long term, there's no easy decision. So what's complicated then is making the decision. That's the real complexity. I guess when it comes to sustainable growth, you can have a lot of analysts analyzing a lot of data and using a lot of PowerPoint decks. It's about making the decision. So what's your plan? Are you changing your plan? Are you sticking to your plan? That's the decision you're going to make. And that's the real difficulty I guess that we are all going to face. Whether hotel owner, brand distribution, loyalty program, it's, it's all in one, one go.",
      "start": 1896360,
      "end": 2004940,
      "confidence": 0.9760963
    },
    {
      "speaker": "B",
      "text": "Yeah, absolutely. Something to think about. And yes, finally, Pierre, do you have a question to leave for our next guest?",
      "start": 2005180,
      "end": 2013260,
      "confidence": 0.9946436
    },
    {
      "speaker": "C",
      "text": "Absolutely. So I'll, I'll, I'll bounce back on what we discussed earlier about unpredictable or uncertain times. So here it goes. In moments of uncertainty, what principle or value do you rely on most to guide your choices?",
      "start": 2013420,
      "end": 2033340,
      "confidence": 0.95414865
    },
    {
      "speaker": "B",
      "text": "That's an excellent question, Pierre. We will pass it on to the next guest.",
      "start": 2033580,
      "end": 2037500,
      "confidence": 0.9745164
    },
    {
      "speaker": "C",
      "text": "I look forward to that answer.",
      "start": 2037900,
      "end": 2039420,
      "confidence": 0.98795575
    },
    {
      "speaker": "B",
      "text": "Yes, indeed. Pierre, thank you so much for joining us. It's been lovely speaking with you.",
      "start": 2039420,
      "end": 2044300,
      "confidence": 0.9833476
    },
    {
      "speaker": "C",
      "text": "It's been a pleasure. Thank you so much.",
      "start": 2045110,
      "end": 2046630,
      "confidence": 0.98325604
    },
    {
      "speaker": "A",
      "text": "Thanks for listening to Checking In a weekly podcast from hotel owner, the UK's trusted source of hotel industry news and analysis. If you like the podcast, make sure to subscribe on whichever podcast platform you listen to. To get more industry Insight, head to hotelowner.co.uk and subscribe for unlimited access. If you're interested in sponsoring episodes of the podcast, drop us a line at podcastotelowner.co.uk.",
      "start": 2047030,
      "end": 2070230,
      "confidence": 0.9883865
    }
  ],
  "chapters": [
    {
      "summary": "Checking In is a weekly podcast from hotel owner, the UK's trusted source of hotel industry news and analysis. This week we speak to Pierre de Bruy, Chief Administration Officer of Accor. Pierre talks about his career transition from finance roles in transport and beauty to hospitality.",
      "gist": "Checking In",
      "headline": "Checking In is the weekly hotel industry podcast from hotel owner",
      "start": 960,
      "end": 66110
    },
    {
      "summary": "Almost all my professional life in finance roles. I've worked half of it in engineering, manufacturing, people building and running trains. The second part was fmcg, cosmetics and fragrances and now hospitality. What were some of the fundamentals you learned about finance that proved beneficial when you did make that move into hospitality.",
      "gist": "The Challenges of Leading in Hospitality",
      "headline": "You've spent almost all your professional life in finance roles",
      "start": 66430,
      "end": 268360
    },
    {
      "summary": "Having come from industries like beauty and rail transport, was there anything that surprised you when moving into hospitality? From a culture standpoint, it's very different. Hospitality is much more simple really from a PNL standpoint.",
      "gist": "Coming into hospitality, what did you notice?",
      "headline": "Having come from industries like beauty and rail transport, moving into hospitality surprised you",
      "start": 269080,
      "end": 383860
    },
    {
      "summary": "Hospitality lends itself so well to that entrepreneurial spirit, as you say. What is it about the essence of hospitality that sustains that? No two hotels are the same. It's also a unique experience each and every time for everybody.",
      "gist": "What is it about hospitality that attracts so many people?",
      "headline": "What is the essence of hospitality that sustains that entrepreneurial spirit",
      "start": 384180,
      "end": 491540
    },
    {
      "summary": "Your current role is Chief Administration Officer. On top of finance, I also oversee hr. in culture, legal, communications and also transformation. What kept you there is a curiosity to discover more. You learn a little bit more every day.",
      "gist": "What brought you to the core",
      "headline": "Your current role at the hotel is Chief Administration Officer",
      "start": 491700,
      "end": 577830
    },
    {
      "summary": "I lead a team of experts, cross functional experts who are here to enable the business. We share a co lead position. The other co lead is handling operations, development and commercial plus the ESG. With trust comes empowerment. It's about maintaining that trust on both sides up until it breaks.",
      "gist": "How does a Co-Lead manage the business?",
      "headline": "What are your day to day responsibilities? I imagine that no day is the same",
      "start": 579750,
      "end": 830870
    },
    {
      "summary": "You were CFO for Northern Europe and in Europe and North Africa. The main challenge was to join a new company with a new culture, in a new industry. You have to be extremely agile, regardless of the department you work in.",
      "gist": "The Challenges of Leading the Company",
      "headline": "You were CFO for Northern Europe and in Europe and North Africa",
      "start": 831190,
      "end": 1099380
    },
    {
      "summary": "The decision was made to pivot from a purely geographical organization to a divisional organization. This was a major shift and was really about increasing the focus on the brands. It's fostered a much more efficient, much more tailored execution of our strategy.",
      "gist": "The Accor Group's Transformation",
      "headline": "Accor changed from geographical organization to a divisional organization in 2023",
      "start": 1100020,
      "end": 1264290
    },
    {
      "summary": "We had to merge three different sub regions. It probably took us a year to explain, make sure that everybody was abiding by the new model. The real challenge was to adapt the amount of pressure that we were putting on the structure and the organization. It sounds like the move paid its dues for all the work involved.",
      "gist": "The Streamlining of the Company",
      "headline": "Moving from three sub regions to one took a year to complete",
      "start": 1268130,
      "end": 1434130
    },
    {
      "summary": "The hotel industry can be very unpredictable in terms of the finances and shifting demands and costs. Building strong partnerships with the brand guys, with your suppliers as well, with all your ecosystem, can really help you unlock anything. From your perspective, what are the strategies hoteliers should be thinking about to stay resilient and agile?",
      "gist": "Stay resilient in a time of uncertainty",
      "headline": "Hoteliers should be thinking about staying resilient and agile during unpredictable times",
      "start": 1434850,
      "end": 1591010
    },
    {
      "summary": "Accor doesn't see a lot of mistakes in how hotel manager finances. We see A lot of potential that we know how to unlock with our tools. What they don't always know is the scale of what we at Accor can bring to them.",
      "gist": "Have hotel managers made enough financial planning?",
      "headline": "Accor doesn't see a lot of mistakes in hotel manager finances",
      "start": 1591410,
      "end": 1674830
    },
    {
      "summary": "Keeping the right brand and the right flag on top of your hotel is very important. Technology and loyalty are very important these days. What are some of the perhaps bigger challenges you see facing the industry on the horizon?",
      "gist": "The Challenges of the Hotel Industry",
      "headline": "Technology and loyalty are very important these days for hotel owners",
      "start": 1675630,
      "end": 1802730
    },
    {
      "summary": "Accor is on a journey to sustainable, profitable growth. On the brand side, our distribution platform is going to move progressively to a New one with Amadeus. Our loyalty program keeps progressing super fast. The growth is absolutely incredible.",
      "gist": "A message from Accor",
      "headline": "Accor is on a journey to sustainable, profitable growth",
      "start": 1803050,
      "end": 1880070
    },
    {
      "summary": "Sustainable growth can be detrimental to your short term growth objectives. You need to have the right analysis in order to make the right decision. The trade off between short term and long term is no easy decision.",
      "gist": "The challenge of implementing sustainable projects",
      "headline": "What is the main challenge hoteliers are facing when implementing sustainable projects",
      "start": 1880550,
      "end": 2007900
    },
    {
      "summary": "In moments of uncertainty, what principle or value do you rely on most to guide your choices? We will pass it on to the next guest. If you're interested in sponsoring episodes of the podcast, drop us a line.",
      "gist": "Checking In: In an Uncertain World",
      "headline": "Pierre: What principle or value do you rely on most in uncertain times",
      "start": 2008620,
      "end": 2070230
    }
  ]
}