{
  "episode": {
    "title": "Curiosity, Inclusivity and Culture: Olivia Immesi on Leading Native Places",
    "guest": "Olivia Immesi, CEO of Native Places",
    "date": "2025-10-17",
    "duration": "58:20",
    "focus": "Creative placemaking, net zero carbon, inclusive leadership"
  },
  "transcription": {
    "text": "Welcome to Checking In, a weekly podcast from hotel owner, the UK's trusted source of hotel industry news and analysis. Each week we meet a new guest and learn their story, all the highs and lows, triumphs and disasters they faced and how they got through to the other side. If you like the podcast, make sure to subscribe on whichever podcast platform you listen to. To get more industry Insight, head to hotelowner.co.uk and subscribe for unlimited access. If you're interested in sponsoring episodes of the podcast, drop us a line at podcastotelowner.co.uk. Hi, I'm Heather, host of this episode where we speak to Olivia Emesi, CEO of Native Places. Olivia spoke about her experience in launching the iconic Hoxton Hotel in Shoreditch and Ace Hotel London. Native's approach to creative placemaking and the importance of maintaining the soul of the brand, its journey to becoming a net zero carbon operation by 2030 and how a more inclusive industry must start from conversations at the top. Welcome, Olivia, and thank you so much for joining us. Thank you for having me. No, it's exciting to be here. So, yeah, to get us started, can you tell us how you first got into the industry, what attracted you to it and take us through some of your early roles? Yeah, definitely. So kind of fell into the industry, which I have found is quite common now. I've been in it for quite some time, so I've been working in hotels now for over two decades. After graduation, I travelled around the US and loved it and wanted to work out a way of how I could live and work there for a bit longer. So back then There was a J1 visa and it was quite easy to get into hospitality because they were very used to taking graduates or people that were studying hospitality for the year. So I managed to get a role within a hotel and that was kind of my entry into it. I didn't join because of the hotel role. I wanted to live in Austin, in Texas, because I fell in love with as a city, someone that's very into music and yeah, just really, really loved my job. And I was like, this is so funny. You wouldn't think this is actually an entire business with a lot of opportunity because you think hospitality and when you. When you're coming from. Because I studied animal nutrition and physiology, so absolutely nothing like totally science nerd. I was just saw hotels as like behind the reception or, you know, maybe even behind the bar or F and B, like food and beverage. Sorry, very, you know, hospitality acronym. But yeah, so I just really liked It I just loved how it was and I just felt that you get one of the most kind of the training that you get in the US and their style of hospitality really different to how England English hospitality and I thought it was such a good introduction to it. Yeah. What would you say were some of the most stark differences? What was it about US hospitality that made it so exciting? Yeah, I think they are naturally much more open and friendly and I'm quite that style of a human. I'm very empathetic and I was really lent into that that when you walked in places people would say, hey, how are you doing? And. And I really like that feeling of that. And I think they're a little bit more brash about how they do it and they really demand service, they demand a quality and the expectation is very high. Yeah. And they'll give you the feedback if it's not being delivered as they expect and they will tell you how other people do it better. And so that was a real learning. But I hadn't experienced English hospitality except as a guest. I'd never worked in it until I came back. But I think I brought those kind of things with me that you have to be really honest about what's working and what's not. Where I do think, I think the English hospitality may be a little bit more relationship led where out there. I think it's very much more about what. It's a bit more aggressive and they very much go after what they want. Yes. I was going to ask, you know, if it was quite a big adjustment later coming into UK hospitality, but it sounds like you say that you were able to use that experience in the us. Yeah, I really, I really felt that that really helped me when I came back into the uk, connections were huge. I made loads of connections. So when I came back to London there was a lot of opportunity for me to walk into a job which was very, very helpful when you move back into it. I started in reservations, so I started basically dealing with guests and on the front desk, then concierge. But my heart and what I really loved to do was the sales side and my next step, I wanted to move from reservation to actually into the sales department. And when I came back to the uk, that's what I managed to do. So yeah, it really, really helped those connections and I think just having that ability to communicate on a different level, that customer service level and what they actually train you was was really interesting. But it helped when you move into Marriott because it was not a Marriott in America, but When I came back to London, I started with Marriott and their training, which you don't realize what's happening is so good. Yeah. Their standards, operational procedures are so good that you can kind of layer in. Then how do you actually deal with customer with that operational knowledge? It really supports your career. Yeah. And what were some of the standout lessons that you used to took from your role at Marriott? I know you've just mentioned obviously the customer service aspect, but yeah, looking back, were there any standout lessons that stay with you today? I think Marriott are very, very good at training and development and they put a lot of time and energy into their people and I really appreciated that. Maybe not so much at the time. I found Marriott to be amazing, but also very much focused on what your career path was, was based on what department you were in and slightly bureaucratic, making decisions, making changes to process. Maybe the offering was a little bit more difficult and could be a little bit stifling. And when I jumped into the lifestyle independent brands, I realized that you had the opportunity to take on a lot more. You could actually influence a lot more of how the entire operation ran, how the brand felt, what the actual processes were. And I recognized while being in those independent brands that the foundation I was given in Marriott helped with that. So you actually understand the complete bones of what you're doing. And because you go to a lifestyle brand, you can actually help so much because you've had that kind of training. Yeah. So the training and development was fantastic within Marriott, but I do think that there was very much like how many years that you do a certain role led to when you actually got promoted to things like that. And probably being someone that was very ambitious was probably quite hard to manage. Yeah. Yeah. I was very much like, what's next for me? What's next for me? And they're just like, well, you've done just got here, so give us a minute, you know. But they were very much like, okay, well why don't we put you on this training course? Why don't you try this? So there was a lot of things like, okay, how can we use you? Because you're obviously ambitious and you want to try and help and deliver. So yeah, yeah, wonderful to, to move into a more limitless position. But as you say, still have that. The grounding. The grounding, exactly, exactly. And having had that experience on the sort of more operational side and then the sales and marketing, has that also forged your leadership today using those components together? I think there's a massive part of traditional hospitality Sales and marketing department didn't usually move into general management and running the entire operation. It wasn't a traditional route. Sales and marketing was its own branch and its own knowledge and authority in what it was actually delivering. And the traditional route to running the entire operation and delivering as a general manager or a managing director usually came from when you'd worked in the front office so usually the front desk and those types of departments or finance. And I think that the commerciality and understanding actually how to drive revenue into your hotel really supported me in how I go to actually run the entire operation. And so moving on from that and before we get on to native places I also wanted to ask about your your work with the Hoxton in Ace Hotel London because two incredible sites, very, very cool. Can you tell us about the work you did there helping to get those up and off the ground? I the move into the independent brands. I realized I absolutely loved it and supported launching the first Malmaison and then had the opportunity I met Sinclair Beecham who was the founder of the original Hoxton and all through connections everybody. It's a very small industry especially if you're in the lifestyle part of the hotel world in the UK but even globally. And I loved his vision, thought he was extraordinary in terms of like his ideas and what he wanted to do and totally wanted to help him open it. So joined the launch of how we you know, positioned Hoxton in East London on the edge of Old Street Roundabout Grayson street which coming from you know, different hotel groups it was and hard sell because I joined there as the director of sales and marketing and to explain to corporate customers and people that you've used other hotels that you've worked for in the past that how close it was to the city but how convenient. The price point was very good because you know they're very value led some, some corporate companies, I had to walk them physically to the hotel to show them the quality and to show them how safe it was to get to that part of East London. And so trying to position that was, was, was difficult. And then just how we kind of launched all of it. We did the one pound sale where we sold 500 rooms every quarter for a pound and it used to crash the website. I mean it was just so popular and it just resonated with so many people and got such a huge kind of brand recognition for just a 208 bedroom hotel in, in Great Eastern street and and we were the kind of the first urban lodge. We were trying to provide something that was value but still designed well. So it was a really interesting concept and it really spoke to a customer and it drew quite a very broad traveler. And we had the prep breakfast that I used to say prep pixies delivered to your door in the night. Lovely. So all of those connections really kind of cemented that it was a quality product because. Because people, you know, like, oh, amazing and pretty part of it. And, you know, and Sinclair's constant about. He wanted to put his money where his mouth was and build something that was luxury to a point, or design led, but also good value. Yeah. And he wanted to get off, get away with the. Get. Get rid of the things that he considered were ripoffs to customers. You know, so those elements of your mini bar and things like that, where you could stock your own mini bar and, you know, from the shop downstairs, I mean, it's literally kind of groundbreaking at the time, but. But it's something that we. We see happening over and over again now. Yeah. And I was obsessed with Ace as a brand. Absolutely loved Alex Calderwood and Kelly, who, you know, supported his, and they both kind of founded the brand. And Brad Wilson, who was the president. I mean, I. I was obsessed with what they did as a brand. And I was in the Hoxton and was trying to create the English version of. Of Ace. I mean, we were just at the beginning of social media. Like, the Facebook page for Hoxton was my own Facebook page. I mean, all of these things you just don't realize. Like, the letter from Olivia, it was like. Because you really, just really feel part of it you've created. It was like my baby, you know, And I. I loved Ace. And when Ace came to speak to me about opening one in London, I was like, I just don't think. I can't be involved. I want to see kind of the magic how it happens, because I was very much like, there must be a formula to this. Like, how you create such and you resonate with so many different brands and so many different people really buy into what you deliver. I was like, there must be a formula to this. There must be this. Plus this gives me. Yeah. You know, I drank the Kool Aid before I had even arrived, you know, but when I got there and I realized that actually all it is is the right people in your team make the magic. And I was like, wow. So that. That is the formula, that it's actually the right people come together and they all push and pull in the same. You know, you're all rowing in the same direction, but you push and pull enough to make sure that the brand stays authentic to its. Its values. Yeah. And it was a huge learning curve for me. It was. It was brilliant to. To be able to be around such brand leaders that really got the kind of DNA of what they were and. And their customer. Yeah. And I just loved every minute. I mean, I adored working at the Hoxton. It was amazing opportunity. But then the opportunity to open ACE was just incredible. And the circles that I got to kind of move in and different publications and, you know, just different brand partnerships and. Yeah, it was amazing. And we really put kind of Shoreditch on the map. Yeah. Yeah. You know, wonderful to be operating in such creative. Yeah, funky spaces. It was just brilliant. And the design and all the different things, it was just. I was like, there. I was the biggest audience and could really then understand how people really got it. Yeah. Corporate customers got. Was different, you know, to what you're trying to sell, but positioning to the lifestyle market and people that want to travel and actually experience and connect to their community. So the reason that they've come to Shoreditch is to feel the best of what is in Shoreditch. And we had a lot of that in the building. So those things made it really easy to kind of connect with the local community. And it's something that just spoke to me so much and has. I've carried it on through wherever I, you know, end up and want and want to grow. Yeah. But I think it really. It really kind of supports that travel experience because most people are doing something to want to experience where they are, you know. Yes, yes. And, you know, a place like Shoreditch with such a unique identity, it sounds like that was really reflected in the. In the sun, in everything. Yeah, it was. It was really brilliant. And, you know, unfortunately, Alex died and Kelly and Brad continued the brand and we continued to grow it. And then I had the opportunity and I was very lucky to have people that really valued my worth, you know, and could see that if I moved into actually running the entire operation, I would deliver for them and for the owners. Because in a lot of these hotels and when you move into, you know, more. Even more of a senior position, you're dealing with a number of states, stakeholders. You know, you're not only dealing with the brand stakeholders and who actually deliver for this brand, but you're actually dealing with. This is somebody's building that you're running. So the roas and. And your return on investment is constantly something that you have to defend and provide clarity on. Yeah. So moving into running the Entire operation was something that I was very. I. I really wanted to do, because when you are the commercial side and you drive a lot of the revenue in, you want to make sure that what you're selling is delivered. Yeah. From a service standpoint, from a product standpoint, and it's actually from a profit standpoint, because you can get a very high rate based on what you sell and you're positioning this asset. But why couldn't it turn so profitable? And I was just like, what, What. Where. Where's the miss, you know, know, disconnect or the misalignment? So there was an opportunity there to actually be part of. Okay, what is happening with the training? What do the team understand about the brand? How can we make sure that that difference is clear when the customer arrives and. And all those things? And then the elements of how do we control costs and without losing our soul. Yeah, yeah. And all of the things that we want to kind of deliver for the guest and say that we will. So it was a. It was a big move, but it was. It was. It was really, really great to be able to actually run the entire operation. Yeah, absolutely. And you mentioned that, you know, the importance of getting all stakeholders on board. What was your approach to that, do you think? It was, in part just having a very fundamental understanding of the brand and its soul, like you say, did the rest sort of fall into place organically? How did you communicate that with shareholders? Yes, I think being able to tell the story, I think, has been one of the reasons that I've managed to deliver for most stakeholders that I'm, you know, working with or for. And I think being able to understand what's the nuance of it, and being able to explain to them the reason that that works in the marketplace and delivers for them has really supported. So understanding the brand has been really key, I think. Also being able to talk in a way that shows them you understand a P and L, you are commercially aware, but you're also aware of what are the levers you have to pull to be able to deliver a profit. Yeah. So, yes, being able to talk of the. What would be considered the fluffy stuff, but also then being able to showcase that actually I know exactly what the margins are on each line. Line. Yeah. And if we moved that away, it would impact the brand, which would affect and maybe save, but it wouldn't drive the adr. Yeah. Which therefore your margins wouldn't work. So I think being able to really talk depending on who the stakeholder is and what. And understanding that stakeholder like, what is it they actually want from you? What are they trying to achieve? And knowing that before you start the conversation. But I do think it does come. The commerciality and what we talked about before, about where your journey in your kind of career. There's much more people coming from the commercial side of hotels to running the entire operation. Because the commercials are the reason that hotels run. Yeah, absolutely. And, yeah, like you say, it goes back to what we were saying about your earlier career and being able to sort of marry these different. Different facets together. But, yeah, wonderful. It must have been so exciting to be in those trailblazing positions and following on from that to present day. Can you tell us how you came to join Native Places? Yeah, I mean, Native has always kind of been on my radar because the partners that we had for our food and beverage outlets in ACE launched their second space within the Native Manchester. So they opened Cultureplex within Native, and it was Pablo and David. I think their company is still called roxico. I'm not 100% sure, but maybe we need to look at that. They launched up with Nativ. I'd heard this name, Native, but after ace, I went and ran the Curtin Hotel and Members Club because I wanted to learn a little bit more about the membership model. And I'm constantly curious and I want to push myself all the time. And I was like, this is a different thing that I've never done before. But the Native thing was exactly the same mentality because I was like, apart hotels and service departments. This is not a world that I've ever done before. But I knew that they had really good bones. I'd been to the Manchester site, the ground floor basically spoke to me because it was the same interior design team as ace. Oh. So that the Lauren Day, who designed a lot of the interiors for ACE London and for ACE as the group, she was the head design or lead designer for ACE Group. She moved away and started her own studio and they appointed her to do Cultureplex in Manchester, which I turned into Ducie Street Warehouse because that's the name of the building. Because Cultureplex moved away from running the F and B operation on my arrival. Really Covid kind of impacted a lot of that. But when I walked in the space, it was like, oh, God, my. My God. It's like I'd come home because it really resonated with me. And I was like, oh, this is such a beautiful design. So I was like, oh, this is beautiful. There's a real. There's real bones here. And that's the flagship. And then I looked around the rest of the assets and I was like, oh, there's something we could do here. We could really connect with a customer that maybe we're not currently talking to and just saw a great opportunity to have a large asset portfolio work in a different marketplace. While it's similar, it's also there's a little bit difference because you're talking to long stay clients, which is a different world than when you're in hotels. Yeah. So yeah, it was, it was a great opportunity to really position a brand as well, which I was very excited by. Yeah. Did you have any apprehensions at all about jumping into what is quite a different space or was it just an exciting move? It was just super exciting. I mean there was a little bit of apprehension, but I was excited by it more than. So one side of my brain was like, like, let's just go for it. Yeah. And I saw the opportunity and yeah, jumped for it. Really? Yeah. It was exciting, wonderful. And, and you just mentioned brand vision. Can you, can you tell us more about the, the picture of the brand story you had in mind when you joined, what, what that looked like and how you planned to, to set that out? I mean, for me, brand equals trust. So it's, how do you build that trust? And I think there's four really key factors to that. It's the product, it's the customer experience, it's being able to tell the story of why, like why this works for that customer and why it was founded. So is it about the product? Is it about the founder? But what is the story of native? Like what do we want to deliver? And then consistency, like consistency is king. And I say that lack of consistency is just like death by a thousand cuts. Yeah. Because it really dilutes your brand. If you walk in somewhere and it feels different, it really impacts what do what you actually think. This is why am I here. Yeah. So understanding our why. And it was super simple. Like it's like just great places in great locations filled with great people. Very simple if it, if it looks a certain way. Because place making is something that people use quite regularly now. But I was actually in a brand that created that. How do you place make and Ace were just so good at how they did this cultural connection and who were the partnerships and there was a real brand alignment and you really, you weren't able, there was just. While it could be there wasn't a commercial decision, but it was actually based on a brand decision. And that's where I've always gone into every brand after that curtain. Native. Okay, so what is the brand decision? Who should we be partnering with? So we actually live and breathe our values so people don't. It doesn't become diluted and there isn't any consistency. Yeah, yeah. So just making sure that the right partners were there, that that helps you resonate with different audiences. Because if you have similar values to another brand and you have a connection and you can kind of sell, promote each other, it supports that awareness. Yeah. And so that brand positioning was really key and who we partnered with. Looking at the touch points for guests, like what did they actually interact with so that, that there was a story there and focus on consistency of product. It was really, really key. Yeah. Yeah, absolutely. And in your opinion, what are some of the pillars of, you know, successfully placemaking? We've touched on the a bit. Is it local partnerships? Is it. I think it's. It's something that celebrates similar values. They don't have to be exactly the same, but there has to be like a core underneath that runs through both brands. Yeah. And I think placemaking is about people that care, actually caring. So the service level and the people that you actually are filling the space with care about why they're there. And so actually caring. I think the community is such a broad term now, but I do think the local community and celebrating the artisans in that community really supports that place making as well. So people feel that they are cared for while they're in that space. So an inclusive service level that celebrates individuals and the right offering. So you're delivering on what the offering is. If that's food, drinks, if it's some type of, I don't know, programming. So if somebody's coming to actually attend an event in your space, I think all of those things have to be thought through. Yeah. And there has to be a truth to it. Yeah, yeah, absolutely. I mean, there's lots of brand partnerships you could do just to position, but it doesn't necessarily mean that it is actually real. So the, the truth behind it is key. Yeah. And you know, it's something that really resonates with the guests, isn't it? That can't be inauthentic. I think they can. Yeah. Authenticity is massive. I mean, most people that go to a certain type of hotel group or stay in a certain type of accommodation, they are a little bit more curious. So we definitely get the traveler that's more curious and wants to kind of explore because they're not necessarily somebody that would stay in a kind of Traditional kind of cream box. They're actually fine with being something a little bit different and unique. So I think that curiosity has to be. Has to resonate with your public spaces and how you're sharing what you. What happens in the community around you. Yeah. And your team have to be somebody that really, like, celebrates where they work and. And why they're there. Yeah. You know, because that's the first portal call for a guest. They talk to one of your team. I mean, it starts with the booking engine and you can do all that with your, you know, your platforms and your social media and that's, I think, a little bit easier to control. And then when you move into actually the. The human interaction and when somebody comes into your operation, I think that's the element that they still have to feel that throughout the entire journey. Yeah, yeah. That. That first impression is priceless. Is it? Yeah, that's like. From the music to the lighting to the uniform, you know, everything has to feel kind of on point. Yeah. And it seems, you know, a theme throughout these brilliant places you've worked is that just inherent understanding of the guest and what the guest wants and being able to see it through their perspective. I think so. I think also, yeah. Kind of getting the guest. Yeah. Understanding them and actually having conversations. I mean, I love that, you know, chatting to the guest, finding out, okay, why are you here? I get it now. How did you find us? You know, those types of questions. Being naturally curious and empathetic. You know, actually delivering. Because hospitality is actually about giving care. Yeah. So, yeah. Yeah. I think understanding your guest is key. And obviously now with data, you can have a lot more understanding, which, you know, is exciting. Yeah, absolutely. A great thing to delve into and be able to build these pictures. And Yeah. I wanted to also ask about the merger with NUMA and how that came about. And I also understand, I believe Native by numa is freshly launched. So. Yeah, if you could tell us. Yeah. So I think Native has been in the market for 25 years and it started very much as corporate housing. My arrival was, how do we position it as a lifestyle brand? And the fund we were part of was. Was up for. In terms of, you know, it was a sale process and NUMA was. Was like a natural fit. I think there's some similar values, definitely, between both brands and we talk to similar customers. I mean, there is slightly differences in the demographics, but we want to deliver the same experience to our guests. But it's slightly nuanced because NUMA is completely digital experience and we have More of a customer service level in terms of actual physical people in the operation. And Christian Gazer, the founder with Dimitri and Gerhardt of numa. We met and we just had. There was a real synergy by what we wanted to deliver and they really loved what we've created with the brand Native and where we've positioned it in the market. And we have a strong following not only from lifestyle leisure travelers, but also corporate travelers and saw an opportunity that Native could merge with numa in terms of the NUMA Group and continue the brand as by numa, but still Native as the more premium product within the group. Yeah, so that's what we're gonna do, which is super exciting. So continue all the things that, that we do. But the layer of technology that NUMA bring supports that kind of frictionless guest journey. Yeah. And yeah, there's loads of opportunity to grow Native underneath the NUMA Group throughout the uk but you know, across Europe too and beyond. Yeah, that's. It sounds like it's a very symbiotic relationship and one that like you say, allows Native to retain its core and its totally. Yeah. Uniqueness and deliver on our kind of core values. But there is a lot of synergy and like you said, the symbiotic relationship is definitely key and I think location wise there was a lot of plus points, you know, and then the opportunity for Native to be in key cities in the right locations still, you know, kind of focuses on our vision. Yeah. So the great location is the reason people majority go to a place. Yeah, yeah. They want to be in that city. So. Yeah, no, very exciting. Wonderful. And just in practice, what was, what has that process been like guiding Native through that transition? Was, was the shared value with NUMA helpful in that regard? Absolutely, yeah. And I think that's really key, you know, understanding that there is. You're talking to a customer, making sure that we all understand who that customer is. And in all of this the customer is so important, the guest. So making sure that that message is clear for everybody and in the business, you know, we have a large team in Native and our team is. Well, they have a large team too, but it's. Ours is very much more in the operation because we have people on the ground where they don't necessarily have staff members in their properties. Yeah. And so that messaging to the team to know that what they're still delivering is, is still vital and won't change. It's just going to have that there is elements of what NUMA can bring to our operation really support The. Their. Them delivering for the guest because it meant that they were not so tied up with doing administrative stuff. The technology allows a bit more flexibility and freedom for them to actually deal with the guest. Yeah. Upon arrival and things like that. So yeah, they. I think just the messaging throughout. And as we touched on before, the stakeholders of not only NUMA stakeholders but the Native portfolio is a mixture of both leases and management agreements. So there are a number of owners that would need to. And I've managed that whole process of how do we ensure that everybody feels really good about, you know, they've invested in Native being their operator, what would retain, what would be changed and making sure the stakeholders feel really comfortable in that change, which has been, you know, it's been a year now and we're getting there. But there was a lot of different things in the journey. It's something I've never done before. So. Yeah. So selling a business through, you know, private equity sale, there's a lot of due diligence that has to be done and there's a lot of, you know, a lot of data that needs to be shared and absorbed and the right, the right kind of process needs to be followed. But also you need to just make sure that you're managing all of this while also delivering on a business and continuing to drive the sales and the profits. Yeah. So it's. It was. It was a very interesting journey and definitely learned a lot through that entire process. Yeah, that sounds busy. Busy. It was. It still is. Yeah, I could imagine it. And what were some of those or what have been some of the main takeaways for you going through this process is is there anything you've learned that's surprised you along the way? I think being the authority of the native business and knowing that your knowledge and knowing that you actually understand the entire business and being able to explain that through, I think I was. It. Definitely something that made me realise how much I have done to deliver for Native and where we've managed to get it to over four years has been some really big growth. How we've managed to drive the director share so how much customers come to us through our booking engine, how we've driven the corporate share and really diversified the market and how all the market segments really deliver to make us a very profitable business. And I think going through that and talking through each area and how that works to deliver for making it something that's desirable to buy was really interesting because I don't think you don't realize how much has actually changed when you actually walk somebody through how the business has changed and where it's sitting today. Yeah, that was definitely a very interesting thing. And I think just knowing that you have the ability to do it and a lot of the time, you know, I'm aware that I'm usually the only woman in a lot of these rooms and I think sometimes, you know, we potentially have to prove ourselves a little bit more and that I just wanted to make sure that I can really support some other women to come into these rooms and be at the table with me. And it really resonates with me that I need to ensure that there's development paths within my team, but also for future generations that we can help this a little bit more. Yeah, and I was going to ask you about that because as we all know, it is still quite a male dominated industry at the top in places. From your perspective, what do you think can be done from within the industry to, you know, support women who, who want to attain these senior roles in what can sometimes not be the most open space for them? Yeah, I think it has to come from the top. And I've been very lucky with having amazing male and female leaders that saw my value and helped. But I also did find that I had to be the authority in any department that I was running to ensure that if I was ever questioned, I would have the answer and would know it. Not just the answer, but also the next five questions that could be asked about it. So I think that I don't think that's going to really change. I think everybody needs to feel that no matter where their gender, you know, you have to be prepared and you have to know your stuff. But I think that maybe sometimes women don't necessarily feel as comfortable with kind of enlarging upon their knowledge. Yeah. And I think diversity and inclusivity is not just a tick box in a business. I think it really has to be thought through. But I do think that's quite difficult. And I do realize that people don't see it. They do not actually recognize that the room is mostly men and that's mostly that men don't see it. And that is where the conversation has to start and bringing it up. So I obviously bring it up, but it's how do we make it that people feel comfortable with their voice being heard and making room for them to speak? Because as I said, I don't think, you know, there's the whole blowing your own trumpet. And I do think a lot of women don't necessarily do it as naturally. Yeah. As Men. Yeah. Just from being in an industry for a very long time and having leaders in my team that are both male and female. You know, some people need much more encouragement and recognition that you've. Actually. That was all you. You've delivered that. Oh, you know, that recognition. It was like me helping with the sale of native places and all of the things that have been put in place. It's like actually, yes, you know, that. That recognition. So I think it has to start from the leadership. People who are in the leadership need to recognize it. I think people that are, you know, fathers, that have daughters need to think. Right. Where. Where else can I help with this? But I have noticed and I've spoken to people now that they don't even realize I said in this room is just literally all men. Yeah. And it's not just the male, female. It's not just gender. It's actually, you know, inclusivity in terms of nationality or. I think there's just so many elements that you don't even realize. And I think just bringing those different people to the table also really supports your business. So many different brains on a problem really helps. And that the more diverse they are to you, the better. Yeah. They bring to it just a different. Different view viewpoint. It really supports. So you. Yeah. I think my messaging to obviously my daughter and my nieces is that we need to be super curious. We need to make sure that we are the authority and we should not be afraid to speak in the room and ask for a place at the table. You need to find advocates. You need to make sure that you have the right mentors and think about where you actually want to be. But, yeah, I think it comes from the top two. Yeah. Yeah. You know, it's across all industries, really. Like you say, there is sadly a propensity for women to somewhat fear being that big presence. I know. I think it's like we're kind of taught to stay a bit quieter and. Be a bit more. I don't. Yeah. It's interesting because I don't think I was ever taught that. But I don't know whether it's just how it's just be a little bit more, I don't know, malleable. But yeah, I think once you know something, you just have to really believe in yourself. You need to know. I know it and I'm gonna say it. Yeah, yeah. So. But you also need people around you that tell you you've got it, you know, So I think having some really key people in the industry and actually I Think if you see people, you can see yourself there. You're like, oh, okay. So it's, it's available to me. You know, I think having really people in positions and they're visible so that they can be seen by girls and, you know, younger women. Yeah. So representation is massive. But I don't. I do see improvements, but I also. I don't know whether I can see a bit of, you know, regression. Gosh. Yeah. I was going to ask if you, you know, foresee any change in the tide in, you know, the coming years or more of these conversations happening, but I didn't. I don't know, geopolitically, it's just a little bit, you know, scary. Right. And I think we just need to make sure that we're teaching our children, boys and girls, any gender, that everything's equal, you know, and everything's fair. So. Yeah, yeah, it's a tough one, but I do. I would love to make sure that, you know, I'm as involved as possible and make sure that within my team is a very broad mix of individuals that really, again, bring to the table all of their experiences and really add so much value. Yeah, yeah. You know, every person has their own stories and life experiences. Yeah. It adds so much to your business and so much to the bottom line. It's a tricky one. But what would your advice be to other hoteliers out there who want to strive to be more inclusive, but maybe don't know where to start or don't know quite what the right approach is with the right conversations to have? I think we did something. We had some radical inclusivity training, so we worked with different partners because sometimes it's very difficult, like you said, you don't actually realize you're, you know, it's very difficult to be objective. So I think there's some brilliant people doing some great work out there that they're easy to find. And having some of those trainings and actually talking to your team, I think it's just like there are hidden gems that they will tell you, you know, but definitely there's. There's a availability to ensure that you're training your leaders and somebody will come and look at your business and get. Give you ideas. And I think having that outside view really helps because you can be quite blinkered. And I do, like I said, I don't think people realize, you know, and I do think if there's a way of actually having some support is really key. Well, hopefully it's. It's something we. We see more of in the industry going ahead. So I also wanted to ask about NATO's plans to achieve net zero carbon operation by 2030. Can you tell us more about what goes into that and what perhaps some of the challenges have been along that journey? Absolutely. I think, as we've said before, data drives a lot of decisions and we can see there's a difference slightly in the generations of traveler, like this generational difference in terms of how they're deciding where to stay and your practices and how you actually support your community. Your effect on the planet is one of the deciding factors on choosing their accommodation. And we want to be a company that really does focus on treading lightly on the planet and it not just to be greenwashing, like, what can we actually do? Data is hard to compile and we have outsourced some support with that to ensure that we can understand what is our carbon use. It's hard to know. I mean, in our nature apart, hotels and service departments are slightly less energy heavy just because we don't have all of the different elements that hotels have in terms of all of the facilities. And the way that we actually maintain and clean rooms is not. Not daily. So there is an element that there is, you know, a lower usage in terms of your energy and water consumption and obviously water consumption because you're cleaning linen and washing things. But it's not just enough to know, to say that you want to understand what does good look like within your emissions. And so tracking that, and that is difficult to track, but it's also very difficult when your portfolio has such a broad scope in terms of the building age and size. So it's not easy to actually track all of that if it's a very old building, like we have some that are quite old and like kind of Victorian summer, Georgian, and then we've got some that are, you know, literally warehouses and huge, vast atriums. So it's difficult to. To know what good looks like and how can we control that. But also, again, as we've referred to in terms of stakeholders, and it's taking the stakeholder for each building on the journey with you because a lot of owners are expecting you to be the authority and how can they make this more, you know, the ESG rating better for their building, but you also need to be able to show them the investment is going to deliver in terms of the ROI on that investment. And that can not necessarily be as clear as you imagined. So there are a few moving parts with how do we get to net zero by 2030? And it has to be the operation, everybody has to be part of it. Tracking is key. And then looking at where are the winds, so our energy provider making sure that's coming from a greener source so all of those things are more sustainably sourced. Where are our partners in terms of what we purchase for the operation? Anything that we procure, F and B can be very local, which is good. Food and beverage can be quite local, but you've got to look at, at your toiletries and you know, and also you also look at the effect that your providers are having on, on the environment as well. So if your partner is a certain toiletry, what's their value in terms of how they're looking at their carbon emissions and things like that? So we're just trying to track each thing and working on, okay, what is the biggest win at the moment, how can we actually draw that down? And then having a quite a clear path to where can we make the biggest impact? And you know, speaking about stakeholders and ROI, when it comes to this, how does one find the best balance between that commercial success whilst upholding these sustainable values? Where is that sweet spot and how does that work when it's not like you say, such a clear image necessarily? I think it's really difficult and it's not very easy answer to, to that question. I think that I've been in a number of conversations and at events and listened to very, very sustainable properties and listen to are they actually getting a return on their investment in terms of what they can get for their bedroom pricing? And that doesn't necessarily resonate, it doesn't mean that people are willing to pay a little bit more. They're actually still very value led. So it is quite difficult to see what is that balance and what is that sweet spot. And I think it's if you can be clear with the customer about what you're doing, if they know the journey that you're on and you can show transparency in what you're trying to deliver. I think that has really supported us for our corporate customers because a corporate traveler, a lot of corporate customers, they were on what is called a corporate program. So a lot of companies have travel programs where they decide on which hotel groups or which hotels they'll use in cities. And a lot of them require information and data on your carbon emissions now. So it's kind of become very much a corporate request for pricing and RFP process. But the leisure traveler, we see some decisions being made, but we also see that they're still very much focused on the product price of the room. So while generations are choosing, there is still broad spectrum that are based on they're coming because of a price point and the location. So it is quite difficult to know where to invest and what the ROIs are in each area. But there are natural ROIs with having less energy in your building because you're paying less on utilities. So. So that's a natural profit maker. So that is a given for certain stakeholders. But you're also making a decision that supports the environment, so that then supports the decision that you don't necessarily have to increase your price point. You're actually delivering on profitability because your costs are lower. So those things are. You have to look at each area. And before we started the acquisition and the merger with numa, I started the Process Corp process. So it was very heavily involved with all the different areas. So we're going to look at that into 2026 and continue that path. So we've started the action plan with the merger. We're obviously aligning with what are, you know, where we're going to use and support each other as the brands. And now we can look again about how we continue that journey to reducing our emissions. Yeah, brilliant. That's a wonderful ambition and yeah, I'm sure it will pay its dividends in time. It's about resilience, isn't it, and longevity. This is a long vision. You want these properties, they're going to be around for many years and you want that to have the right impact on that location, but also on the environment. Yeah, yeah. Future generations. It's important to keep that in mind and sort of looking ahead again on a sort of wider scale. How do you see apart hotels evolving as a category and hospitality especially, how, you know, they perform next to your more traditional sites, how do you see that journey kind of evolving? So the biggest thing with moving from the more traditional hotels to apart hotels and the service department world is the profitability and all. I saw that while in traditional hotels there's a lot of what we call peaks and troughs in terms of the night stay, there's what's considered a shoulder night, which would usually have kind of a lower occupancy. And most people come weekends and come midweek. And in the aparthotel world you have a much flatter length of stay. So length of stay is how long a guest stays and that really supports your profitability because as how much you clean a room, the energy they consume and also the amount of staff that you need. So in an aparthotel you can provide the flexibility of an apartment and give that guest something a bit different, but you still can give them that kind of lifestyle boutique hotel on the ground floor in the service element, but you just don't need the same level of staff as a hotel. And that's why I was like, oh, this is a really interesting market because it really talks to the Airbnb generation, because you're actually. But you're going somewhere that you know exactly what you're going to get. When I'm an Airbnb user and sometimes it's not necessarily what it looks like in the photo. Yeah. And I think that was my. I thought there's so much ways that you can position this, that you can speak to different customers depending, and the flexibility just talks to them in such a different way. And I think. And the future for Native by Numa is that we can have hybrid buildings, so they're apart hotels, but they have apartments and bedrooms. So you can have a guest that only wants to stay two nights and they can have that room, or you can have a guest that's staying two weeks, three months, six months, and they're in their apartment. So, yeah, the. The apart hotel sector is growing and it's a very profitable sector for. For most stakeholders, and it is delivering something for a guest that I think is talking to a wider audience. It still gives them the escape and the feeling of kind of leaving their life admin at home, but it gives them the kind of space and facilities that they would be able to make, you know, a more flexible stay that they can choose to dine in or dine out. Yeah. So it speaks to a wider audience and it's actually, you know, it's not a niche market. And, yeah, I think there's something to be said for. For giving guests that control in a way. Right? Yeah, yeah, no, definitely that they can kind of use the space as they want. Yeah. And they know that there's going to be a quality because it's coming from a brand. It's not like the unknown. Yes, yes. And yeah, it must be really interesting as well, like you say, to have these sort of different types of relationships with guests, the long term and the shorter term. That must be such a unique. It's very different because somebody that's staying for six months really sees it as their home and someone saying for two days, they. They naturally want to feel at home and comfortable, but they're not going to be staying as long, but they really want to be outside in the city that they've Chosen to be in. So they want that connection. Yeah, you know, and, and our expertise on what, what's the place to be go see. But the longer stay guest wants that too, but they also want to have the recognition. Yeah, yeah, Brilliant. Brilliant. And sort of looking back at your career, if you could pass on a piece of advice to our listeners. I think continue to be curious. Hospitality is about adapting and I think about natural empathy and that curiosity allows you to evolve as the industry evolves. And I think, yeah, just continue to be curious. It's not just one way and be open to the new things. And technology is just giving so much opportunity not to be scared of it. Yeah, yeah. While still having the elements of the, the guest service that gives that connection. But yeah, be curious. Yeah. And it seems from what you said, that's curiosity in a way is embedded in the, in the Native Places brand. Yeah, I think. Well, I hope so. I hope that that's what comes across that we want to be naturally curious and we, you know, attract that type of traveler and that type of guest and we really celebrate diversity and we want everyone to feel really inclusive with us that, you know, we can connect you with something but we can also, we also celebrate everybody that's in the building in our local area. Fabulous. Fabulous. And looking ahead, what's next for Native Places? Well, as I said there's, I think because the ex. My expertise and my team's expertise, we, we know now apart hotels, service departments and hotels. So the brand could go into any type of kind of operation depending on the asset. So really looking and working with the real estate team about all the opportunities that are out there and what could we do with that building, actually making it a little bit more bespoke to where the marketplace, what works in those type of locations and delivery for the guest, but also the stakeholders. So it could be a traditional. Well, it would never be a traditional hotel, but there would be more hotel elements to it being that it would be smaller rooms and potentially not having kitchenettes. But then you would have the downstairs vibrant space for guests to connect and you know, there'd be some food and beverage element within that or the aparthotel world or having a hybrid building that has both in it. So I think we just need the opportunities to look at each asset and make the right decision for that, for that property. So that's very exciting. And it can go into any city. You know, there's some cities that really talk to corporate travel, there's some that don't, but they have a real Leisure travel. And if you have the right product, you could speak to both. Yeah, brilliant. Well, yeah, it'll be exciting to see, see how this all develops and. Yeah, fantastic. Thank you. Finally, we finish each episode with a question left by the last guest. Our last guest was Karim Kassim, who's owner of Horwood House Hotel. And he asked, do you think you can ever really retire from this industry once you're in it? No. I think you're naturally a hotelier and I do think it comes from empathy. I think it's if you're somebody again, you're curious, but if you're empathetic, you naturally have hospitality or you're naturally hospitable and then when you've worked in it, it's. It's difficult to move away from it really is. It's such a fast paced industry. There's so much exciting stuff that happens and you get to meet so many different people. I think. Yeah, I think once you've stepped in, it's hard to come out. Definitely. Yeah. That was his sentiment as well. And I think most people. Yeah. In the blood. And finally, do you have a question to leave for our next guest? Yes, I think it would be, what's one thing you wish you'd learned earlier about leading people and how has it shaped the kind of leader you are today? Fabulous question. Olivia will pass that on. And thank you so much for joining us. It's been great speaking with you. Thank you so much. It's been really brilliant. Thank you. Thanks for listening to Checking In, a weekly podcast from hotel owner, the UK's trusted source of hotel industry news and analysis. If you like the podcast, make sure to subscribe on whichever podcast platform you listen to. To get more industry Insight, head to hotelowner.co.uk and subscribe for unlimited access. If you're interested in sponsoring episodes of the podcast, drop us a line at podcastotelowner.co.uk.",
    "words": 10151,
    "confidence": 0.97447866,
    "audio_duration": 3501
  },
  "utterances": [
    {
      "speaker": "A",
      "text": "Welcome to Checking In, a weekly podcast from hotel owner, the UK's trusted source of hotel industry news and analysis. Each week we meet a new guest and learn their story, all the highs and lows, triumphs and disasters they faced and how they got through to the other side. If you like the podcast, make sure to subscribe on whichever podcast platform you listen to. To get more industry Insight, head to hotelowner.co.uk and subscribe for unlimited access. If you're interested in sponsoring episodes of the podcast, drop us a line at podcastotelowner.co.uk.",
      "start": 1280,
      "end": 30560,
      "confidence": 0.9923663
    },
    {
      "speaker": "B",
      "text": "Hi, I'm Heather, host of this episode where we speak to Olivia Emesi, CEO of Native Places. Olivia spoke about her experience in launching the iconic Hoxton Hotel in Shoreditch and Ace Hotel London. Native's approach to creative placemaking and the importance of maintaining the soul of the brand, its journey to becoming a net zero carbon operation by 2030 and how a more inclusive industry must start from conversations at the top. Welcome, Olivia, and thank you so much for joining us.",
      "start": 31450,
      "end": 62030,
      "confidence": 0.9846937
    },
    {
      "speaker": "C",
      "text": "Thank you for having me. No, it's exciting to be here.",
      "start": 62350,
      "end": 64670,
      "confidence": 0.9481978
    },
    {
      "speaker": "B",
      "text": "So, yeah, to get us started, can you tell us how you first got into the industry, what attracted you to it and take us through some of your early roles?",
      "start": 65710,
      "end": 74190,
      "confidence": 0.99644554
    },
    {
      "speaker": "C",
      "text": "Yeah, definitely. So kind of fell into the industry, which I have found is quite common now. I've been in it for quite some time, so I've been working in hotels now for over two decades. After graduation, I travelled around the US and loved it and wanted to work out a way of how I could live and work there for a bit longer. So back then There was a J1 visa and it was quite easy to get into hospitality because they were very used to taking graduates or people that were studying hospitality for the year. So I managed to get a role within a hotel and that was kind of my entry into it. I didn't join because of the hotel role. I wanted to live in Austin, in Texas, because I fell in love with as a city, someone that's very into music and yeah, just really, really loved my job. And I was like, this is so funny. You wouldn't think this is actually an entire business with a lot of opportunity because you think hospitality and when you. When you're coming from. Because I studied animal nutrition and physiology, so absolutely nothing like totally science nerd. I was just saw hotels as like behind the reception or, you know, maybe even behind the bar or F and B, like food and beverage. Sorry, very, you know, hospitality acronym. But yeah, so I just really liked It I just loved how it was and I just felt that you get one of the most kind of the training that you get in the US and their style of hospitality really different to how England English hospitality and I thought it was such a good introduction to it.",
      "start": 74190,
      "end": 172100,
      "confidence": 0.977264
    },
    {
      "speaker": "B",
      "text": "Yeah. What would you say were some of the most stark differences? What was it about US hospitality that made it so exciting?",
      "start": 172100,
      "end": 181060,
      "confidence": 0.984559
    },
    {
      "speaker": "C",
      "text": "Yeah, I think they are naturally much more open and friendly and I'm quite that style of a human. I'm very empathetic and I was really lent into that that when you walked in places people would say, hey, how are you doing? And. And I really like that feeling of that. And I think they're a little bit more brash about how they do it and they really demand service, they demand a quality and the expectation is very high.",
      "start": 181140,
      "end": 208630,
      "confidence": 0.9715566
    },
    {
      "speaker": "B",
      "text": "Yeah.",
      "start": 208870,
      "end": 209310,
      "confidence": 0.9739583
    },
    {
      "speaker": "C",
      "text": "And they'll give you the feedback if it's not being delivered as they expect and they will tell you how other people do it better. And so that was a real learning. But I hadn't experienced English hospitality except as a guest. I'd never worked in it until I came back. But I think I brought those kind of things with me that you have to be really honest about what's working and what's not. Where I do think, I think the English hospitality may be a little bit more relationship led where out there. I think it's very much more about what. It's a bit more aggressive and they very much go after what they want.",
      "start": 209310,
      "end": 242690,
      "confidence": 0.9789799
    },
    {
      "speaker": "B",
      "text": "Yes. I was going to ask, you know, if it was quite a big adjustment later coming into UK hospitality, but it sounds like you say that you were able to use that experience in the us.",
      "start": 242850,
      "end": 252690,
      "confidence": 0.9614346
    },
    {
      "speaker": "C",
      "text": "Yeah, I really, I really felt that that really helped me when I came back into the uk, connections were huge. I made loads of connections. So when I came back to London there was a lot of opportunity for me to walk into a job which was very, very helpful when you move back into it. I started in reservations, so I started basically dealing with guests and on the front desk, then concierge. But my heart and what I really loved to do was the sales side and my next step, I wanted to move from reservation to actually into the sales department. And when I came back to the uk, that's what I managed to do. So yeah, it really, really helped those connections and I think just having that ability to communicate on a different level, that customer service level and what they actually train you was was really interesting. But it helped when you move into Marriott because it was not a Marriott in America, but When I came back to London, I started with Marriott and their training, which you don't realize what's happening is so good.",
      "start": 252850,
      "end": 315350,
      "confidence": 0.98332256
    },
    {
      "speaker": "B",
      "text": "Yeah.",
      "start": 315590,
      "end": 316070,
      "confidence": 0.8535156
    },
    {
      "speaker": "C",
      "text": "Their standards, operational procedures are so good that you can kind of layer in. Then how do you actually deal with customer with that operational knowledge? It really supports your career.",
      "start": 316070,
      "end": 325910,
      "confidence": 0.9904864
    },
    {
      "speaker": "B",
      "text": "Yeah. And what were some of the standout lessons that you used to took from your role at Marriott? I know you've just mentioned obviously the customer service aspect, but yeah, looking back, were there any standout lessons that stay with you today?",
      "start": 326310,
      "end": 342010,
      "confidence": 0.9545747
    },
    {
      "speaker": "C",
      "text": "I think Marriott are very, very good at training and development and they put a lot of time and energy into their people and I really appreciated that. Maybe not so much at the time. I found Marriott to be amazing, but also very much focused on what your career path was, was based on what department you were in and slightly bureaucratic, making decisions, making changes to process. Maybe the offering was a little bit more difficult and could be a little bit stifling. And when I jumped into the lifestyle independent brands, I realized that you had the opportunity to take on a lot more. You could actually influence a lot more of how the entire operation ran, how the brand felt, what the actual processes were. And I recognized while being in those independent brands that the foundation I was given in Marriott helped with that. So you actually understand the complete bones of what you're doing. And because you go to a lifestyle brand, you can actually help so much because you've had that kind of training.",
      "start": 343210,
      "end": 419970,
      "confidence": 0.97749674
    },
    {
      "speaker": "B",
      "text": "Yeah.",
      "start": 420290,
      "end": 420770,
      "confidence": 0.9827474
    },
    {
      "speaker": "C",
      "text": "So the training and development was fantastic within Marriott, but I do think that there was very much like how many years that you do a certain role led to when you actually got promoted to things like that. And probably being someone that was very ambitious was probably quite hard to manage.",
      "start": 420930,
      "end": 435010,
      "confidence": 0.97640663
    },
    {
      "speaker": "B",
      "text": "Yeah.",
      "start": 435410,
      "end": 435890,
      "confidence": 0.9842122
    },
    {
      "speaker": "A",
      "text": "Yeah.",
      "start": 437970,
      "end": 438330,
      "confidence": 0.9798177
    },
    {
      "speaker": "C",
      "text": "I was very much like, what's next for me? What's next for me? And they're just like, well, you've done just got here, so give us a minute, you know. But they were very much like, okay, well why don't we put you on this training course? Why don't you try this? So there was a lot of things like, okay, how can we use you? Because you're obviously ambitious and you want to try and help and deliver.",
      "start": 438330,
      "end": 454010,
      "confidence": 0.9745053
    },
    {
      "speaker": "B",
      "text": "So yeah, yeah, wonderful to, to move into a more limitless position. But as you say, still have that.",
      "start": 454250,
      "end": 461770,
      "confidence": 0.9897718
    },
    {
      "speaker": "C",
      "text": "The grounding.",
      "start": 462250,
      "end": 463090,
      "confidence": 0.97094727
    },
    {
      "speaker": "B",
      "text": "The grounding, exactly, exactly. And having had that experience on the sort of more operational side and then the sales and marketing, has that also forged your leadership today using those components together?",
      "start": 463090,
      "end": 478100,
      "confidence": 0.9837807
    },
    {
      "speaker": "C",
      "text": "I think there's a massive part of traditional hospitality Sales and marketing department didn't usually move into general management and running the entire operation. It wasn't a traditional route. Sales and marketing was its own branch and its own knowledge and authority in what it was actually delivering. And the traditional route to running the entire operation and delivering as a general manager or a managing director usually came from when you'd worked in the front office so usually the front desk and those types of departments or finance. And I think that the commerciality and understanding actually how to drive revenue into your hotel really supported me in how I go to actually run the entire operation.",
      "start": 478740,
      "end": 525280,
      "confidence": 0.97300076
    },
    {
      "speaker": "B",
      "text": "And so moving on from that and before we get on to native places I also wanted to ask about your your work with the Hoxton in Ace Hotel London because two incredible sites, very, very cool. Can you tell us about the work you did there helping to get those up and off the ground?",
      "start": 525440,
      "end": 544320,
      "confidence": 0.9747002
    },
    {
      "speaker": "C",
      "text": "I the move into the independent brands. I realized I absolutely loved it and supported launching the first Malmaison and then had the opportunity I met Sinclair Beecham who was the founder of the original Hoxton and all through connections everybody. It's a very small industry especially if you're in the lifestyle part of the hotel world in the UK but even globally. And I loved his vision, thought he was extraordinary in terms of like his ideas and what he wanted to do and totally wanted to help him open it. So joined the launch of how we you know, positioned Hoxton in East London on the edge of Old Street Roundabout Grayson street which coming from you know, different hotel groups it was and hard sell because I joined there as the director of sales and marketing and to explain to corporate customers and people that you've used other hotels that you've worked for in the past that how close it was to the city but how convenient. The price point was very good because you know they're very value led some, some corporate companies, I had to walk them physically to the hotel to show them the quality and to show them how safe it was to get to that part of East London. And so trying to position that was, was, was difficult. And then just how we kind of launched all of it. We did the one pound sale where we sold 500 rooms every quarter for a pound and it used to crash the website. I mean it was just so popular and it just resonated with so many people and got such a huge kind of brand recognition for just a 208 bedroom hotel in, in Great Eastern street and and we were the kind of the first urban lodge. We were trying to provide something that was value but still designed well. So it was a really interesting concept and it really spoke to a customer and it drew quite a very broad traveler. And we had the prep breakfast that I used to say prep pixies delivered to your door in the night.",
      "start": 544880,
      "end": 679640,
      "confidence": 0.9766226
    },
    {
      "speaker": "B",
      "text": "Lovely.",
      "start": 680120,
      "end": 680680,
      "confidence": 0.87597656
    },
    {
      "speaker": "C",
      "text": "So all of those connections really kind of cemented that it was a quality product because. Because people, you know, like, oh, amazing and pretty part of it. And, you know, and Sinclair's constant about. He wanted to put his money where his mouth was and build something that was luxury to a point, or design led, but also good value.",
      "start": 680680,
      "end": 697960,
      "confidence": 0.9754365
    },
    {
      "speaker": "B",
      "text": "Yeah.",
      "start": 698520,
      "end": 698880,
      "confidence": 0.8357747
    },
    {
      "speaker": "C",
      "text": "And he wanted to get off, get away with the. Get. Get rid of the things that he considered were ripoffs to customers. You know, so those elements of your mini bar and things like that, where you could stock your own mini bar and, you know, from the shop downstairs, I mean, it's literally kind of groundbreaking at the time, but. But it's something that we. We see happening over and over again now.",
      "start": 698880,
      "end": 716880,
      "confidence": 0.9728816
    },
    {
      "speaker": "B",
      "text": "Yeah.",
      "start": 717040,
      "end": 717600,
      "confidence": 0.9550781
    },
    {
      "speaker": "C",
      "text": "And I was obsessed with Ace as a brand. Absolutely loved Alex Calderwood and Kelly, who, you know, supported his, and they both kind of founded the brand. And Brad Wilson, who was the president. I mean, I. I was obsessed with what they did as a brand. And I was in the Hoxton and was trying to create the English version of. Of Ace. I mean, we were just at the beginning of social media. Like, the Facebook page for Hoxton was my own Facebook page. I mean, all of these things you just don't realize. Like, the letter from Olivia, it was like. Because you really, just really feel part of it you've created. It was like my baby, you know, And I. I loved Ace. And when Ace came to speak to me about opening one in London, I was like, I just don't think. I can't be involved. I want to see kind of the magic how it happens, because I was very much like, there must be a formula to this. Like, how you create such and you resonate with so many different brands and so many different people really buy into what you deliver. I was like, there must be a formula to this. There must be this. Plus this gives me.",
      "start": 717840,
      "end": 781270,
      "confidence": 0.9788287
    },
    {
      "speaker": "B",
      "text": "Yeah.",
      "start": 781270,
      "end": 781750,
      "confidence": 0.79264325
    },
    {
      "speaker": "C",
      "text": "You know, I drank the Kool Aid before I had even arrived, you know, but when I got there and I realized that actually all it is is the right people in your team make the magic. And I was like, wow. So that. That is the formula, that it's actually the right people come together and they all push and pull in the same. You know, you're all rowing in the same direction, but you push and pull enough to make sure that the brand stays authentic to its. Its values.",
      "start": 782790,
      "end": 808180,
      "confidence": 0.98275536
    },
    {
      "speaker": "B",
      "text": "Yeah.",
      "start": 808180,
      "end": 808660,
      "confidence": 0.85270184
    },
    {
      "speaker": "C",
      "text": "And it was a huge learning curve for me. It was. It was brilliant to. To be able to be around such brand leaders that really got the kind of DNA of what they were and. And their customer.",
      "start": 809060,
      "end": 820680,
      "confidence": 0.9882917
    },
    {
      "speaker": "B",
      "text": "Yeah.",
      "start": 820920,
      "end": 821280,
      "confidence": 0.89176434
    },
    {
      "speaker": "C",
      "text": "And I just loved every minute. I mean, I adored working at the Hoxton. It was amazing opportunity. But then the opportunity to open ACE was just incredible. And the circles that I got to kind of move in and different publications and, you know, just different brand partnerships and. Yeah, it was amazing. And we really put kind of Shoreditch on the map.",
      "start": 821280,
      "end": 839800,
      "confidence": 0.97333336
    },
    {
      "speaker": "B",
      "text": "Yeah. Yeah. You know, wonderful to be operating in such creative. Yeah, funky spaces.",
      "start": 839960,
      "end": 846270,
      "confidence": 0.9762951
    },
    {
      "speaker": "C",
      "text": "It was just brilliant. And the design and all the different things, it was just. I was like, there. I was the biggest audience and could really then understand how people really got it.",
      "start": 846270,
      "end": 854190,
      "confidence": 0.9769179
    },
    {
      "speaker": "B",
      "text": "Yeah.",
      "start": 854270,
      "end": 854710,
      "confidence": 0.9817708
    },
    {
      "speaker": "C",
      "text": "Corporate customers got. Was different, you know, to what you're trying to sell, but positioning to the lifestyle market and people that want to travel and actually experience and connect to their community. So the reason that they've come to Shoreditch is to feel the best of what is in Shoreditch. And we had a lot of that in the building. So those things made it really easy to kind of connect with the local community. And it's something that just spoke to me so much and has. I've carried it on through wherever I, you know, end up and want and want to grow.",
      "start": 854710,
      "end": 883450,
      "confidence": 0.96133125
    },
    {
      "speaker": "B",
      "text": "Yeah.",
      "start": 883690,
      "end": 884050,
      "confidence": 0.89241534
    },
    {
      "speaker": "C",
      "text": "But I think it really. It really kind of supports that travel experience because most people are doing something to want to experience where they are, you know.",
      "start": 884050,
      "end": 892210,
      "confidence": 0.98838586
    },
    {
      "speaker": "B",
      "text": "Yes, yes. And, you know, a place like Shoreditch with such a unique identity, it sounds like that was really reflected in the. In the sun, in everything.",
      "start": 892210,
      "end": 901490,
      "confidence": 0.92369443
    },
    {
      "speaker": "C",
      "text": "Yeah, it was. It was really brilliant. And, you know, unfortunately, Alex died and Kelly and Brad continued the brand and we continued to grow it. And then I had the opportunity and I was very lucky to have people that really valued my worth, you know, and could see that if I moved into actually running the entire operation, I would deliver for them and for the owners. Because in a lot of these hotels and when you move into, you know, more. Even more of a senior position, you're dealing with a number of states, stakeholders. You know, you're not only dealing with the brand stakeholders and who actually deliver for this brand, but you're actually dealing with. This is somebody's building that you're running. So the roas and. And your return on investment is constantly something that you have to defend and provide clarity on.",
      "start": 901490,
      "end": 947840,
      "confidence": 0.9739252
    },
    {
      "speaker": "B",
      "text": "Yeah.",
      "start": 948160,
      "end": 948640,
      "confidence": 0.8230794
    },
    {
      "speaker": "C",
      "text": "So moving into running the Entire operation was something that I was very. I. I really wanted to do, because when you are the commercial side and you drive a lot of the revenue in, you want to make sure that what you're selling is delivered.",
      "start": 948720,
      "end": 963550,
      "confidence": 0.9900769
    },
    {
      "speaker": "B",
      "text": "Yeah.",
      "start": 963710,
      "end": 964270,
      "confidence": 0.8730469
    },
    {
      "speaker": "C",
      "text": "From a service standpoint, from a product standpoint, and it's actually from a profit standpoint, because you can get a very high rate based on what you sell and you're positioning this asset. But why couldn't it turn so profitable? And I was just like, what, What. Where. Where's the miss, you know, know, disconnect or the misalignment? So there was an opportunity there to actually be part of. Okay, what is happening with the training? What do the team understand about the brand? How can we make sure that that difference is clear when the customer arrives and. And all those things? And then the elements of how do we control costs and without losing our soul.",
      "start": 964270,
      "end": 1000330,
      "confidence": 0.9755567
    },
    {
      "speaker": "B",
      "text": "Yeah, yeah.",
      "start": 1000570,
      "end": 1001570,
      "confidence": 0.9366862
    },
    {
      "speaker": "C",
      "text": "And all of the things that we want to kind of deliver for the guest and say that we will. So it was a. It was a big move, but it was. It was. It was really, really great to be able to actually run the entire operation.",
      "start": 1001570,
      "end": 1017140,
      "confidence": 0.9785207
    },
    {
      "speaker": "B",
      "text": "Yeah, absolutely. And you mentioned that, you know, the importance of getting all stakeholders on board. What was your approach to that, do you think? It was, in part just having a very fundamental understanding of the brand and its soul, like you say, did the rest sort of fall into place organically? How did you communicate that with shareholders?",
      "start": 1017700,
      "end": 1038910,
      "confidence": 0.96525365
    },
    {
      "speaker": "C",
      "text": "Yes, I think being able to tell the story, I think, has been one of the reasons that I've managed to deliver for most stakeholders that I'm, you know, working with or for. And I think being able to understand what's the nuance of it, and being able to explain to them the reason that that works in the marketplace and delivers for them has really supported. So understanding the brand has been really key, I think. Also being able to talk in a way that shows them you understand a P and L, you are commercially aware, but you're also aware of what are the levers you have to pull to be able to deliver a profit.",
      "start": 1039070,
      "end": 1078740,
      "confidence": 0.98294604
    },
    {
      "speaker": "B",
      "text": "Yeah.",
      "start": 1079060,
      "end": 1079540,
      "confidence": 0.83219403
    },
    {
      "speaker": "C",
      "text": "So, yes, being able to talk of the. What would be considered the fluffy stuff, but also then being able to showcase that actually I know exactly what the margins are on each line. Line.",
      "start": 1079540,
      "end": 1088370,
      "confidence": 0.9451567
    },
    {
      "speaker": "B",
      "text": "Yeah.",
      "start": 1088370,
      "end": 1088810,
      "confidence": 0.96435547
    },
    {
      "speaker": "C",
      "text": "And if we moved that away, it would impact the brand, which would affect and maybe save, but it wouldn't drive the adr.",
      "start": 1088810,
      "end": 1095850,
      "confidence": 0.9688137
    },
    {
      "speaker": "B",
      "text": "Yeah.",
      "start": 1096010,
      "end": 1096370,
      "confidence": 0.89208984
    },
    {
      "speaker": "C",
      "text": "Which therefore your margins wouldn't work. So I think being able to really talk depending on who the stakeholder is and what. And understanding that stakeholder like, what is it they actually want from you? What are they trying to achieve? And knowing that before you start the conversation. But I do think it does come. The commerciality and what we talked about before, about where your journey in your kind of career. There's much more people coming from the commercial side of hotels to running the entire operation. Because the commercials are the reason that hotels run.",
      "start": 1096370,
      "end": 1129610,
      "confidence": 0.98542297
    },
    {
      "speaker": "B",
      "text": "Yeah, absolutely. And, yeah, like you say, it goes back to what we were saying about your earlier career and being able to sort of marry these different. Different facets together. But, yeah, wonderful. It must have been so exciting to be in those trailblazing positions and following on from that to present day. Can you tell us how you came to join Native Places?",
      "start": 1129850,
      "end": 1152250,
      "confidence": 0.97901493
    },
    {
      "speaker": "C",
      "text": "Yeah, I mean, Native has always kind of been on my radar because the partners that we had for our food and beverage outlets in ACE launched their second space within the Native Manchester. So they opened Cultureplex within Native, and it was Pablo and David. I think their company is still called roxico. I'm not 100% sure, but maybe we need to look at that. They launched up with Nativ. I'd heard this name, Native, but after ace, I went and ran the Curtin Hotel and Members Club because I wanted to learn a little bit more about the membership model. And I'm constantly curious and I want to push myself all the time. And I was like, this is a different thing that I've never done before. But the Native thing was exactly the same mentality because I was like, apart hotels and service departments. This is not a world that I've ever done before. But I knew that they had really good bones. I'd been to the Manchester site, the ground floor basically spoke to me because it was the same interior design team as ace. Oh. So that the Lauren Day, who designed a lot of the interiors for ACE London and for ACE as the group, she was the head design or lead designer for ACE Group. She moved away and started her own studio and they appointed her to do Cultureplex in Manchester, which I turned into Ducie Street Warehouse because that's the name of the building. Because Cultureplex moved away from running the F and B operation on my arrival. Really Covid kind of impacted a lot of that. But when I walked in the space, it was like, oh, God, my. My God. It's like I'd come home because it really resonated with me. And I was like, oh, this is such a beautiful design. So I was like, oh, this is beautiful. There's a real. There's real bones here. And that's the flagship. And then I looked around the rest of the assets and I was like, oh, there's something we could do here. We could really connect with a customer that maybe we're not currently talking to and just saw a great opportunity to have a large asset portfolio work in a different marketplace. While it's similar, it's also there's a little bit difference because you're talking to long stay clients, which is a different world than when you're in hotels.",
      "start": 1152490,
      "end": 1277620,
      "confidence": 0.97340137
    },
    {
      "speaker": "B",
      "text": "Yeah.",
      "start": 1277700,
      "end": 1278180,
      "confidence": 0.9708659
    },
    {
      "speaker": "C",
      "text": "So yeah, it was, it was a great opportunity to really position a brand as well, which I was very excited by.",
      "start": 1278500,
      "end": 1284020,
      "confidence": 0.9723788
    },
    {
      "speaker": "B",
      "text": "Yeah. Did you have any apprehensions at all about jumping into what is quite a different space or was it just an exciting move?",
      "start": 1284420,
      "end": 1293140,
      "confidence": 0.95853543
    },
    {
      "speaker": "C",
      "text": "It was just super exciting. I mean there was a little bit of apprehension, but I was excited by it more than. So one side of my brain was like, like, let's just go for it.",
      "start": 1293220,
      "end": 1302360,
      "confidence": 0.9686605
    },
    {
      "speaker": "B",
      "text": "Yeah.",
      "start": 1302440,
      "end": 1302880,
      "confidence": 0.9003906
    },
    {
      "speaker": "C",
      "text": "And I saw the opportunity and yeah, jumped for it. Really? Yeah. It was exciting, wonderful.",
      "start": 1302880,
      "end": 1308120,
      "confidence": 0.98144025
    },
    {
      "speaker": "B",
      "text": "And, and you just mentioned brand vision. Can you, can you tell us more about the, the picture of the brand story you had in mind when you joined, what, what that looked like and how you planned to, to set that out?",
      "start": 1308840,
      "end": 1322120,
      "confidence": 0.9633174
    },
    {
      "speaker": "C",
      "text": "I mean, for me, brand equals trust. So it's, how do you build that trust? And I think there's four really key factors to that. It's the product, it's the customer experience, it's being able to tell the story of why, like why this works for that customer and why it was founded. So is it about the product? Is it about the founder? But what is the story of native? Like what do we want to deliver? And then consistency, like consistency is king. And I say that lack of consistency is just like death by a thousand cuts.",
      "start": 1323000,
      "end": 1361550,
      "confidence": 0.98729247
    },
    {
      "speaker": "B",
      "text": "Yeah.",
      "start": 1361790,
      "end": 1362190,
      "confidence": 0.92529297
    },
    {
      "speaker": "C",
      "text": "Because it really dilutes your brand. If you walk in somewhere and it feels different, it really impacts what do what you actually think. This is why am I here.",
      "start": 1362190,
      "end": 1370430,
      "confidence": 0.9739773
    },
    {
      "speaker": "B",
      "text": "Yeah.",
      "start": 1370590,
      "end": 1371070,
      "confidence": 0.84733075
    },
    {
      "speaker": "C",
      "text": "So understanding our why. And it was super simple. Like it's like just great places in great locations filled with great people. Very simple if it, if it looks a certain way. Because place making is something that people use quite regularly now. But I was actually in a brand that created that. How do you place make and Ace were just so good at how they did this cultural connection and who were the partnerships and there was a real brand alignment and you really, you weren't able, there was just. While it could be there wasn't a commercial decision, but it was actually based on a brand decision. And that's where I've always gone into every brand after that curtain. Native. Okay, so what is the brand decision? Who should we be partnering with? So we actually live and breathe our values so people don't. It doesn't become diluted and there isn't any consistency.",
      "start": 1371230,
      "end": 1423400,
      "confidence": 0.9703591
    },
    {
      "speaker": "B",
      "text": "Yeah, yeah.",
      "start": 1423560,
      "end": 1424360,
      "confidence": 0.90234375
    },
    {
      "speaker": "C",
      "text": "So just making sure that the right partners were there, that that helps you resonate with different audiences. Because if you have similar values to another brand and you have a connection and you can kind of sell, promote each other, it supports that awareness.",
      "start": 1424360,
      "end": 1436840,
      "confidence": 0.9550293
    },
    {
      "speaker": "B",
      "text": "Yeah.",
      "start": 1437220,
      "end": 1437540,
      "confidence": 0.93652344
    },
    {
      "speaker": "C",
      "text": "And so that brand positioning was really key and who we partnered with. Looking at the touch points for guests, like what did they actually interact with so that, that there was a story there and focus on consistency of product. It was really, really key.",
      "start": 1437700,
      "end": 1451620,
      "confidence": 0.9861618
    },
    {
      "speaker": "B",
      "text": "Yeah. Yeah, absolutely. And in your opinion, what are some of the pillars of, you know, successfully placemaking? We've touched on the a bit. Is it local partnerships? Is it.",
      "start": 1451940,
      "end": 1465450,
      "confidence": 0.93000096
    },
    {
      "speaker": "C",
      "text": "I think it's. It's something that celebrates similar values. They don't have to be exactly the same, but there has to be like a core underneath that runs through both brands.",
      "start": 1466330,
      "end": 1475690,
      "confidence": 0.9863517
    },
    {
      "speaker": "B",
      "text": "Yeah.",
      "start": 1475770,
      "end": 1476130,
      "confidence": 0.9248047
    },
    {
      "speaker": "C",
      "text": "And I think placemaking is about people that care, actually caring. So the service level and the people that you actually are filling the space with care about why they're there. And so actually caring. I think the community is such a broad term now, but I do think the local community and celebrating the artisans in that community really supports that place making as well. So people feel that they are cared for while they're in that space. So an inclusive service level that celebrates individuals and the right offering. So you're delivering on what the offering is. If that's food, drinks, if it's some type of, I don't know, programming. So if somebody's coming to actually attend an event in your space, I think all of those things have to be thought through.",
      "start": 1476130,
      "end": 1529730,
      "confidence": 0.97909313
    },
    {
      "speaker": "B",
      "text": "Yeah.",
      "start": 1529890,
      "end": 1530370,
      "confidence": 0.96761066
    },
    {
      "speaker": "C",
      "text": "And there has to be a truth to it.",
      "start": 1530370,
      "end": 1532290,
      "confidence": 0.9986075
    },
    {
      "speaker": "B",
      "text": "Yeah, yeah, absolutely.",
      "start": 1532530,
      "end": 1534170,
      "confidence": 0.9638455
    },
    {
      "speaker": "C",
      "text": "I mean, there's lots of brand partnerships you could do just to position, but it doesn't necessarily mean that it is actually real. So the, the truth behind it is key.",
      "start": 1534170,
      "end": 1543200,
      "confidence": 0.9532707
    },
    {
      "speaker": "B",
      "text": "Yeah. And you know, it's something that really resonates with the guests, isn't it? That can't be inauthentic. I think they can.",
      "start": 1543520,
      "end": 1550480,
      "confidence": 0.9518943
    },
    {
      "speaker": "C",
      "text": "Yeah. Authenticity is massive. I mean, most people that go to a certain type of hotel group or stay in a certain type of accommodation, they are a little bit more curious. So we definitely get the traveler that's more curious and wants to kind of explore because they're not necessarily somebody that would stay in a kind of Traditional kind of cream box. They're actually fine with being something a little bit different and unique. So I think that curiosity has to be. Has to resonate with your public spaces and how you're sharing what you. What happens in the community around you.",
      "start": 1550480,
      "end": 1586050,
      "confidence": 0.99006146
    },
    {
      "speaker": "B",
      "text": "Yeah.",
      "start": 1586050,
      "end": 1586370,
      "confidence": 0.9458008
    },
    {
      "speaker": "C",
      "text": "And your team have to be somebody that really, like, celebrates where they work and. And why they're there.",
      "start": 1586370,
      "end": 1591450,
      "confidence": 0.9633639
    },
    {
      "speaker": "B",
      "text": "Yeah.",
      "start": 1591530,
      "end": 1592010,
      "confidence": 0.88378906
    },
    {
      "speaker": "C",
      "text": "You know, because that's the first portal call for a guest. They talk to one of your team. I mean, it starts with the booking engine and you can do all that with your, you know, your platforms and your social media and that's, I think, a little bit easier to control. And then when you move into actually the. The human interaction and when somebody comes into your operation, I think that's the element that they still have to feel that throughout the entire journey.",
      "start": 1592010,
      "end": 1613870,
      "confidence": 0.9773626
    },
    {
      "speaker": "B",
      "text": "Yeah, yeah. That. That first impression is priceless.",
      "start": 1614350,
      "end": 1617430,
      "confidence": 0.9310303
    },
    {
      "speaker": "C",
      "text": "Is it? Yeah, that's like. From the music to the lighting to the uniform, you know, everything has to feel kind of on point.",
      "start": 1617430,
      "end": 1625880,
      "confidence": 0.9543474
    },
    {
      "speaker": "B",
      "text": "Yeah. And it seems, you know, a theme throughout these brilliant places you've worked is that just inherent understanding of the guest and what the guest wants and being able to see it through their perspective.",
      "start": 1626120,
      "end": 1638040,
      "confidence": 0.9644391
    },
    {
      "speaker": "C",
      "text": "I think so. I think also, yeah. Kind of getting the guest.",
      "start": 1638360,
      "end": 1641880,
      "confidence": 0.99172634
    },
    {
      "speaker": "B",
      "text": "Yeah.",
      "start": 1641960,
      "end": 1642520,
      "confidence": 0.9835612
    },
    {
      "speaker": "C",
      "text": "Understanding them and actually having conversations. I mean, I love that, you know, chatting to the guest, finding out, okay, why are you here? I get it now. How did you find us? You know, those types of questions. Being naturally curious and empathetic. You know, actually delivering. Because hospitality is actually about giving care.",
      "start": 1642840,
      "end": 1658740,
      "confidence": 0.98020464
    },
    {
      "speaker": "B",
      "text": "Yeah.",
      "start": 1658900,
      "end": 1659380,
      "confidence": 0.88916016
    },
    {
      "speaker": "C",
      "text": "So, yeah. Yeah. I think understanding your guest is key. And obviously now with data, you can have a lot more understanding, which, you know, is exciting.",
      "start": 1659620,
      "end": 1668340,
      "confidence": 0.9558407
    },
    {
      "speaker": "B",
      "text": "Yeah, absolutely. A great thing to delve into and be able to build these pictures. And Yeah. I wanted to also ask about the merger with NUMA and how that came about. And I also understand, I believe Native by numa is freshly launched. So. Yeah, if you could tell us.",
      "start": 1668580,
      "end": 1687310,
      "confidence": 0.964545
    },
    {
      "speaker": "C",
      "text": "Yeah. So I think Native has been in the market for 25 years and it started very much as corporate housing. My arrival was, how do we position it as a lifestyle brand? And the fund we were part of was. Was up for. In terms of, you know, it was a sale process and NUMA was. Was like a natural fit. I think there's some similar values, definitely, between both brands and we talk to similar customers. I mean, there is slightly differences in the demographics, but we want to deliver the same experience to our guests. But it's slightly nuanced because NUMA is completely digital experience and we have More of a customer service level in terms of actual physical people in the operation. And Christian Gazer, the founder with Dimitri and Gerhardt of numa. We met and we just had. There was a real synergy by what we wanted to deliver and they really loved what we've created with the brand Native and where we've positioned it in the market. And we have a strong following not only from lifestyle leisure travelers, but also corporate travelers and saw an opportunity that Native could merge with numa in terms of the NUMA Group and continue the brand as by numa, but still Native as the more premium product within the group. Yeah, so that's what we're gonna do, which is super exciting. So continue all the things that, that we do. But the layer of technology that NUMA bring supports that kind of frictionless guest journey.",
      "start": 1687310,
      "end": 1793160,
      "confidence": 0.976371
    },
    {
      "speaker": "B",
      "text": "Yeah.",
      "start": 1793479,
      "end": 1793959,
      "confidence": 0.8914388
    },
    {
      "speaker": "C",
      "text": "And yeah, there's loads of opportunity to grow Native underneath the NUMA Group throughout the uk but you know, across Europe too and beyond.",
      "start": 1794680,
      "end": 1803730,
      "confidence": 0.9884881
    },
    {
      "speaker": "B",
      "text": "Yeah, that's. It sounds like it's a very symbiotic relationship and one that like you say, allows Native to retain its core and its totally.",
      "start": 1803810,
      "end": 1813570,
      "confidence": 0.9418542
    },
    {
      "speaker": "C",
      "text": "Yeah. Uniqueness and deliver on our kind of core values. But there is a lot of synergy and like you said, the symbiotic relationship is definitely key and I think location wise there was a lot of plus points, you know, and then the opportunity for Native to be in key cities in the right locations still, you know, kind of focuses on our vision.",
      "start": 1813570,
      "end": 1837460,
      "confidence": 0.96605605
    },
    {
      "speaker": "B",
      "text": "Yeah.",
      "start": 1837700,
      "end": 1838100,
      "confidence": 0.86572266
    },
    {
      "speaker": "C",
      "text": "So the great location is the reason people majority go to a place.",
      "start": 1838100,
      "end": 1841780,
      "confidence": 0.9977464
    },
    {
      "speaker": "B",
      "text": "Yeah, yeah.",
      "start": 1841860,
      "end": 1842780,
      "confidence": 0.8722331
    },
    {
      "speaker": "C",
      "text": "They want to be in that city. So. Yeah, no, very exciting.",
      "start": 1842780,
      "end": 1846500,
      "confidence": 0.9765489
    },
    {
      "speaker": "B",
      "text": "Wonderful. And just in practice, what was, what has that process been like guiding Native through that transition? Was, was the shared value with NUMA helpful in that regard?",
      "start": 1846740,
      "end": 1858020,
      "confidence": 0.95535034
    },
    {
      "speaker": "C",
      "text": "Absolutely, yeah. And I think that's really key, you know, understanding that there is. You're talking to a customer, making sure that we all understand who that customer is. And in all of this the customer is so important, the guest. So making sure that that message is clear for everybody and in the business, you know, we have a large team in Native and our team is. Well, they have a large team too, but it's. Ours is very much more in the operation because we have people on the ground where they don't necessarily have staff members in their properties.",
      "start": 1858100,
      "end": 1894460,
      "confidence": 0.96054256
    },
    {
      "speaker": "B",
      "text": "Yeah.",
      "start": 1894780,
      "end": 1895180,
      "confidence": 0.8819987
    },
    {
      "speaker": "C",
      "text": "And so that messaging to the team to know that what they're still delivering is, is still vital and won't change. It's just going to have that there is elements of what NUMA can bring to our operation really support The. Their. Them delivering for the guest because it meant that they were not so tied up with doing administrative stuff. The technology allows a bit more flexibility and freedom for them to actually deal with the guest.",
      "start": 1895180,
      "end": 1922630,
      "confidence": 0.94746524
    },
    {
      "speaker": "B",
      "text": "Yeah.",
      "start": 1922870,
      "end": 1923310,
      "confidence": 0.8211263
    },
    {
      "speaker": "C",
      "text": "Upon arrival and things like that. So yeah, they. I think just the messaging throughout. And as we touched on before, the stakeholders of not only NUMA stakeholders but the Native portfolio is a mixture of both leases and management agreements. So there are a number of owners that would need to. And I've managed that whole process of how do we ensure that everybody feels really good about, you know, they've invested in Native being their operator, what would retain, what would be changed and making sure the stakeholders feel really comfortable in that change, which has been, you know, it's been a year now and we're getting there. But there was a lot of different things in the journey. It's something I've never done before. So.",
      "start": 1923310,
      "end": 1966280,
      "confidence": 0.9827239
    },
    {
      "speaker": "B",
      "text": "Yeah.",
      "start": 1966280,
      "end": 1966640,
      "confidence": 0.84505206
    },
    {
      "speaker": "C",
      "text": "So selling a business through, you know, private equity sale, there's a lot of due diligence that has to be done and there's a lot of, you know, a lot of data that needs to be shared and absorbed and the right, the right kind of process needs to be followed. But also you need to just make sure that you're managing all of this while also delivering on a business and continuing to drive the sales and the profits.",
      "start": 1966640,
      "end": 1992640,
      "confidence": 0.9833445
    },
    {
      "speaker": "B",
      "text": "Yeah.",
      "start": 1992930,
      "end": 1993250,
      "confidence": 0.9905599
    },
    {
      "speaker": "C",
      "text": "So it's. It was. It was a very interesting journey and definitely learned a lot through that entire process.",
      "start": 1993250,
      "end": 2000450,
      "confidence": 0.9699707
    },
    {
      "speaker": "B",
      "text": "Yeah, that sounds busy. Busy.",
      "start": 2000850,
      "end": 2004130,
      "confidence": 0.9417643
    },
    {
      "speaker": "C",
      "text": "It was. It still is.",
      "start": 2004130,
      "end": 2006210,
      "confidence": 0.85410154
    },
    {
      "speaker": "B",
      "text": "Yeah, I could imagine it. And what were some of those or what have been some of the main takeaways for you going through this process is is there anything you've learned that's surprised you along the way?",
      "start": 2006290,
      "end": 2018770,
      "confidence": 0.9593163
    },
    {
      "speaker": "C",
      "text": "I think being the authority of the native business and knowing that your knowledge and knowing that you actually understand the entire business and being able to explain that through, I think I was.",
      "start": 2020420,
      "end": 2032740,
      "confidence": 0.95182055
    },
    {
      "speaker": "B",
      "text": "It.",
      "start": 2034740,
      "end": 2035020,
      "confidence": 0.77441406
    },
    {
      "speaker": "C",
      "text": "Definitely something that made me realise how much I have done to deliver for Native and where we've managed to get it to over four years has been some really big growth. How we've managed to drive the director share so how much customers come to us through our booking engine, how we've driven the corporate share and really diversified the market and how all the market segments really deliver to make us a very profitable business. And I think going through that and talking through each area and how that works to deliver for making it something that's desirable to buy was really interesting because I don't think you don't realize how much has actually changed when you actually walk somebody through how the business has changed and where it's sitting today. Yeah, that was definitely a very interesting thing. And I think just knowing that you have the ability to do it and a lot of the time, you know, I'm aware that I'm usually the only woman in a lot of these rooms and I think sometimes, you know, we potentially have to prove ourselves a little bit more and that I just wanted to make sure that I can really support some other women to come into these rooms and be at the table with me. And it really resonates with me that I need to ensure that there's development paths within my team, but also for future generations that we can help this a little bit more.",
      "start": 2035020,
      "end": 2128900,
      "confidence": 0.97612053
    },
    {
      "speaker": "B",
      "text": "Yeah, and I was going to ask you about that because as we all know, it is still quite a male dominated industry at the top in places. From your perspective, what do you think can be done from within the industry to, you know, support women who, who want to attain these senior roles in what can sometimes not be the most open space for them?",
      "start": 2129140,
      "end": 2152830,
      "confidence": 0.9852441
    },
    {
      "speaker": "C",
      "text": "Yeah, I think it has to come from the top. And I've been very lucky with having amazing male and female leaders that saw my value and helped. But I also did find that I had to be the authority in any department that I was running to ensure that if I was ever questioned, I would have the answer and would know it. Not just the answer, but also the next five questions that could be asked about it. So I think that I don't think that's going to really change. I think everybody needs to feel that no matter where their gender, you know, you have to be prepared and you have to know your stuff. But I think that maybe sometimes women don't necessarily feel as comfortable with kind of enlarging upon their knowledge.",
      "start": 2153070,
      "end": 2206210,
      "confidence": 0.9856879
    },
    {
      "speaker": "B",
      "text": "Yeah.",
      "start": 2206610,
      "end": 2207090,
      "confidence": 0.8693034
    },
    {
      "speaker": "C",
      "text": "And I think diversity and inclusivity is not just a tick box in a business. I think it really has to be thought through. But I do think that's quite difficult. And I do realize that people don't see it. They do not actually recognize that the room is mostly men and that's mostly that men don't see it. And that is where the conversation has to start and bringing it up. So I obviously bring it up, but it's how do we make it that people feel comfortable with their voice being heard and making room for them to speak? Because as I said, I don't think, you know, there's the whole blowing your own trumpet. And I do think a lot of women don't necessarily do it as naturally.",
      "start": 2207570,
      "end": 2255950,
      "confidence": 0.98041296
    },
    {
      "speaker": "B",
      "text": "Yeah.",
      "start": 2256720,
      "end": 2256960,
      "confidence": 0.9848633
    },
    {
      "speaker": "C",
      "text": "As Men.",
      "start": 2256960,
      "end": 2257520,
      "confidence": 0.99609375
    },
    {
      "speaker": "B",
      "text": "Yeah.",
      "start": 2257840,
      "end": 2258320,
      "confidence": 0.9689128
    },
    {
      "speaker": "C",
      "text": "Just from being in an industry for a very long time and having leaders in my team that are both male and female. You know, some people need much more encouragement and recognition that you've. Actually. That was all you. You've delivered that. Oh, you know, that recognition. It was like me helping with the sale of native places and all of the things that have been put in place. It's like actually, yes, you know, that. That recognition. So I think it has to start from the leadership. People who are in the leadership need to recognize it. I think people that are, you know, fathers, that have daughters need to think. Right. Where. Where else can I help with this? But I have noticed and I've spoken to people now that they don't even realize I said in this room is just literally all men.",
      "start": 2258480,
      "end": 2303080,
      "confidence": 0.96809703
    },
    {
      "speaker": "B",
      "text": "Yeah.",
      "start": 2303400,
      "end": 2303800,
      "confidence": 0.95947266
    },
    {
      "speaker": "C",
      "text": "And it's not just the male, female. It's not just gender. It's actually, you know, inclusivity in terms of nationality or. I think there's just so many elements that you don't even realize. And I think just bringing those different people to the table also really supports your business. So many different brains on a problem really helps. And that the more diverse they are to you, the better.",
      "start": 2303800,
      "end": 2329710,
      "confidence": 0.97912234
    },
    {
      "speaker": "B",
      "text": "Yeah.",
      "start": 2330030,
      "end": 2330390,
      "confidence": 0.8904622
    },
    {
      "speaker": "C",
      "text": "They bring to it just a different. Different view viewpoint. It really supports. So you.",
      "start": 2330390,
      "end": 2336800,
      "confidence": 0.93757594
    },
    {
      "speaker": "B",
      "text": "Yeah.",
      "start": 2336870,
      "end": 2337070,
      "confidence": 0.9746094
    },
    {
      "speaker": "C",
      "text": "I think my messaging to obviously my daughter and my nieces is that we need to be super curious. We need to make sure that we are the authority and we should not be afraid to speak in the room and ask for a place at the table. You need to find advocates. You need to make sure that you have the right mentors and think about where you actually want to be. But, yeah, I think it comes from the top two.",
      "start": 2337070,
      "end": 2367400,
      "confidence": 0.9811884
    },
    {
      "speaker": "B",
      "text": "Yeah. Yeah. You know, it's across all industries, really. Like you say, there is sadly a propensity for women to somewhat fear being that big presence.",
      "start": 2367800,
      "end": 2378200,
      "confidence": 0.9846097
    },
    {
      "speaker": "C",
      "text": "I know. I think it's like we're kind of taught to stay a bit quieter and.",
      "start": 2378280,
      "end": 2382280,
      "confidence": 0.9874878
    },
    {
      "speaker": "B",
      "text": "Be a bit more.",
      "start": 2382280,
      "end": 2383080,
      "confidence": 0.9589844
    },
    {
      "speaker": "C",
      "text": "I don't. Yeah. It's interesting because I don't think I was ever taught that. But I don't know whether it's just how it's just be a little bit more, I don't know, malleable. But yeah, I think once you know something, you just have to really believe in yourself. You need to know. I know it and I'm gonna say it.",
      "start": 2383880,
      "end": 2401780,
      "confidence": 0.97962826
    },
    {
      "speaker": "B",
      "text": "Yeah, yeah.",
      "start": 2401860,
      "end": 2402820,
      "confidence": 0.868571
    },
    {
      "speaker": "C",
      "text": "So. But you also need people around you that tell you you've got it, you know, So I think having some really key people in the industry and actually I Think if you see people, you can see yourself there. You're like, oh, okay. So it's, it's available to me. You know, I think having really people in positions and they're visible so that they can be seen by girls and, you know, younger women.",
      "start": 2402820,
      "end": 2427610,
      "confidence": 0.9902886
    },
    {
      "speaker": "B",
      "text": "Yeah.",
      "start": 2427770,
      "end": 2428210,
      "confidence": 0.9967448
    },
    {
      "speaker": "C",
      "text": "So representation is massive. But I don't. I do see improvements, but I also. I don't know whether I can see a bit of, you know, regression.",
      "start": 2428210,
      "end": 2437930,
      "confidence": 0.9747631
    },
    {
      "speaker": "B",
      "text": "Gosh. Yeah. I was going to ask if you, you know, foresee any change in the tide in, you know, the coming years or more of these conversations happening, but I didn't.",
      "start": 2438650,
      "end": 2448390,
      "confidence": 0.92706805
    },
    {
      "speaker": "C",
      "text": "I don't know, geopolitically, it's just a little bit, you know, scary. Right. And I think we just need to make sure that we're teaching our children, boys and girls, any gender, that everything's equal, you know, and everything's fair. So. Yeah, yeah, it's a tough one, but I do. I would love to make sure that, you know, I'm as involved as possible and make sure that within my team is a very broad mix of individuals that really, again, bring to the table all of their experiences and really add so much value.",
      "start": 2448550,
      "end": 2484580,
      "confidence": 0.9826086
    },
    {
      "speaker": "B",
      "text": "Yeah, yeah. You know, every person has their own stories and life experiences.",
      "start": 2484900,
      "end": 2490820,
      "confidence": 0.9693134
    },
    {
      "speaker": "C",
      "text": "Yeah. It adds so much to your business and so much to the bottom line.",
      "start": 2490900,
      "end": 2493940,
      "confidence": 0.98246527
    },
    {
      "speaker": "B",
      "text": "It's a tricky one. But what would your advice be to other hoteliers out there who want to strive to be more inclusive, but maybe don't know where to start or don't know quite what the right approach is with the right conversations to have?",
      "start": 2494520,
      "end": 2507640,
      "confidence": 0.98031324
    },
    {
      "speaker": "C",
      "text": "I think we did something. We had some radical inclusivity training, so we worked with different partners because sometimes it's very difficult, like you said, you don't actually realize you're, you know, it's very difficult to be objective. So I think there's some brilliant people doing some great work out there that they're easy to find. And having some of those trainings and actually talking to your team, I think it's just like there are hidden gems that they will tell you, you know, but definitely there's. There's a availability to ensure that you're training your leaders and somebody will come and look at your business and get. Give you ideas. And I think having that outside view really helps because you can be quite blinkered. And I do, like I said, I don't think people realize, you know, and I do think if there's a way of actually having some support is really key.",
      "start": 2507640,
      "end": 2565260,
      "confidence": 0.9645858
    },
    {
      "speaker": "B",
      "text": "Well, hopefully it's. It's something we. We see more of in the industry going ahead. So I also wanted to ask about NATO's plans to achieve net zero carbon operation by 2030. Can you tell us more about what goes into that and what perhaps some of the challenges have been along that journey?",
      "start": 2566540,
      "end": 2586350,
      "confidence": 0.9704586
    },
    {
      "speaker": "C",
      "text": "Absolutely. I think, as we've said before, data drives a lot of decisions and we can see there's a difference slightly in the generations of traveler, like this generational difference in terms of how they're deciding where to stay and your practices and how you actually support your community. Your effect on the planet is one of the deciding factors on choosing their accommodation. And we want to be a company that really does focus on treading lightly on the planet and it not just to be greenwashing, like, what can we actually do? Data is hard to compile and we have outsourced some support with that to ensure that we can understand what is our carbon use. It's hard to know. I mean, in our nature apart, hotels and service departments are slightly less energy heavy just because we don't have all of the different elements that hotels have in terms of all of the facilities. And the way that we actually maintain and clean rooms is not. Not daily. So there is an element that there is, you know, a lower usage in terms of your energy and water consumption and obviously water consumption because you're cleaning linen and washing things. But it's not just enough to know, to say that you want to understand what does good look like within your emissions. And so tracking that, and that is difficult to track, but it's also very difficult when your portfolio has such a broad scope in terms of the building age and size. So it's not easy to actually track all of that if it's a very old building, like we have some that are quite old and like kind of Victorian summer, Georgian, and then we've got some that are, you know, literally warehouses and huge, vast atriums. So it's difficult to. To know what good looks like and how can we control that. But also, again, as we've referred to in terms of stakeholders, and it's taking the stakeholder for each building on the journey with you because a lot of owners are expecting you to be the authority and how can they make this more, you know, the ESG rating better for their building, but you also need to be able to show them the investment is going to deliver in terms of the ROI on that investment. And that can not necessarily be as clear as you imagined. So there are a few moving parts with how do we get to net zero by 2030? And it has to be the operation, everybody has to be part of it. Tracking is key. And then looking at where are the winds, so our energy provider making sure that's coming from a greener source so all of those things are more sustainably sourced. Where are our partners in terms of what we purchase for the operation? Anything that we procure, F and B can be very local, which is good. Food and beverage can be quite local, but you've got to look at, at your toiletries and you know, and also you also look at the effect that your providers are having on, on the environment as well. So if your partner is a certain toiletry, what's their value in terms of how they're looking at their carbon emissions and things like that? So we're just trying to track each thing and working on, okay, what is the biggest win at the moment, how can we actually draw that down? And then having a quite a clear path to where can we make the biggest impact?",
      "start": 2586510,
      "end": 2796110,
      "confidence": 0.9746536
    },
    {
      "speaker": "B",
      "text": "And you know, speaking about stakeholders and ROI, when it comes to this, how does one find the best balance between that commercial success whilst upholding these sustainable values? Where is that sweet spot and how does that work when it's not like you say, such a clear image necessarily?",
      "start": 2796560,
      "end": 2817360,
      "confidence": 0.978125
    },
    {
      "speaker": "C",
      "text": "I think it's really difficult and it's not very easy answer to, to that question. I think that I've been in a number of conversations and at events and listened to very, very sustainable properties and listen to are they actually getting a return on their investment in terms of what they can get for their bedroom pricing? And that doesn't necessarily resonate, it doesn't mean that people are willing to pay a little bit more. They're actually still very value led. So it is quite difficult to see what is that balance and what is that sweet spot. And I think it's if you can be clear with the customer about what you're doing, if they know the journey that you're on and you can show transparency in what you're trying to deliver. I think that has really supported us for our corporate customers because a corporate traveler, a lot of corporate customers, they were on what is called a corporate program. So a lot of companies have travel programs where they decide on which hotel groups or which hotels they'll use in cities. And a lot of them require information and data on your carbon emissions now. So it's kind of become very much a corporate request for pricing and RFP process. But the leisure traveler, we see some decisions being made, but we also see that they're still very much focused on the product price of the room. So while generations are choosing, there is still broad spectrum that are based on they're coming because of a price point and the location. So it is quite difficult to know where to invest and what the ROIs are in each area. But there are natural ROIs with having less energy in your building because you're paying less on utilities. So. So that's a natural profit maker. So that is a given for certain stakeholders. But you're also making a decision that supports the environment, so that then supports the decision that you don't necessarily have to increase your price point. You're actually delivering on profitability because your costs are lower. So those things are. You have to look at each area. And before we started the acquisition and the merger with numa, I started the Process Corp process. So it was very heavily involved with all the different areas. So we're going to look at that into 2026 and continue that path. So we've started the action plan with the merger. We're obviously aligning with what are, you know, where we're going to use and support each other as the brands. And now we can look again about how we continue that journey to reducing our emissions.",
      "start": 2817680,
      "end": 2977840,
      "confidence": 0.97222435
    },
    {
      "speaker": "B",
      "text": "Yeah, brilliant. That's a wonderful ambition and yeah, I'm sure it will pay its dividends in time.",
      "start": 2978000,
      "end": 2985010,
      "confidence": 0.96770644
    },
    {
      "speaker": "C",
      "text": "It's about resilience, isn't it, and longevity. This is a long vision. You want these properties, they're going to be around for many years and you want that to have the right impact on that location, but also on the environment.",
      "start": 2985490,
      "end": 2999490,
      "confidence": 0.9846777
    },
    {
      "speaker": "B",
      "text": "Yeah, yeah. Future generations. It's important to keep that in mind and sort of looking ahead again on a sort of wider scale. How do you see apart hotels evolving as a category and hospitality especially, how, you know, they perform next to your more traditional sites, how do you see that journey kind of evolving?",
      "start": 2999810,
      "end": 3022770,
      "confidence": 0.9626305
    },
    {
      "speaker": "C",
      "text": "So the biggest thing with moving from the more traditional hotels to apart hotels and the service department world is the profitability and all. I saw that while in traditional hotels there's a lot of what we call peaks and troughs in terms of the night stay, there's what's considered a shoulder night, which would usually have kind of a lower occupancy. And most people come weekends and come midweek. And in the aparthotel world you have a much flatter length of stay. So length of stay is how long a guest stays and that really supports your profitability because as how much you clean a room, the energy they consume and also the amount of staff that you need. So in an aparthotel you can provide the flexibility of an apartment and give that guest something a bit different, but you still can give them that kind of lifestyle boutique hotel on the ground floor in the service element, but you just don't need the same level of staff as a hotel. And that's why I was like, oh, this is a really interesting market because it really talks to the Airbnb generation, because you're actually. But you're going somewhere that you know exactly what you're going to get. When I'm an Airbnb user and sometimes it's not necessarily what it looks like in the photo.",
      "start": 3023089,
      "end": 3097120,
      "confidence": 0.9796039
    },
    {
      "speaker": "B",
      "text": "Yeah.",
      "start": 3097120,
      "end": 3097680,
      "confidence": 0.96402997
    },
    {
      "speaker": "C",
      "text": "And I think that was my. I thought there's so much ways that you can position this, that you can speak to different customers depending, and the flexibility just talks to them in such a different way. And I think. And the future for Native by Numa is that we can have hybrid buildings, so they're apart hotels, but they have apartments and bedrooms. So you can have a guest that only wants to stay two nights and they can have that room, or you can have a guest that's staying two weeks, three months, six months, and they're in their apartment. So, yeah, the. The apart hotel sector is growing and it's a very profitable sector for. For most stakeholders, and it is delivering something for a guest that I think is talking to a wider audience. It still gives them the escape and the feeling of kind of leaving their life admin at home, but it gives them the kind of space and facilities that they would be able to make, you know, a more flexible stay that they can choose to dine in or dine out.",
      "start": 3097760,
      "end": 3161670,
      "confidence": 0.97352844
    },
    {
      "speaker": "B",
      "text": "Yeah.",
      "start": 3161910,
      "end": 3162390,
      "confidence": 0.90755206
    },
    {
      "speaker": "C",
      "text": "So it speaks to a wider audience and it's actually, you know, it's not a niche market.",
      "start": 3162390,
      "end": 3168390,
      "confidence": 0.9963283
    },
    {
      "speaker": "B",
      "text": "And, yeah, I think there's something to be said for. For giving guests that control in a way. Right?",
      "start": 3168550,
      "end": 3173510,
      "confidence": 0.9935495
    },
    {
      "speaker": "C",
      "text": "Yeah, yeah, no, definitely that they can kind of use the space as they want. Yeah. And they know that there's going to be a quality because it's coming from a brand. It's not like the unknown.",
      "start": 3173590,
      "end": 3183350,
      "confidence": 0.9762513
    },
    {
      "speaker": "B",
      "text": "Yes, yes. And yeah, it must be really interesting as well, like you say, to have these sort of different types of relationships with guests, the long term and the shorter term. That must be such a unique.",
      "start": 3183670,
      "end": 3194770,
      "confidence": 0.97530323
    },
    {
      "speaker": "C",
      "text": "It's very different because somebody that's staying for six months really sees it as their home and someone saying for two days, they. They naturally want to feel at home and comfortable, but they're not going to be staying as long, but they really want to be outside in the city that they've Chosen to be in. So they want that connection. Yeah, you know, and, and our expertise on what, what's the place to be go see. But the longer stay guest wants that too, but they also want to have the recognition.",
      "start": 3194850,
      "end": 3221470,
      "confidence": 0.96506363
    },
    {
      "speaker": "B",
      "text": "Yeah, yeah, Brilliant. Brilliant. And sort of looking back at your career, if you could pass on a piece of advice to our listeners.",
      "start": 3222030,
      "end": 3233870,
      "confidence": 0.9426846
    },
    {
      "speaker": "C",
      "text": "I think continue to be curious. Hospitality is about adapting and I think about natural empathy and that curiosity allows you to evolve as the industry evolves. And I think, yeah, just continue to be curious. It's not just one way and be open to the new things. And technology is just giving so much opportunity not to be scared of it.",
      "start": 3234350,
      "end": 3265880,
      "confidence": 0.9831602
    },
    {
      "speaker": "B",
      "text": "Yeah, yeah.",
      "start": 3266370,
      "end": 3267050,
      "confidence": 0.8366699
    },
    {
      "speaker": "C",
      "text": "While still having the elements of the, the guest service that gives that connection. But yeah, be curious.",
      "start": 3267050,
      "end": 3272850,
      "confidence": 0.96022767
    },
    {
      "speaker": "B",
      "text": "Yeah. And it seems from what you said, that's curiosity in a way is embedded in the, in the Native Places brand.",
      "start": 3273410,
      "end": 3279810,
      "confidence": 0.94879484
    },
    {
      "speaker": "C",
      "text": "Yeah, I think. Well, I hope so. I hope that that's what comes across that we want to be naturally curious and we, you know, attract that type of traveler and that type of guest and we really celebrate diversity and we want everyone to feel really inclusive with us that, you know, we can connect you with something but we can also, we also celebrate everybody that's in the building in our local area.",
      "start": 3280130,
      "end": 3302710,
      "confidence": 0.96895343
    },
    {
      "speaker": "B",
      "text": "Fabulous. Fabulous. And looking ahead, what's next for Native Places?",
      "start": 3303350,
      "end": 3308550,
      "confidence": 0.9867269
    },
    {
      "speaker": "C",
      "text": "Well, as I said there's, I think because the ex. My expertise and my team's expertise, we, we know now apart hotels, service departments and hotels. So the brand could go into any type of kind of operation depending on the asset. So really looking and working with the real estate team about all the opportunities that are out there and what could we do with that building, actually making it a little bit more bespoke to where the marketplace, what works in those type of locations and delivery for the guest, but also the stakeholders. So it could be a traditional. Well, it would never be a traditional hotel, but there would be more hotel elements to it being that it would be smaller rooms and potentially not having kitchenettes. But then you would have the downstairs vibrant space for guests to connect and you know, there'd be some food and beverage element within that or the aparthotel world or having a hybrid building that has both in it. So I think we just need the opportunities to look at each asset and make the right decision for that, for that property. So that's very exciting. And it can go into any city. You know, there's some cities that really talk to corporate travel, there's some that don't, but they have a real Leisure travel. And if you have the right product, you could speak to both.",
      "start": 3309270,
      "end": 3386030,
      "confidence": 0.9746743
    },
    {
      "speaker": "B",
      "text": "Yeah, brilliant. Well, yeah, it'll be exciting to see, see how this all develops and. Yeah, fantastic.",
      "start": 3386270,
      "end": 3393390,
      "confidence": 0.9711699
    },
    {
      "speaker": "C",
      "text": "Thank you.",
      "start": 3393390,
      "end": 3394030,
      "confidence": 0.93688965
    },
    {
      "speaker": "B",
      "text": "Finally, we finish each episode with a question left by the last guest. Our last guest was Karim Kassim, who's owner of Horwood House Hotel. And he asked, do you think you can ever really retire from this industry once you're in it?",
      "start": 3394510,
      "end": 3407800,
      "confidence": 0.9779961
    },
    {
      "speaker": "C",
      "text": "No. I think you're naturally a hotelier and I do think it comes from empathy. I think it's if you're somebody again, you're curious, but if you're empathetic, you naturally have hospitality or you're naturally hospitable and then when you've worked in it, it's. It's difficult to move away from it really is. It's such a fast paced industry. There's so much exciting stuff that happens and you get to meet so many different people. I think. Yeah, I think once you've stepped in, it's hard to come out. Definitely.",
      "start": 3410440,
      "end": 3444290,
      "confidence": 0.98494333
    },
    {
      "speaker": "B",
      "text": "Yeah. That was his sentiment as well. And I think most people.",
      "start": 3444450,
      "end": 3447970,
      "confidence": 0.9236348
    },
    {
      "speaker": "C",
      "text": "Yeah.",
      "start": 3448290,
      "end": 3448770,
      "confidence": 0.9012044
    },
    {
      "speaker": "B",
      "text": "In the blood. And finally, do you have a question to leave for our next guest?",
      "start": 3449020,
      "end": 3453660,
      "confidence": 0.9825287
    },
    {
      "speaker": "C",
      "text": "Yes, I think it would be, what's one thing you wish you'd learned earlier about leading people and how has it shaped the kind of leader you are today?",
      "start": 3453820,
      "end": 3463660,
      "confidence": 0.98661435
    },
    {
      "speaker": "B",
      "text": "Fabulous question. Olivia will pass that on. And thank you so much for joining us. It's been great speaking with you.",
      "start": 3464300,
      "end": 3470700,
      "confidence": 0.9529758
    },
    {
      "speaker": "C",
      "text": "Thank you so much. It's been really brilliant. Thank you.",
      "start": 3471020,
      "end": 3473500,
      "confidence": 0.9987386
    },
    {
      "speaker": "A",
      "text": "Thanks for listening to Checking In, a weekly podcast from hotel owner, the UK's trusted source of hotel industry news and analysis. If you like the podcast, make sure to subscribe on whichever podcast platform you listen to. To get more industry Insight, head to hotelowner.co.uk and subscribe for unlimited access. If you're interested in sponsoring episodes of the podcast, drop us a line at podcastotelowner.co.uk.",
      "start": 3473820,
      "end": 3499450,
      "confidence": 0.98770833
    }
  ],
  "chapters": [
    {
      "summary": "Checking In is a weekly podcast from hotel owner. This week we speak to Olivia Emesi, CEO of Native Places. Olivia talks about launching Hoxton Hotel and Ace Hotel London. If you're interested in sponsoring episodes of the podcast, drop us a line at podcastotelowner. co. uk.",
      "gist": "Checking In",
      "headline": "Checking In is a weekly podcast from hotel owner covering hotel news and analysis",
      "start": 1280,
      "end": 64670
    },
    {
      "summary": "I've been working in hotels now for over two decades. What was it about US hospitality that made it so exciting? They are naturally much more open and friendly. Their style of hospitality really different to how England English hospitality.",
      "gist": "Working in a hotel in the US",
      "headline": "How did you first get into hospitality and what attracted you to it",
      "start": 65710,
      "end": 242690
    },
    {
      "summary": "When I came back to London there was a lot of opportunity for me to walk into a job. My heart and what I really loved to do was the sales side and my next step, I wanted to move from reservation to actually into the sales department. It really supports your career.",
      "gist": "How the US hospitality experience helped me come back to the UK",
      "headline": "You say Marriott training helped you when you came back into UK hospitality",
      "start": 242850,
      "end": 326870
    },
    {
      "summary": "Looking back, were there any standout lessons that stay with you today? Marriott are very, very good at training and development. When I jumped into the lifestyle independent brands, I realized that you had the opportunity to take on a lot more. Has that experience also forged your leadership today?",
      "gist": "The grounding of Marriott's leadership",
      "headline": "Looking back on your time at Marriott, were there any standout lessons that stayed",
      "start": 327190,
      "end": 525280
    },
    {
      "summary": "I wanted to talk about your work with the Hoxton in Ace Hotel London. Can you tell us about the work you did there helping to get those up and off the ground? There must be a formula to this, how you resonate with so many different brands.",
      "gist": "Ace Hotel London and The Hoxton",
      "headline": "You helped launch Ace Hotel London and then Malmaison in London",
      "start": 525440,
      "end": 924300
    },
    {
      "summary": "Moving into running the Entire operation was something that I was very. I really wanted to do. When you are the commercial side, you want to make sure that what you're selling is delivered. It was really, really great to be able to actually run the entire operation.",
      "gist": "Having the responsibility to run a hotel",
      "headline": "Moving into running the Entire operation was something that I was very excited about",
      "start": 924300,
      "end": 1018980
    },
    {
      "summary": "Having a very fundamental understanding of the brand and its soul has been really key, I think. Also being able to talk in a way that shows them you understand a P and L. There's much more people coming from the commercial side of hotels to running the entire operation.",
      "gist": "The Importance of the Brand",
      "headline": "Having a fundamental understanding of the brand has been key, I think",
      "start": 1019540,
      "end": 1149170
    },
    {
      "summary": "Can you tell us how you came to join Native Places? It was a great opportunity to really position a brand, which I was very excited by. Did you have any apprehensions at all about jumping into what is quite a different space or was it just an exciting move?",
      "gist": "Former ACE Group designer turns entrepreneur at Native Places",
      "headline": "Can you tell us how you came to join Native Places",
      "start": 1149170,
      "end": 1308120
    },
    {
      "summary": "For me, brand equals trust. How do you build that trust? It's the product, it's the customer experience and being able to tell the story of why. And then consistency, like consistency is king. Lack of consistency really dilutes your brand.",
      "gist": "Where Everything clicks: Brand Vision",
      "headline": "Brand equals trust, so how do you build that trust",
      "start": 1308840,
      "end": 1453780
    },
    {
      "summary": "I think placemaking is about people that care, actually caring. An inclusive service level that celebrates individuals and the right offering. Authenticity is massive. Understanding your guest is key. Being naturally curious and empathetic.",
      "gist": "What is Place Making in hospitality?",
      "headline": "What are some of the pillars of successfully placemaking",
      "start": 1454500,
      "end": 1675830
    },
    {
      "summary": "I wanted to also ask about the merger with NUMA and how that came about. I think there's some similar values, definitely, between both brands and we talk to similar customers. There's loads of opportunity to grow Native underneath the N UMA Group throughout the uk but also across Europe too and beyond.",
      "gist": "Will Native By Numa Be Merged?",
      "headline": "I wanted to also ask about the merger with NUMA",
      "start": 1675830,
      "end": 1846500
    },
    {
      "summary": "Was the shared value with NUMA helpful in that regard? Absolutely, yeah. I think just the messaging throughout. Selling a business through private equity sale. There's a lot of due diligence that has to be done. But also you need to just make sure that you're managing all of this while also delivering on a business.",
      "gist": "Have Native transitioned to NUMA?",
      "headline": "Was the shared value with NUMA helpful in guiding Native through transition",
      "start": 1846740,
      "end": 2008050
    },
    {
      "summary": "I think being the authority of the native business and knowing that you actually understand the entire business and being able to explain that through, I think I was. Definitely something that made me realise how much I have done to deliver for Native. It really resonates with me that I need to ensure that there's development paths within my team.",
      "gist": "Have you been interviewed by the Board of Directors?",
      "headline": "Going through how Native has grown over four years was interesting for me",
      "start": 2008769,
      "end": 2128900
    },
    {
      "summary": "I think diversity and inclusivity is not just a tick box in a business. How do we make it that people feel comfortable with their voice being heard and making room for them to speak? There is sadly a propensity for women to somewhat fear being that big presence.",
      "gist": "The role of women in the workplace",
      "headline": "From your perspective, what can be done to support women in senior roles",
      "start": 2129140,
      "end": 2495200
    },
    {
      "summary": " hoteliers want to strive to be more inclusive. What would your advice be to other hoteliers out there? I think we did something. We had some radical inclusivity training. Having some support is really key. We see more of in the industry going ahead.",
      "gist": "Hoteliers on Inclusivity",
      "headline": "Hoteliers across the world are striving to be more inclusive",
      "start": 2495200,
      "end": 2571500
    },
    {
      "summary": "NATO's plans to achieve net zero carbon operation by 2030. Data is hard to compile and we have outsourced some support with that. Your effect on the planet is one of the deciding factors on choosing accommodation. There are a few moving parts with how do we get to net zero by 2030?",
      "gist": "NATO's plans to achieve net zero carbon operation by 2030",
      "headline": "NATO plans to achieve net zero carbon operation by 2030",
      "start": 2572060,
      "end": 2796110
    },
    {
      "summary": "How does one find the best balance between that commercial success whilst upholding these sustainable values? Where is that sweet spot and how does that work when it's not like you say, such a clear image necessarily?",
      "gist": "Sustainability at the Hotel Group",
      "headline": "How does one find the best balance between commercial success and upholding sustainable values",
      "start": 2796560,
      "end": 3009490
    },
    {
      "summary": "The apart hotel sector is growing and it's a very profitable sector for. most stakeholders. It really talks to the Airbnb generation. The future for Native by Numa is that we can have hybrid buildings, so they're apart hotels, but they have apartments and bedrooms.",
      "gist": "Aparthotel: The future of hospitality",
      "headline": "The apart hotel sector is growing and it's a very profitable sector for hotels",
      "start": 3009730,
      "end": 3224510
    },
    {
      "summary": "The Native Places brand could go into any type of kind of operation depending on the asset. What's next for Native Places? Looking and working with the real estate team about all the opportunities. If you could pass on a piece of advice to our listeners, what would it be?",
      "gist": "Continuing to be curious about the world",
      "headline": "Continued to be curious allows you to evolve as the industry evolves",
      "start": 3226510,
      "end": 3393390
    },
    {
      "summary": "Do you think you can ever really retire from this industry once you're in it? No. I think you're naturally a hotelier and I do think it comes from empathy. Once you've stepped in, it's hard to come out.",
      "gist": "What Do You Do To Retire From Hotel Management?",
      "headline": "Do you think you can ever really retire from hoteling",
      "start": 3393390,
      "end": 3449580
    },
    {
      "summary": "And finally, do you have a question to leave for our next guest? What's one thing you wish you'd learned earlier about leading people and how has it shaped the kind of leader you are today?",
      "gist": "A Question for the Next Guest",
      "headline": "Do you have a question for our next guest",
      "start": 3450860,
      "end": 3472900
    },
    {
      "summary": "Checking In is a weekly podcast from hotel owner. UK's trusted source of hotel industry news and analysis. If you're interested in sponsoring episodes of the podcast, drop us a line at podcastotelowner. co. uk.",
      "gist": "Checking In",
      "headline": "Checking In is a weekly hotel industry podcast from hotel owner",
      "start": 3472900,
      "end": 3499450
    }
  ]
}