{
  "episode": {
    "title": "Looking Beyond London: Anna Corkill on Hyatt's Ambitious UK Portfolio Plans",
    "guest": "Anna Corkill, Regional VP Development at Hyatt",
    "date": "2025-11-21",
    "duration": "29:03",
    "focus": "UK expansion, lifestyle/luxury positioning, regional growth"
  },
  "transcription": {
    "text": "Running a hotel means juggling endless payments and expenses from suppliers to staff, all while keeping cash flow in check. That's where Apron helps. With Apron bill pay, you can manage all your supplier payments in one place, approve, schedule and sync automatically with Xero or QuickBooks. And with the Apron card, your team can spend easily while you stay in control. With spend limits, auto receipts, chasing and full visibility, every purchase earns rewards you can turn into cash back or gift cards. It's free to get started in built for small businesses. Learn more@getapron.com. Welcome to Checking In, a weekly podcast from hotel owner, the UK's trusted source of hotel industry news and analysis. Each week we meet a new guest and learn their story, all the highs and lows, triumphs and disasters they faced and how they got through to the other side. If you like the podcast, make sure to subscribe on whichever podcast platform you listen to more industry Insight head to hotelowner.co.uk and subscribe for unlimited access. If you're interested in sponsoring episodes of the podcast, drop us a line at podcastotelewner.co.uk. Hi, I'm Heather, host of this episode. Where we speak to Anna Corkill, Regional vice president, development UK and Ireland at Hyatt. Anna spoke about Hyatt's plans to grow its UK portfolio by over 30%, why it's setting its sights on the UK's. Exciting regional destinations, how it's well positioned. To capture the burgeoning lifestyle and luxury. Markets, and how Hyatt maintains the strong partnerships that lie at its core. Hi Anna, welcome to Checking in and thank you so much for joining us. Thank you so much for having me. So very excited to talk about Hyatt's plans. But before we get onto that for our listeners, can you just tell us a bit about your career journey prior to Hyatt and take us through some of your earlier formative roles? Yes, so I've always had an interest in hospitality I think with when I was at university and whether I was working in hotels and catering and it was a very different world. But I actually ended up starting going into the property world. So my background comes from I trained as a chartered surveyor doing developments in the West End of London and then moving on a bit by accident working with PKF in their hotel consulting. Originally applied for their corporate recovery but ended up in their hotel consulting team because I was arics qualified. They were doing hotel valuations and probably needed someone to sign off on some some valuations, although I ended up doing more Transactions than I actually did valuations through that. Doing a deal actually with Peter Norman who I actually now work with at Hyatt. So it's all come back full circle. He was working at Le Meridian and ended up joining their development team at Le Meridian, which is also where I met Felicity Black Roberts, which we're also now working together at Hyatt. So there's a big connection there. Through there. I then actually went on maternity leave, came back and then actually IHG at the time kind of approached me and said, would I like to go and work for. Ran their UK and Ireland with Richard Arman, who is a great mentor and fantastic person to be working with and then was there for a long time, but actually in having learned so much there as well, but actually was up for a new challenge and with both Peter Norman and Felicity Black Roberts both, you know, we'd all work together again. It was great to get the team back. Yeah. So hence that's why I was really kind of came back to Hyatt. And so far so good. It's been amazing and it's. Yeah, I have to say I've had a great time so far. Wonderful. And that's the beauty of hospitality, isn't it? You have that community and a face will usually reappear again. And that's wonderful. And so, yeah, really interesting career background. I assume then the background with both property and consultancy created quite a good toolbox for your lady. Were there any sort of standout learnings that you took from, from your time and in those areas that particularly prove useful today? I would say the biggest learning is that people do business with people they like and trust. I have kind of most of my life has been I'm so interested in people. So I think people for me is the industries run on partnerships and relationships. And I think that's, that's from my point of view is where I would really push to go. I mean, mentors have said to me, stay curious, listen. But it's a long term relationship that you're looking for. So that would be my biggest learning curve. And I think that's what I've really learned now in Hyatt as well, that partnerships really do shape, you know, where I am today and what our business is. Yeah, yeah, absolutely. It's, it's crucial. And what were some of the other important or standout lessons you took from these previous roles? I think from my point of view, it gave me great grounding in the full lifecycle of hotel projects, from identifying opportunities to structuring deals Supporting openings as well. That background really kind of gave me the understanding both of the commercial realities and the human relationships that I've kind of learned to build. And in the development world, it's. Yeah, that's really what I would say still is where I've kind of learned from the kind of the site to the, the actual opening of the hotel. Yeah, wonderful, wonderful. And on to present day, can you tell us about some of your responsibilities at Hyatt? And then, yeah, I'd love to talk about what's on the horizon for them. So Hyatt at the moment, I am looking after the UK and Ireland for their growth. We are super exciting times at the moment. We've really kind of grown over the last. Since 2017, we've doubled our portfolio in size. And also in the last year, we've opened the Hyatt place and Hyatt House in Leeds, which is a super exciting property. And we're looking to open the Hyatt Regency in Olympia and also a Hyatt Place in Paddington. So for, I mean, that's over a thousand rooms for Hyatt over the last 24 months, which, which is really exciting. Yeah, yeah, absolutely. And I understand the plans are that it sees the portfolio grow by more than 30% by 2026. So I wanted to ask what was behind the decision to push this new era of expansion now and how does Hyatt plan to sort of practically achieve that going forward? So going forwards, I think we really realized that we've got a great presence in London, but we really wanted to push the presence outside of London as well. And UK is a really good feeder market for our other markets in Europe. So whether it's resorts or whether it's other capital cities. And our strategy has been very much capital cities in Europe and then looking at secondary cities. So from a UK point of view, we really do want to concentrate on the Oxfords, the Cambridges, Newcastle, Glasgow, Cardiff. Those are really where they vibrant cities, well connected markets. And that's where the travelers, the domestic travelers and our US travelers will want to travel. So that's where we really want to push the next stage of our development. Yeah, yeah. Wonderful. Is there a, on a personal level, is there a particular market that is exciting you the most right now and that you're, you're looking forward to exploring? Well, coming from Liverpool, that's probably my, my name. Yeah, I'm not sure whether that's top of, top of highest aim, but it's a good secondary city and it would work well for US as well. Yeah. So we've got no presence there. I mean in the UK outside London. We're very underrepresented at the moment. So that's why we're really trying to push these secondary cities and look to expand in those areas as well. We're really looking at other. All the brands that we're looking at to really expand in the UK for Hyatt lifestyle and limited services brands are, are exceptional. They're performing very well. Travelers today really like those brands. They want a high quality experience that reflect that design led lifestyle. Hyatt Place, Hyatt centric fall into that bracket. Good examples. But also we're looking at, we actually bought over a year ago the Me and All brand which was a big expansion in Germany but we're trying to bring it over to the UK as well and to other European cities. That's a sociable, local and inspired lifestyle brand which I think could work very well in some of some quirky areas of London but also in the secondary cities as well. This also attracts the younger traveler as well that they don't necessarily want to be in that corporate hotel. But on the flip side we're really seeing a big push also in the luxury market as well. We've just opened the Park Hyatt in London and the Unbound Collection. Those people are still, I think with staycations and also wanting to treat themselves. Really want to feel that they want to go into that luxury market as well. Yeah. So we're seeing both the select service which could be the Taylor Swift effect when people go to a concert or something like that. But also someone wants, you know, the market outside, maybe at the moment, the economy or something. People think, well actually I might just want to actually go and treat myself. So it's getting that, that right balance. Yeah, wonderful. It sounds like, you know, Hyatt is very healthily positioned to be able to capture those two sides, which is wonderful and yeah, interesting. I was going to ask you in terms of demographics and was wondering if you know, the younger crowd was behind the rising popularity of lifestyle. Are there any other reasons, do you think that lifestyle seeing this surge. Because it's something we've sort of heard as a sentiment with some of our other guests and I was just wondering the reason behind that in your opinion. It's just the people want something a bit different and I think people are very, even in their own homes today, they're looking at new designs and everything else. And I think yes, it's trying to get that younger. It's about trying to get the local culture into the hotels as well, to give that mixture instead of. But there's still. For the traditional hotels, there's still that market as well. Yeah, I don't think it's just something that for different occasions, you want different things. So it might be for a weekend away and you want to spend a bit of time in the local area, but you don't necessarily need to be spending all the time in a meeting room or something like that. Yeah, yeah, exactly. And yes, I guess it's also about sort of capturing that sense of place. It's exploring. People want to explore and they want something a bit different. Yeah, yeah. Do you think post Covid has had anything to do with that as well? I think so. I think staycations are a big thing, so people want to get out and I think, again, I was saying with concerts and things like that, people are wanting the experience and not necessarily wanting to spend a fortune on a hotel room, but they want to stay away and make it a whole weekend. So I think that's changed and people. I mean, travel is coming back slowly. It is coming back, which is good. Corporate travel is coming back. Not as. Not as big as it was, but it is coming back. Yeah. And that's promising in of itself. And yeah, we've touched slightly on, you know, what's. What's happening in Europe with Hyatt, but I wanted to ask how this UK growth strategy sort of aligns with the wider European strategy and how those development goals sort of sink together under the higher umbrella. The UK is a cornerstone for Hyatt's Europe development for the whole region, really, and it's a vital part of our growth. We continue to lead the industry in net room growth by 8% year on year. So that's a massive positive. Our strategy really reflects the philosophy that drives our global expansion as well. So I think, as I said to you before, UK is such a big market, big feeder market for other European cities and for the US as well. So it just works well for us. Yeah, yeah. It's fascinating to see how those placements come together in that sort of macro perspective. Wonderful. And I guess in a more general sense, how would you. How else would you describe the sort of current state of the UK hotel development space in terms of health or interesting trends you're seeing and confidence? But what does that mean before or after the budget? In about a week and a half's time. That's a good point. Currently. Yeah. The current market at the moment, leisure travel still Remains strong, short breaks, staycations. But as I said, I think there's that mixture of leisure and business pleasure. I think it seems to be the new buzzword that everyone keeps using. And I think, again, I think back to younger travelers. They want to be. They need the flexibility and want connections. So I think that's where it's going. Which is great for Hyatt because we've got such a mixed portfolio that we can put the right guests in the right locations in the right hotels. Do you think, speaking of the budget, will that flexibility, do you think, hold higher in good stead? I know, obviously it's a. No one knows and we wish we had a crystal ball. We've bounced back from worse, I'm sure. Yeah. So I think over the time, Hyatt's what came from a family background. We IPO'd in 2009. We then adapted to franchising in 2017. So we have that ability to change. We need the adaptability as well. So I think we'll be absolutely fine. I think it's just at the moment, I think it's the uncertainty with financiers, its owners, its investors as well, that are probably slightly concerned about where it's going. But I think get the other side and we'll bed in. Yeah, yeah, absolutely. Excuse the pun. Running a hotel means juggling endless payments and expenses from suppliers to staff, all while keeping cash flow in check. That's where Apron helps. With Apron build pay, you can manage all your supplier payments in one place, approve, schedule and sync automatically with Xero or QuickBooks. And with the Apron card, your team can spend easily while you stay in control. With spend limits, auto receipts, chasing and full visibility, every purchase earns rewards you can turn into cashback or gift cards. It's free to get started and built for small businesses. Learn more@getapron.com. I guess for others listening, what, what would your advice be for preparing for these changes and being sort of light on your feet when it comes to navigating these challenges which the industry is undoubtedly facing the challenges. I think speed, you've got to be agile, you've got to keep moving. I think you've got to give that responsiveness. Yes, cost elements are difficult and cost and financing at the moment is a challenge. But I think if you secure the right sites with the right partners, you will be in that position to be able to actually move forward. That's where I mean from our point of view. I think as I said before, for me, partnership is key and working with Owners and investors who share our values and trust us, we can build something with them. Great and long term. Yeah. And then we've touched on this a bit before, but again, sort of looking at the state of the market right now, what types of brands do you think are performing best? I know we've mentioned lifestyle, but in general, which segments are you excited about? In which do you think will be healthy in the coming years? I think from. From a Hyatt point of view, Hyatt place, which I mentioned, we just opened in Leeds as well. We have two other Hyatt places in the uk is a flexible brand, but it's select service as well. So from an operations point of view, it's very efficient, but you have that flexibility. Both in one of our hotels in London and one of Leeds as well, we've got a rooftop bar. So you've got the rooftop bar, but actually you've got an efficient hotel as well, which is inexpensive. But to come and experience the hotel, but also have that slightly different quirky and great food and beverage offering as well there. Yeah, I think from. Also, as I said to you before, I still think the luxury market is still very strong. People are still very interested. And Park Height, an example, the Unbound Collection, which is great. Scotland Yard as well, is people just want to experience something a bit different, treat themselves to something quite nice and they're willing to spend the money. Yeah, yeah. And, yeah. And I mean, from an US point of view as well, coming from a lot of our US guests, luxury is. There's a lot of billionaires in the U.S. yeah. So coming across the pond is pretty good for them as well. So that. That's what they're used to. Yeah. Wonderful, wonderful. And again, we've touched on this a bit regarding demographics and what Hyatt's seen with that. How do you see that developing in the coming years in terms of what audiences do you think are prudent for hoteliers to keep in mind when capturing business going forward? I still think the commercial travel is still there. They might be doing shorter trips, but I still think you need to look at that. There are meetings and conferences still happening. And Hyatt has always historically been and is currently very strong in that mice business. As the young travelers as well, people are traveling more for. I mean, when I was a child, we didn't really go anywhere. Quite sad, really. But I think as people get older, you know, people go on city trips. They go. But it's. Whether it's. They're going to football and they May spend a night there, they might go to a. It's entertainment. It's entertainment. That's maybe bringing up that market as well. Really helping. Yeah, yeah. It seems again that. That sort of experience. Yeah, absolutely. Yeah, it's key. Wonderful. And again, looking ahead, what major shifts do you anticipate in terms of hotel ownership and management structures? Sort of post 2025, would you say. There has been a shift over the last 10 years? The growth of the third party operator owners are wanting a bit more flexibility. So owners have changed over the last owners and financing, I think of hotels has changed over the last 10 years and it's ever evolving. New owners are coming into the market that probably have never thought about his hospitality before. They could have been investors in offices, but there's been quite a lot of office conversions to hotels, especially in the uk. There is some education because there's some other real estate owners that think you're going to give them a lease. But actually majority of our hotel owned brands are really very much down to management and franchise. It just doesn't really work from us, from a leasing model, doesn't really work for us, but it's just really giving that flexibility. I think it's working with, again, it goes back to partnerships. It's working with the right partners and those long term partners of how we're going to kind of keep their business going and the funding and if it's with the right. If you're in the right brand, in the right location with the right partner, you're setting yourself up for success. Yeah, absolutely. And would you say that that is a core principle of Hyatt then? Obviously the growth it's seen as a group is incredible. And is that, do you think the driving force behind that. The driving force behind it is it is all down to relationships and partnerships. Our ownership community is very strong and we want to keep it that way. We really do need. Yeah, that. I mean that's more important than putting the wrong hotel. We need the right partners with us. Putting the wrong hotel in the wrong location doesn't really work for us either. But the partnership is even stronger because we want to work with them in the future. Yeah. And how do you identify who the best partners are for hire? What do you look for? I think it's down to relationships and how we've built it up. It may be a relationship that we've had over some time that we've known them and we've seen them, but actually we've not done a deal with them. But actually the Right. Deals come along and we now know, yes, we have to do the due diligence and we do need to do the financial checks as well. But if you're, especially if it's something like a development, it's a long term, if you're spending five years with someone, maybe from signing to actually opening a hotel, you need to get on with those people and you need to trust them. And we need to work collaboratively together as well. So it's really, that's where the owners are, the right ownership for us. Yeah. And what would you say is the key or are the keys to sustaining that positive relationship? Is it a matter of transparency and communication? What would you say is the key? If I look at our operation directors and I look at our head of franchising as well, it's a trust element, but it's also very data driven as well. We have a very big team in the States and we have a team in Zurich as well that are very much, very transparent. When we're having a conversation, say with an owner and, and it's a franchise, we very much make sure that the owner and the third party operator are involved in all the meetings. We're not just going to just say, oh well, we said to the owner this and you said to that no blame game, this is transparency that's needed and that's what we really want to put across. So I think from our point of view, that's what really works. Yes. And I suppose having that unifying goal is having that North Star is. Yeah. Key. Absolutely. And, and would you say these, these sort of relationships at the backbone of Hyatt, does that translate then to customers, would you say in sort of a sense of, of trust in the brand? How does that reflect in, in customers? Yeah, I think it, I think it, I mean, care is a big value of Hyatt's and actually caring for our guests as well as our owners as well as our employees. If the housekeepers are happy in the hotels, then the guests are going to be happy in the hotels. If we treat them well, it's really looking at making sure that the guests are happy. And if the guests are happy, then it helps the owner on the bottom line. The general manager runs the right, runs operations well then it resonates through the whole hotel and ends up with your better TripAdvisor reports your best guest satisfaction and that ultimately helps will push the top line. It will help your revpar. It's been proven good guest satisfaction scores do push your revpar, which ultimately for an Investor. It gives him the better bottom line. Yeah, yeah. And wonderful to see those tangible results, I guess, reflected. Wonderful. And yes, we've. We've touched on it again a bit, but just looking ahead imminently, what are you most excited about for Hyatt on the horizon? I'm excited about. I'm excited about the Hyatt Regency Olympia opening next year, which is really exciting. So that's a great one. And hopefully towards the end of the year, the Hyatt place in Paddington as well. I think also we've got a lot of great projects coming along. Fingers crossed that some of them get across the line before the end of the year, but unfortunately can't tell. But also I think just the team we've got in place as well, especially in development, we've got a very collaborative team. We all work very well together and I think that's what's exciting as well. We all support each other and we might be a relatively small team, but that really works. Yeah. Why do you think that is? Would you say the small nature being such a positive driver for. For this? I think we all work well as a team and we'd all back each other and we'd all step in if someone else wasn't available. We would work together. We all. We're all under pressure and we know that, but I think it's just the nature of the people in the team as well. Yeah. That the top have obviously employed the right people. If you. If you're a good leader, you employed the right people below you. Yeah. That can help you do that work, but also get the right team spirit as well. Yeah. Wonderful. And, yeah, all falls into place. Brilliant. Yes. And we finish each episode with a question left by the previous guest. And our last guest was James Cohen, who's HR director at the Ascot Limited. And he asked what was the first bit of feedback you were given that has stuck with you? That's better feedback, I think, from my point of view. Always be responsive people ring you for a reason. So just ring them back. Even if it's a difficult conversation, even if you might second guess what they're going to ask you or you've got nothing to say, just ring them back. That would be my advice. Don't send them an email if they've rung you just give them a call back. Yeah. The personal touch again. Yeah, exactly. Yeah. Wonderful advice and I think one that transpires all. All careers and life paths. Yes, exactly. And finally, Anna, do you have a question to leave for our next guest? I do if you could open a hotel anywhere in the world, no budget, no limits, where would it be and what would it look like? That's a great question. I love that. We will make sure to pass that on. Anna, thank you so much for joining us. It's been great speaking with you and. Thank you so much. Thank you for having me. Thanks for listening to Checking In, a weekly podcast from hotel owner, the UK's trusted source of hotel industry news and analysis. If you like the podcast, make sure to subscribe on whichever podcast platform you listen to. To get more industry Insight, head to hotelowner.co.uk and subscribe for unlimited access. If you're interested in sponsoring episodes of the podcast, drop us a line@podcastotelowner.co.uk. Running a hotel means juggling endless payments and expenses from suppliers to staff, all while keeping cash flow in check. That's where Apron helps. With Apron bill pay, you can manage all your supplier payments in one place, approve, schedule and sync automatically with Xero or QuickBooks. And with the Apron card, your team can spend easily while you stay in control. With spend limits, auto receipts, chasing and full visibility, every purchase earns rewards you can turn into cash back or gift cards. It's free to get started and built for small businesses. Learn more@getapron.com.",
    "words": 4723,
    "confidence": 0.9757078,
    "audio_duration": 1744
  },
  "utterances": [
    {
      "speaker": "A",
      "text": "Running a hotel means juggling endless payments and expenses from suppliers to staff, all while keeping cash flow in check. That's where Apron helps. With Apron bill pay, you can manage all your supplier payments in one place, approve, schedule and sync automatically with Xero or QuickBooks. And with the Apron card, your team can spend easily while you stay in control. With spend limits, auto receipts, chasing and full visibility, every purchase earns rewards you can turn into cash back or gift cards. It's free to get started in built for small businesses. Learn more@getapron.com.",
      "start": 1840,
      "end": 35040,
      "confidence": 0.966769
    },
    {
      "speaker": "B",
      "text": "Welcome to Checking In, a weekly podcast from hotel owner, the UK's trusted source of hotel industry news and analysis. Each week we meet a new guest and learn their story, all the highs and lows, triumphs and disasters they faced and how they got through to the other side. If you like the podcast, make sure to subscribe on whichever podcast platform you listen to more industry Insight head to hotelowner.co.uk and subscribe for unlimited access. If you're interested in sponsoring episodes of the podcast, drop us a line at podcastotelewner.co.uk.",
      "start": 43600,
      "end": 73100,
      "confidence": 0.9905158
    },
    {
      "speaker": "C",
      "text": "Hi, I'm Heather, host of this episode.",
      "start": 73980,
      "end": 76220,
      "confidence": 0.9978957
    },
    {
      "speaker": "A",
      "text": "Where we speak to Anna Corkill, Regional vice president, development UK and Ireland at Hyatt. Anna spoke about Hyatt's plans to grow its UK portfolio by over 30%, why it's setting its sights on the UK's.",
      "start": 76300,
      "end": 89300,
      "confidence": 0.97947055
    },
    {
      "speaker": "C",
      "text": "Exciting regional destinations, how it's well positioned.",
      "start": 89300,
      "end": 92620,
      "confidence": 0.997547
    },
    {
      "speaker": "A",
      "text": "To capture the burgeoning lifestyle and luxury.",
      "start": 92620,
      "end": 94820,
      "confidence": 0.91648644
    },
    {
      "speaker": "C",
      "text": "Markets, and how Hyatt maintains the strong partnerships that lie at its core. Hi Anna, welcome to Checking in and thank you so much for joining us.",
      "start": 94820,
      "end": 103820,
      "confidence": 0.9912757
    },
    {
      "speaker": "D",
      "text": "Thank you so much for having me.",
      "start": 103820,
      "end": 105420,
      "confidence": 0.99912804
    },
    {
      "speaker": "C",
      "text": "So very excited to talk about Hyatt's plans. But before we get onto that for our listeners, can you just tell us a bit about your career journey prior to Hyatt and take us through some of your earlier formative roles?",
      "start": 106140,
      "end": 119920,
      "confidence": 0.9860304
    },
    {
      "speaker": "D",
      "text": "Yes, so I've always had an interest in hospitality I think with when I was at university and whether I was working in hotels and catering and it was a very different world. But I actually ended up starting going into the property world. So my background comes from I trained as a chartered surveyor doing developments in the West End of London and then moving on a bit by accident working with PKF in their hotel consulting. Originally applied for their corporate recovery but ended up in their hotel consulting team because I was arics qualified. They were doing hotel valuations and probably needed someone to sign off on some some valuations, although I ended up doing more Transactions than I actually did valuations through that. Doing a deal actually with Peter Norman who I actually now work with at Hyatt. So it's all come back full circle. He was working at Le Meridian and ended up joining their development team at Le Meridian, which is also where I met Felicity Black Roberts, which we're also now working together at Hyatt. So there's a big connection there. Through there. I then actually went on maternity leave, came back and then actually IHG at the time kind of approached me and said, would I like to go and work for. Ran their UK and Ireland with Richard Arman, who is a great mentor and fantastic person to be working with and then was there for a long time, but actually in having learned so much there as well, but actually was up for a new challenge and with both Peter Norman and Felicity Black Roberts both, you know, we'd all work together again. It was great to get the team back.",
      "start": 120240,
      "end": 221780,
      "confidence": 0.9744733
    },
    {
      "speaker": "C",
      "text": "Yeah.",
      "start": 221780,
      "end": 222180,
      "confidence": 0.8486328
    },
    {
      "speaker": "D",
      "text": "So hence that's why I was really kind of came back to Hyatt. And so far so good. It's been amazing and it's. Yeah, I have to say I've had a great time so far.",
      "start": 222180,
      "end": 230870,
      "confidence": 0.96347654
    },
    {
      "speaker": "C",
      "text": "Wonderful. And that's the beauty of hospitality, isn't it? You have that community and a face will usually reappear again. And that's wonderful. And so, yeah, really interesting career background. I assume then the background with both property and consultancy created quite a good toolbox for your lady. Were there any sort of standout learnings that you took from, from your time and in those areas that particularly prove useful today?",
      "start": 231110,
      "end": 261260,
      "confidence": 0.9530316
    },
    {
      "speaker": "D",
      "text": "I would say the biggest learning is that people do business with people they like and trust. I have kind of most of my life has been I'm so interested in people. So I think people for me is the industries run on partnerships and relationships. And I think that's, that's from my point of view is where I would really push to go. I mean, mentors have said to me, stay curious, listen. But it's a long term relationship that you're looking for. So that would be my biggest learning curve. And I think that's what I've really learned now in Hyatt as well, that partnerships really do shape, you know, where I am today and what our business is.",
      "start": 262300,
      "end": 303540,
      "confidence": 0.980005
    },
    {
      "speaker": "C",
      "text": "Yeah, yeah, absolutely. It's, it's crucial. And what were some of the other important or standout lessons you took from these previous roles?",
      "start": 303700,
      "end": 314320,
      "confidence": 0.9603643
    },
    {
      "speaker": "D",
      "text": "I think from my point of view, it gave me great grounding in the full lifecycle of hotel projects, from identifying opportunities to structuring deals Supporting openings as well. That background really kind of gave me the understanding both of the commercial realities and the human relationships that I've kind of learned to build. And in the development world, it's. Yeah, that's really what I would say still is where I've kind of learned from the kind of the site to the, the actual opening of the hotel.",
      "start": 315280,
      "end": 349140,
      "confidence": 0.9750683
    },
    {
      "speaker": "C",
      "text": "Yeah, wonderful, wonderful. And on to present day, can you tell us about some of your responsibilities at Hyatt? And then, yeah, I'd love to talk about what's on the horizon for them.",
      "start": 349700,
      "end": 361550,
      "confidence": 0.9828904
    },
    {
      "speaker": "D",
      "text": "So Hyatt at the moment, I am looking after the UK and Ireland for their growth. We are super exciting times at the moment. We've really kind of grown over the last. Since 2017, we've doubled our portfolio in size. And also in the last year, we've opened the Hyatt place and Hyatt House in Leeds, which is a super exciting property. And we're looking to open the Hyatt Regency in Olympia and also a Hyatt Place in Paddington. So for, I mean, that's over a thousand rooms for Hyatt over the last 24 months, which, which is really exciting.",
      "start": 362270,
      "end": 404350,
      "confidence": 0.9688122
    },
    {
      "speaker": "C",
      "text": "Yeah, yeah, absolutely. And I understand the plans are that it sees the portfolio grow by more than 30% by 2026. So I wanted to ask what was behind the decision to push this new era of expansion now and how does Hyatt plan to sort of practically achieve that going forward?",
      "start": 404590,
      "end": 428950,
      "confidence": 0.9707736
    },
    {
      "speaker": "D",
      "text": "So going forwards, I think we really realized that we've got a great presence in London, but we really wanted to push the presence outside of London as well. And UK is a really good feeder market for our other markets in Europe. So whether it's resorts or whether it's other capital cities. And our strategy has been very much capital cities in Europe and then looking at secondary cities. So from a UK point of view, we really do want to concentrate on the Oxfords, the Cambridges, Newcastle, Glasgow, Cardiff. Those are really where they vibrant cities, well connected markets. And that's where the travelers, the domestic travelers and our US travelers will want to travel. So that's where we really want to push the next stage of our development.",
      "start": 429830,
      "end": 478840,
      "confidence": 0.9708393
    },
    {
      "speaker": "C",
      "text": "Yeah, yeah. Wonderful. Is there a, on a personal level, is there a particular market that is exciting you the most right now and that you're, you're looking forward to exploring?",
      "start": 479480,
      "end": 490040,
      "confidence": 0.97098666
    },
    {
      "speaker": "D",
      "text": "Well, coming from Liverpool, that's probably my, my name. Yeah, I'm not sure whether that's top of, top of highest aim, but it's a good secondary city and it would work well for US as well.",
      "start": 490040,
      "end": 502890,
      "confidence": 0.9485937
    },
    {
      "speaker": "C",
      "text": "Yeah.",
      "start": 502970,
      "end": 503450,
      "confidence": 0.7322591
    },
    {
      "speaker": "D",
      "text": "So we've got no presence there. I mean in the UK outside London. We're very underrepresented at the moment. So that's why we're really trying to push these secondary cities and look to expand in those areas as well. We're really looking at other. All the brands that we're looking at to really expand in the UK for Hyatt lifestyle and limited services brands are, are exceptional. They're performing very well. Travelers today really like those brands. They want a high quality experience that reflect that design led lifestyle. Hyatt Place, Hyatt centric fall into that bracket. Good examples. But also we're looking at, we actually bought over a year ago the Me and All brand which was a big expansion in Germany but we're trying to bring it over to the UK as well and to other European cities. That's a sociable, local and inspired lifestyle brand which I think could work very well in some of some quirky areas of London but also in the secondary cities as well. This also attracts the younger traveler as well that they don't necessarily want to be in that corporate hotel. But on the flip side we're really seeing a big push also in the luxury market as well. We've just opened the Park Hyatt in London and the Unbound Collection. Those people are still, I think with staycations and also wanting to treat themselves. Really want to feel that they want to go into that luxury market as well.",
      "start": 503530,
      "end": 595820,
      "confidence": 0.97480065
    },
    {
      "speaker": "C",
      "text": "Yeah.",
      "start": 595820,
      "end": 596220,
      "confidence": 0.87874347
    },
    {
      "speaker": "D",
      "text": "So we're seeing both the select service which could be the Taylor Swift effect when people go to a concert or something like that. But also someone wants, you know, the market outside, maybe at the moment, the economy or something. People think, well actually I might just want to actually go and treat myself. So it's getting that, that right balance.",
      "start": 596220,
      "end": 613820,
      "confidence": 0.9692304
    },
    {
      "speaker": "C",
      "text": "Yeah, wonderful. It sounds like, you know, Hyatt is very healthily positioned to be able to capture those two sides, which is wonderful and yeah, interesting. I was going to ask you in terms of demographics and was wondering if you know, the younger crowd was behind the rising popularity of lifestyle. Are there any other reasons, do you think that lifestyle seeing this surge. Because it's something we've sort of heard as a sentiment with some of our other guests and I was just wondering the reason behind that in your opinion.",
      "start": 614270,
      "end": 644210,
      "confidence": 0.97300017
    },
    {
      "speaker": "D",
      "text": "It's just the people want something a bit different and I think people are very, even in their own homes today, they're looking at new designs and everything else. And I think yes, it's trying to get that younger. It's about trying to get the local culture into the hotels as well, to give that mixture instead of. But there's still. For the traditional hotels, there's still that market as well. Yeah, I don't think it's just something that for different occasions, you want different things. So it might be for a weekend away and you want to spend a bit of time in the local area, but you don't necessarily need to be spending all the time in a meeting room or something like that.",
      "start": 644210,
      "end": 685120,
      "confidence": 0.9828546
    },
    {
      "speaker": "C",
      "text": "Yeah, yeah, exactly. And yes, I guess it's also about sort of capturing that sense of place.",
      "start": 685200,
      "end": 690560,
      "confidence": 0.9666006
    },
    {
      "speaker": "D",
      "text": "It's exploring. People want to explore and they want something a bit different.",
      "start": 691760,
      "end": 695120,
      "confidence": 0.99660707
    },
    {
      "speaker": "C",
      "text": "Yeah, yeah. Do you think post Covid has had anything to do with that as well?",
      "start": 695360,
      "end": 700410,
      "confidence": 0.9877116
    },
    {
      "speaker": "D",
      "text": "I think so. I think staycations are a big thing, so people want to get out and I think, again, I was saying with concerts and things like that, people are wanting the experience and not necessarily wanting to spend a fortune on a hotel room, but they want to stay away and make it a whole weekend. So I think that's changed and people. I mean, travel is coming back slowly. It is coming back, which is good. Corporate travel is coming back. Not as. Not as big as it was, but it is coming back.",
      "start": 700410,
      "end": 730300,
      "confidence": 0.98635834
    },
    {
      "speaker": "C",
      "text": "Yeah. And that's promising in of itself. And yeah, we've touched slightly on, you know, what's. What's happening in Europe with Hyatt, but I wanted to ask how this UK growth strategy sort of aligns with the wider European strategy and how those development goals sort of sink together under the higher umbrella.",
      "start": 730860,
      "end": 752700,
      "confidence": 0.96091753
    },
    {
      "speaker": "D",
      "text": "The UK is a cornerstone for Hyatt's Europe development for the whole region, really, and it's a vital part of our growth. We continue to lead the industry in net room growth by 8% year on year. So that's a massive positive. Our strategy really reflects the philosophy that drives our global expansion as well. So I think, as I said to you before, UK is such a big market, big feeder market for other European cities and for the US as well. So it just works well for us.",
      "start": 753880,
      "end": 788850,
      "confidence": 0.9787019
    },
    {
      "speaker": "C",
      "text": "Yeah, yeah. It's fascinating to see how those placements come together in that sort of macro perspective. Wonderful. And I guess in a more general sense, how would you. How else would you describe the sort of current state of the UK hotel development space in terms of health or interesting trends you're seeing and confidence?",
      "start": 789250,
      "end": 812900,
      "confidence": 0.9718148
    },
    {
      "speaker": "D",
      "text": "But what does that mean before or after the budget? In about a week and a half's time.",
      "start": 812900,
      "end": 816980,
      "confidence": 0.87939
    },
    {
      "speaker": "C",
      "text": "That's a good point. Currently.",
      "start": 817060,
      "end": 818820,
      "confidence": 0.99746096
    },
    {
      "speaker": "D",
      "text": "Yeah. The current market at the moment, leisure travel still Remains strong, short breaks, staycations. But as I said, I think there's that mixture of leisure and business pleasure. I think it seems to be the new buzzword that everyone keeps using. And I think, again, I think back to younger travelers. They want to be. They need the flexibility and want connections. So I think that's where it's going. Which is great for Hyatt because we've got such a mixed portfolio that we can put the right guests in the right locations in the right hotels.",
      "start": 819140,
      "end": 856670,
      "confidence": 0.98095816
    },
    {
      "speaker": "C",
      "text": "Do you think, speaking of the budget, will that flexibility, do you think, hold higher in good stead? I know, obviously it's a. No one knows and we wish we had a crystal ball.",
      "start": 857710,
      "end": 868470,
      "confidence": 0.96670353
    },
    {
      "speaker": "D",
      "text": "We've bounced back from worse, I'm sure.",
      "start": 868550,
      "end": 870550,
      "confidence": 0.97907364
    },
    {
      "speaker": "C",
      "text": "Yeah.",
      "start": 870710,
      "end": 871230,
      "confidence": 0.866862
    },
    {
      "speaker": "D",
      "text": "So I think over the time, Hyatt's what came from a family background. We IPO'd in 2009. We then adapted to franchising in 2017. So we have that ability to change. We need the adaptability as well. So I think we'll be absolutely fine. I think it's just at the moment, I think it's the uncertainty with financiers, its owners, its investors as well, that are probably slightly concerned about where it's going. But I think get the other side and we'll bed in.",
      "start": 871230,
      "end": 904810,
      "confidence": 0.96990967
    },
    {
      "speaker": "C",
      "text": "Yeah, yeah, absolutely.",
      "start": 905050,
      "end": 906490,
      "confidence": 0.94318575
    },
    {
      "speaker": "D",
      "text": "Excuse the pun.",
      "start": 906490,
      "end": 907370,
      "confidence": 0.86976457
    },
    {
      "speaker": "A",
      "text": "Running a hotel means juggling endless payments and expenses from suppliers to staff, all while keeping cash flow in check. That's where Apron helps. With Apron build pay, you can manage all your supplier payments in one place, approve, schedule and sync automatically with Xero or QuickBooks. And with the Apron card, your team can spend easily while you stay in control. With spend limits, auto receipts, chasing and full visibility, every purchase earns rewards you can turn into cashback or gift cards. It's free to get started and built for small businesses. Learn more@getapron.com.",
      "start": 908970,
      "end": 942330,
      "confidence": 0.9723964
    },
    {
      "speaker": "C",
      "text": "I guess for others listening, what, what would your advice be for preparing for these changes and being sort of light on your feet when it comes to navigating these challenges which the industry is undoubtedly facing the challenges.",
      "start": 944090,
      "end": 961450,
      "confidence": 0.9537298
    },
    {
      "speaker": "D",
      "text": "I think speed, you've got to be agile, you've got to keep moving. I think you've got to give that responsiveness. Yes, cost elements are difficult and cost and financing at the moment is a challenge. But I think if you secure the right sites with the right partners, you will be in that position to be able to actually move forward. That's where I mean from our point of view. I think as I said before, for me, partnership is key and working with Owners and investors who share our values and trust us, we can build something with them. Great and long term.",
      "start": 962090,
      "end": 1002720,
      "confidence": 0.9825963
    },
    {
      "speaker": "C",
      "text": "Yeah. And then we've touched on this a bit before, but again, sort of looking at the state of the market right now, what types of brands do you think are performing best? I know we've mentioned lifestyle, but in general, which segments are you excited about? In which do you think will be healthy in the coming years?",
      "start": 1002880,
      "end": 1024560,
      "confidence": 0.9689314
    },
    {
      "speaker": "D",
      "text": "I think from. From a Hyatt point of view, Hyatt place, which I mentioned, we just opened in Leeds as well. We have two other Hyatt places in the uk is a flexible brand, but it's select service as well. So from an operations point of view, it's very efficient, but you have that flexibility. Both in one of our hotels in London and one of Leeds as well, we've got a rooftop bar. So you've got the rooftop bar, but actually you've got an efficient hotel as well, which is inexpensive. But to come and experience the hotel, but also have that slightly different quirky and great food and beverage offering as well there. Yeah, I think from. Also, as I said to you before, I still think the luxury market is still very strong. People are still very interested. And Park Height, an example, the Unbound Collection, which is great. Scotland Yard as well, is people just want to experience something a bit different, treat themselves to something quite nice and they're willing to spend the money.",
      "start": 1025360,
      "end": 1089380,
      "confidence": 0.9795826
    },
    {
      "speaker": "C",
      "text": "Yeah, yeah.",
      "start": 1089620,
      "end": 1090580,
      "confidence": 0.94954425
    },
    {
      "speaker": "D",
      "text": "And, yeah. And I mean, from an US point of view as well, coming from a lot of our US guests, luxury is. There's a lot of billionaires in the U.S. yeah. So coming across the pond is pretty good for them as well. So that. That's what they're used to.",
      "start": 1090900,
      "end": 1106420,
      "confidence": 0.96222126
    },
    {
      "speaker": "C",
      "text": "Yeah. Wonderful, wonderful. And again, we've touched on this a bit regarding demographics and what Hyatt's seen with that. How do you see that developing in the coming years in terms of what audiences do you think are prudent for hoteliers to keep in mind when capturing business going forward?",
      "start": 1106500,
      "end": 1127790,
      "confidence": 0.9756722
    },
    {
      "speaker": "D",
      "text": "I still think the commercial travel is still there. They might be doing shorter trips, but I still think you need to look at that. There are meetings and conferences still happening. And Hyatt has always historically been and is currently very strong in that mice business. As the young travelers as well, people are traveling more for. I mean, when I was a child, we didn't really go anywhere. Quite sad, really. But I think as people get older, you know, people go on city trips. They go. But it's. Whether it's. They're going to football and they May spend a night there, they might go to a. It's entertainment. It's entertainment. That's maybe bringing up that market as well. Really helping.",
      "start": 1128910,
      "end": 1169470,
      "confidence": 0.9752872
    },
    {
      "speaker": "C",
      "text": "Yeah, yeah. It seems again that. That sort of experience.",
      "start": 1169950,
      "end": 1173230,
      "confidence": 0.9837402
    },
    {
      "speaker": "D",
      "text": "Yeah, absolutely.",
      "start": 1173790,
      "end": 1174590,
      "confidence": 0.9257487
    },
    {
      "speaker": "C",
      "text": "Yeah, it's key. Wonderful. And again, looking ahead, what major shifts do you anticipate in terms of hotel ownership and management structures? Sort of post 2025, would you say.",
      "start": 1175070,
      "end": 1190190,
      "confidence": 0.97794867
    },
    {
      "speaker": "D",
      "text": "There has been a shift over the last 10 years? The growth of the third party operator owners are wanting a bit more flexibility. So owners have changed over the last owners and financing, I think of hotels has changed over the last 10 years and it's ever evolving. New owners are coming into the market that probably have never thought about his hospitality before. They could have been investors in offices, but there's been quite a lot of office conversions to hotels, especially in the uk. There is some education because there's some other real estate owners that think you're going to give them a lease. But actually majority of our hotel owned brands are really very much down to management and franchise. It just doesn't really work from us, from a leasing model, doesn't really work for us, but it's just really giving that flexibility. I think it's working with, again, it goes back to partnerships. It's working with the right partners and those long term partners of how we're going to kind of keep their business going and the funding and if it's with the right. If you're in the right brand, in the right location with the right partner, you're setting yourself up for success.",
      "start": 1191390,
      "end": 1269760,
      "confidence": 0.9811609
    },
    {
      "speaker": "C",
      "text": "Yeah, absolutely. And would you say that that is a core principle of Hyatt then? Obviously the growth it's seen as a group is incredible. And is that, do you think the driving force behind that.",
      "start": 1270160,
      "end": 1282670,
      "confidence": 0.9492567
    },
    {
      "speaker": "D",
      "text": "The driving force behind it is it is all down to relationships and partnerships. Our ownership community is very strong and we want to keep it that way. We really do need. Yeah, that. I mean that's more important than putting the wrong hotel. We need the right partners with us. Putting the wrong hotel in the wrong location doesn't really work for us either. But the partnership is even stronger because we want to work with them in the future.",
      "start": 1282750,
      "end": 1310110,
      "confidence": 0.9820803
    },
    {
      "speaker": "C",
      "text": "Yeah. And how do you identify who the best partners are for hire? What do you look for?",
      "start": 1310350,
      "end": 1317390,
      "confidence": 0.98988175
    },
    {
      "speaker": "D",
      "text": "I think it's down to relationships and how we've built it up. It may be a relationship that we've had over some time that we've known them and we've seen them, but actually we've not done a deal with them. But actually the Right. Deals come along and we now know, yes, we have to do the due diligence and we do need to do the financial checks as well. But if you're, especially if it's something like a development, it's a long term, if you're spending five years with someone, maybe from signing to actually opening a hotel, you need to get on with those people and you need to trust them. And we need to work collaboratively together as well. So it's really, that's where the owners are, the right ownership for us.",
      "start": 1317870,
      "end": 1357970,
      "confidence": 0.98554146
    },
    {
      "speaker": "C",
      "text": "Yeah. And what would you say is the key or are the keys to sustaining that positive relationship? Is it a matter of transparency and communication? What would you say is the key?",
      "start": 1358530,
      "end": 1372330,
      "confidence": 0.9839114
    },
    {
      "speaker": "D",
      "text": "If I look at our operation directors and I look at our head of franchising as well, it's a trust element, but it's also very data driven as well. We have a very big team in the States and we have a team in Zurich as well that are very much, very transparent. When we're having a conversation, say with an owner and, and it's a franchise, we very much make sure that the owner and the third party operator are involved in all the meetings. We're not just going to just say, oh well, we said to the owner this and you said to that no blame game, this is transparency that's needed and that's what we really want to put across. So I think from our point of view, that's what really works.",
      "start": 1372890,
      "end": 1414430,
      "confidence": 0.9846562
    },
    {
      "speaker": "C",
      "text": "Yes. And I suppose having that unifying goal is having that North Star is. Yeah. Key. Absolutely. And, and would you say these, these sort of relationships at the backbone of Hyatt, does that translate then to customers, would you say in sort of a sense of, of trust in the brand? How does that reflect in, in customers?",
      "start": 1415310,
      "end": 1436440,
      "confidence": 0.95476323
    },
    {
      "speaker": "D",
      "text": "Yeah, I think it, I think it, I mean, care is a big value of Hyatt's and actually caring for our guests as well as our owners as well as our employees. If the housekeepers are happy in the hotels, then the guests are going to be happy in the hotels. If we treat them well, it's really looking at making sure that the guests are happy. And if the guests are happy, then it helps the owner on the bottom line. The general manager runs the right, runs operations well then it resonates through the whole hotel and ends up with your better TripAdvisor reports your best guest satisfaction and that ultimately helps will push the top line. It will help your revpar. It's been proven good guest satisfaction scores do push your revpar, which ultimately for an Investor. It gives him the better bottom line.",
      "start": 1436440,
      "end": 1491710,
      "confidence": 0.98113227
    },
    {
      "speaker": "C",
      "text": "Yeah, yeah. And wonderful to see those tangible results, I guess, reflected. Wonderful. And yes, we've. We've touched on it again a bit, but just looking ahead imminently, what are you most excited about for Hyatt on the horizon?",
      "start": 1492030,
      "end": 1509000,
      "confidence": 0.9620518
    },
    {
      "speaker": "D",
      "text": "I'm excited about. I'm excited about the Hyatt Regency Olympia opening next year, which is really exciting. So that's a great one. And hopefully towards the end of the year, the Hyatt place in Paddington as well. I think also we've got a lot of great projects coming along. Fingers crossed that some of them get across the line before the end of the year, but unfortunately can't tell. But also I think just the team we've got in place as well, especially in development, we've got a very collaborative team. We all work very well together and I think that's what's exciting as well. We all support each other and we might be a relatively small team, but that really works.",
      "start": 1509480,
      "end": 1550580,
      "confidence": 0.99251074
    },
    {
      "speaker": "C",
      "text": "Yeah. Why do you think that is? Would you say the small nature being such a positive driver for. For this?",
      "start": 1551300,
      "end": 1560430,
      "confidence": 0.98261565
    },
    {
      "speaker": "D",
      "text": "I think we all work well as a team and we'd all back each other and we'd all step in if someone else wasn't available. We would work together. We all. We're all under pressure and we know that, but I think it's just the nature of the people in the team as well.",
      "start": 1562510,
      "end": 1578110,
      "confidence": 0.9774358
    },
    {
      "speaker": "C",
      "text": "Yeah.",
      "start": 1578190,
      "end": 1578590,
      "confidence": 0.9635417
    },
    {
      "speaker": "D",
      "text": "That the top have obviously employed the right people. If you. If you're a good leader, you employed the right people below you.",
      "start": 1578590,
      "end": 1585030,
      "confidence": 0.96697026
    },
    {
      "speaker": "C",
      "text": "Yeah.",
      "start": 1585030,
      "end": 1585470,
      "confidence": 0.97998047
    },
    {
      "speaker": "D",
      "text": "That can help you do that work, but also get the right team spirit as well.",
      "start": 1585740,
      "end": 1589660,
      "confidence": 0.99016315
    },
    {
      "speaker": "C",
      "text": "Yeah. Wonderful. And, yeah, all falls into place. Brilliant. Yes. And we finish each episode with a question left by the previous guest. And our last guest was James Cohen, who's HR director at the Ascot Limited. And he asked what was the first bit of feedback you were given that has stuck with you?",
      "start": 1589740,
      "end": 1611340,
      "confidence": 0.97472405
    },
    {
      "speaker": "D",
      "text": "That's better feedback, I think, from my point of view. Always be responsive people ring you for a reason. So just ring them back. Even if it's a difficult conversation, even if you might second guess what they're going to ask you or you've got nothing to say, just ring them back. That would be my advice. Don't send them an email if they've rung you just give them a call back.",
      "start": 1613270,
      "end": 1636950,
      "confidence": 0.9809689
    },
    {
      "speaker": "C",
      "text": "Yeah.",
      "start": 1637420,
      "end": 1637740,
      "confidence": 0.9082031
    },
    {
      "speaker": "D",
      "text": "The personal touch again.",
      "start": 1638060,
      "end": 1639340,
      "confidence": 0.98669434
    },
    {
      "speaker": "C",
      "text": "Yeah, exactly. Yeah. Wonderful advice and I think one that transpires all. All careers and life paths.",
      "start": 1639580,
      "end": 1646980,
      "confidence": 0.9518636
    },
    {
      "speaker": "D",
      "text": "Yes, exactly.",
      "start": 1646980,
      "end": 1647900,
      "confidence": 0.9752197
    },
    {
      "speaker": "C",
      "text": "And finally, Anna, do you have a question to leave for our next guest?",
      "start": 1648300,
      "end": 1651900,
      "confidence": 0.9882638
    },
    {
      "speaker": "D",
      "text": "I do if you could open a hotel anywhere in the world, no budget, no limits, where would it be and what would it look like?",
      "start": 1652860,
      "end": 1664800,
      "confidence": 0.9971454
    },
    {
      "speaker": "C",
      "text": "That's a great question.",
      "start": 1665760,
      "end": 1666880,
      "confidence": 0.96293133
    },
    {
      "speaker": "D",
      "text": "I love that.",
      "start": 1667040,
      "end": 1667840,
      "confidence": 0.9983724
    },
    {
      "speaker": "C",
      "text": "We will make sure to pass that on. Anna, thank you so much for joining us. It's been great speaking with you and.",
      "start": 1668000,
      "end": 1673600,
      "confidence": 0.94420856
    },
    {
      "speaker": "D",
      "text": "Thank you so much. Thank you for having me.",
      "start": 1673600,
      "end": 1675760,
      "confidence": 0.96118164
    },
    {
      "speaker": "B",
      "text": "Thanks for listening to Checking In, a weekly podcast from hotel owner, the UK's trusted source of hotel industry news and analysis. If you like the podcast, make sure to subscribe on whichever podcast platform you listen to. To get more industry Insight, head to hotelowner.co.uk and subscribe for unlimited access. If you're interested in sponsoring episodes of the podcast, drop us a line@podcastotelowner.co.uk.",
      "start": 1676960,
      "end": 1699990,
      "confidence": 0.9875515
    },
    {
      "speaker": "A",
      "text": "Running a hotel means juggling endless payments and expenses from suppliers to staff, all while keeping cash flow in check. That's where Apron helps. With Apron bill pay, you can manage all your supplier payments in one place, approve, schedule and sync automatically with Xero or QuickBooks. And with the Apron card, your team can spend easily while you stay in control. With spend limits, auto receipts, chasing and full visibility, every purchase earns rewards you can turn into cash back or gift cards. It's free to get started and built for small businesses. Learn more@getapron.com.",
      "start": 1708310,
      "end": 1741670,
      "confidence": 0.98312217
    }
  ],
  "chapters": [
    {
      "summary": "With Apron bill pay, you can manage all your supplier payments in one place. With spend limits, auto receipts, chasing and full visibility, every purchase earns rewards you can turn into cash back or gift cards. Free to get started in built for small businesses.",
      "gist": "Small Business Credit Card",
      "headline": "Running a hotel means juggling endless payments and expenses from suppliers to staff",
      "start": 1840,
      "end": 35040
    },
    {
      "summary": "Checking In is a weekly podcast from hotel owner, the UK's trusted source of hotel industry news and analysis. This week we speak to Anna Corkill, Regional vice president, development UK and Ireland at Hyatt. Anna talks about Hyatt's plans to grow its UK portfolio by over 30%.",
      "gist": "Checking In",
      "headline": "Checking In is a weekly podcast from hotel owner covering hotel news and analysis",
      "start": 43600,
      "end": 109100
    },
    {
      "summary": "I trained as a chartered surveyor doing developments in the West End of London. Then moved on a bit by accident working with PKF in their hotel consulting. Also met Felicity Black Roberts, which we're also now working together at Hyatt. It's been amazing and it's. Wonderful.",
      "gist": "Coming soon: The Hyatt Experience",
      "headline": "Can you tell us a bit about your career journey prior to Hyatt",
      "start": 109340,
      "end": 250790
    },
    {
      "summary": "The biggest learning is that people do business with people they like and trust. partnerships really do shape, you know, where I am today and what our business is. What were some of the other important or standout lessons you took from these previous roles?",
      "gist": "Honorary Director: Development and Partnership",
      "headline": "Were there any standout learnings that you took from previous roles that prove useful today",
      "start": 251830,
      "end": 351540
    },
    {
      "summary": "I am looking after the UK and Ireland for their growth. Since 2017, we've doubled our portfolio in size. Plans are that it sees the portfolio grow by more than 30% by 2026.",
      "gist": "A Hyatt Place opening in London",
      "headline": "I am looking after the UK and Ireland for Hyatt's growth",
      "start": 352180,
      "end": 415350
    },
    {
      "summary": "Hyatt really realized that we've got a great presence in London, but we really wanted to push the presence outside of London as well. UK is a really good feeder market for our other markets in Europe. We really do want to concentrate on the Oxfords, the Cambridges, Newcastle, Glasgow, Cardiff.",
      "gist": "Hyatt Hotels' UK Expansion",
      "headline": "Hyatt is expanding outside of London, looking at secondary cities across Europe",
      "start": 416150,
      "end": 480920
    },
    {
      "summary": "We're really trying to push these secondary cities and look to expand in those areas. All the brands that we're looking at to really expand in the UK for Hyatt lifestyle and limited services brands are, are exceptional. But on the flip side we're really seeing a big push also in the luxury market as well.",
      "gist": "Are You Looking to Expand Your Hyatt Presence in the UK?",
      "headline": "Hyatt is looking to expand in secondary cities outside London",
      "start": 481480,
      "end": 623710
    },
    {
      "summary": "The younger crowd was behind the rising popularity of lifestyle. People want to explore and they want something a bit different. Travel is coming back slowly, but it's coming back. And that's promising in of itself.",
      "gist": "The rise in popularity of lifestyle hotels",
      "headline": "I was wondering if younger crowd was behind rising popularity of lifestyle",
      "start": 623710,
      "end": 733580
    },
    {
      "summary": "The UK is a cornerstone for Hyatt's Europe development for the whole region. We continue to lead the industry in net room growth by 8% year on year. Our strategy really reflects the philosophy that drives our global expansion as well.",
      "gist": "How Hyatt's UK Growth Strategy Affects Europe",
      "headline": "How does Hyatt's UK growth strategy align with wider European strategy",
      "start": 734860,
      "end": 795010
    },
    {
      "summary": "The current market at the moment, leisure travel still Remains strong, short breaks, staycations. There's that mixture of leisure and business pleasure. Do you think, speaking of the budget, will that flexibility hold higher in good stead?",
      "gist": "Hospitality sector outlook",
      "headline": "The UK hotel development market remains strong, leisure travel still Remains strong",
      "start": 795890,
      "end": 942330
    },
    {
      "summary": "I think you've got to give that responsiveness. Yes, cost elements are difficult and cost and financing at the moment is a challenge. But if you secure the right sites with the right partners, you will be in that position to be able to move forward.",
      "gist": "The Challenges of the Construction Industry",
      "headline": "I guess for others listening, what would your advice be for preparing for these changes",
      "start": 944090,
      "end": 1003360
    },
    {
      "summary": "What types of brands do you think are performing best? And in general, which segments are you excited about? I still think the luxury market is still very strong.",
      "gist": "Hyatt Hotels UK sales outlook",
      "headline": "Looking at the state of the market right now, what types of brands are performing best",
      "start": 1003600,
      "end": 1108180
    },
    {
      "summary": "I still think the commercial travel is still there. There are meetings and conferences still happening. As the young travelers as well, people are traveling more for entertainment. What audiences do you think hoteliers should keep in mind when capturing business going forward?",
      "gist": "Hyatt Hotels' outlook for business travelers",
      "headline": "I still think commercial travel is still there. There are meetings and conferences still happening",
      "start": 1109220,
      "end": 1176830
    },
    {
      "summary": "Third party operator owners are wanting a bit more flexibility. Majority of hotel owned brands are really very much down to management and franchise. Looking ahead, what major shifts do you anticipate in terms of hotel ownership and management structures?",
      "gist": "Looking Ahead: Hotel Owners and Management Structures",
      "headline": "Looking ahead, what major shifts do you anticipate in hotel ownership and management structures",
      "start": 1177790,
      "end": 1271440
    },
    {
      "summary": "The driving force behind Hyatt's growth is all down to relationships and partnerships. Putting the wrong hotel in the wrong location doesn't really work for us either. How do you identify who the best partners are for hire?",
      "gist": "Hyatt Hotels' Partnership Principles",
      "headline": "Hyatt says it is all down to relationships and partnerships",
      "start": 1271840,
      "end": 1357970
    },
    {
      "summary": "Is it a matter of transparency and communication? What would you say is the key? It's a trust element, but it's also very data driven as well. Having that unifying goal is having that North Star is. Key.",
      "gist": "The Swiss Franchise Network's",
      "headline": "Transparency and communication key to maintaining positive relationship with franchisees",
      "start": 1358530,
      "end": 1422200
    },
    {
      "summary": "Hyatt cares for its guests as well as its owners and employees. If the guests are happy, then it helps the owner on the bottom line. It's been proven good guest satisfaction scores do push your revpar. Wonderful to see those tangible results reflected.",
      "gist": "Hyatt's Commitment to Guest Satisfaction",
      "headline": "Good guest satisfaction scores do push your revpar, says Hyatt CEO",
      "start": 1422440,
      "end": 1498510
    },
    {
      "summary": "What are you most excited about for Hyatt on the horizon? I'm excited about the Hyatt Regency Olympia opening next year. We've got a very collaborative team. We all work very well together. Fingers crossed that some of them get across the line before end of the year.",
      "gist": "A Hyatt Regency London interview",
      "headline": "Small team working well together is what makes Hyatt so successful",
      "start": 1499070,
      "end": 1595380
    },
    {
      "summary": "Always be responsive people ring you for a reason. Just ring them back. Don't send them an email if they've rung you just give them a call back. Wonderful advice and one that transpires all. careers and life paths.",
      "gist": "Employee Feedback",
      "headline": "Always be responsive people ring you for a reason, says James Cohen",
      "start": 1595380,
      "end": 1647900
    },
    {
      "summary": "Checking In is a weekly podcast from hotel owner, the UK's trusted source of hotel industry news and analysis. If you're interested in sponsoring episodes of the podcast, drop us a line@ podcastotelowner. co. uk.",
      "gist": "Checking In",
      "headline": "Anna, thank you so much for joining us on Checking In",
      "start": 1648300,
      "end": 1699990
    },
    {
      "summary": "With Apron bill pay, you can manage all your supplier payments in one place. With spend limits, auto receipts, chasing and full visibility, every purchase earns rewards you can turn into cash back or gift cards. Free to get started and built for small businesses.",
      "gist": "Small Business Credit Cards",
      "headline": "With Apron bill pay, you manage all your supplier payments in one place",
      "start": 1708310,
      "end": 1741670
    }
  ]
}