{
  "episode": {
    "title": "From Ops to HR: Natalia Dainty on Building Learning That Truly Sticks",
    "guest": "Natalia Dainty, L&D Manager at Valor Hospitality",
    "date": "2025-12-05",
    "duration": "44:16",
    "focus": "Training programs, mental health, staff development"
  },
  "transcription": {
    "text": "Foreign. Welcome to Checking In, a weekly podcast from hotel owner, the UK's trusted source of hotel news and analysis. Each week we meet with seasoned hoteliers, industry insiders and hospitality entrepreneurs to share the real stories, lessons and ideas behind what makes great hospitality work. We'll unpack the decisions behind the success stories, the mistakes that shape them, and what you can learn from their experience. If you like the podcast, make sure to subscribe on your podcast platform of choice and for more information, visit hotelowner.co.uk or drop us a line at podcastotelowner.co.uk hi, I'm Heather, host of this episode where we speak to Natalia Dainty, learning and development manager at Valor Hospitality. I'm going to start that again. Hi, I'm Heather, host of this episode where we speak to Natalia Dainty, learning and development manager at Valor Hospitality. Natalia spoke about her journey from operations to HR and beyond, offers insights into how Valor's training programs support every individual's unique learning styles and her pioneering mental health first aider initiative and the impact it's having across valo. Hi Natalia, thank you so much for joining us and welcome to Checking in. It's my pleasure. Lovely to meet you. So yeah, to kick us off, can you tell us a little bit about your own career journey in hospitality and what attracted you to the industry in the first place? Of course, yeah. Gosh, it's been quite a long time. My parents were in the hotel industry so when I was born at a small age they had a bed and breakfast, then they went into larger hotels. So I think it was probably inevitable that I was going to go into the industry. I started at the bottom after going to college and university and just fell in love with it. I've been around people all of my life and I can't think of not being around people and being able to, whether it be from a guest perspective, help guests. In my early years, so I was all operational restaurant based, then into reception and then through to management, operations manager and then transferred my skills and thought okay, what can I do next? And that's where I came into the world of human resources. So yeah, the passion has always been there. I think having somebody like my mum and my dad as big figures in my life, I would always look up to them and see what they were doing and seeing how it affected other people. So it was always inevitable that I would follow suit. Yeah. And wonderful to have that hands on experience and that close perspective from a young age. Are there any sort of lessons in particular that your parents bestowed on you, do you think? Looking back at that time a lot, really? I think for me, resilience is key. You know, life in general isn't easy. Working in the hospitality industry is constant. You know, we never close and every day is very different. And I think that's what anybody who works in hospitality and who's passionate about it, I think that's what thrives, that's what makes it interesting. No two days are similar. You will have challenges and you know, being able to bounce back from all of the challenges that that brings, whether it be equipment based, whether it be people based, that's, that's really key. And I think parent wise, they always taught me, you know, whatever you want to do, you can do it. You just need to try your best, give it your all and, you know, strive for what it is that you really want to do. Yeah, yeah. Wonderful. And you know, so true what you say about, you know, no two days being the same. And it's something we hear a lot from people. It's that thrill and the kind of the yearning to figure out, okay, how do I solve this problem and put out this fire? And yeah, it's wonderful and just the heart of hospitality, isn't it? And yeah. So I know you spent time in operations. What led to that pivot then into the HR world? Was that just a natural progression or was it had something about it piqued your interest? What led to that? I think I'd been an operations manager for many years, probably about 12, 15, and my natural progression was to become a general manager. And that's what all my development was aimed at. And I think from a personal term we decided myself and husband to adopt our daughter who's now 11. And I think that was a journey. It was a big year for us. Took a year out on adoption leave and just reassessed what it was that I wanted to do. And I don't think it was right for me, my family and also my work for me to then go back, try and be a general manager because I wouldn't be able to give it my 110% due to work hours. You know, for me there was a reason why we wanted a family and I needed to be able to be there at weekends, at evenings. And being a hotel general manager, you're definitely not really at home a lot at know, evenings and weekends. So I just reassessed where I could transfer my skills to. And being an operations manager, for me it was all about working with people. So whether that be guests or whether it be Team members. And I thought, okay, where can I transfer my skills? And I thought, well, I really enjoy seeing people progress, seeing people develop from a team perspective and seeing them go on to different things, whether they be within our industry or whether they be outside of the industry. And that's when I thought, okay, let's try hr. It was hard at first because it is very different to operations. Being an ops manager, you're in control of a lot of people working in hr. You're working alongside and supporting people and it is very different. So it took a good six months, I think, to get my head into being within HR and then just went on from single site HR to an area people and culture manager and now as a specialist in learning. So, you know, since COVID a lot has changed, but I've been in my current role for about 20 months and learning and development for me within the whole people and culture is what I love. I love being able to facilitate some great conversations around people, being able to learn and just seeing them absorb that information and then do something with it and then go on to different roles, whether it be, you know, in the same hotel or in our different hotels. Hotels is. Is where I find my passion. Yeah, yeah. Incredibly rewarding and I'd love to dig more into that. And just going back to. I was going to ask about, you know, the adjustment obviously from going from operations into hr. What sort of, what transferable skills in particular do you think are extra beneficial in the HR world that you gained from. From operations and having that perspective? I think it's key. And if I look at the team that I work in there, actually quite a few of us that have worked in operations before coming into hr and you understand the hotels because you've been there, you've seen it firsthand, you've been in the operation, so you understand the constraints that hotels have. As I said before, we never close, so it is Constant. We're a 247 operation. So you need to be realistic at what demands they have. You need to be realistic at what's happening in the hotels, looking at their busy periods. And for me to land some training and development in, for example, the middle of December, it just wouldn't. It wouldn't land because for us that's a very busy period. So you need to have an understanding of what's going on in the hotels and being able to support them when they need it. Yeah. Would you say, in a way as well, it helps on a sort of trust level that you know, the people you're working with understand that you have understood. Very much so. Very much so. It gives you more credibility because you've, you've been in their shoes, you understand and you know, whether you've been within the restaurant or front office and then as an operations manager, they understand that you've been there, you've gone through what journey that they're going through. So you can help them come through it. Yeah, yeah. It's not something you can really read in a book and to understand. Baptism by fire. Brilliant. Well, yes. On to present day, can you. Yeah. Tell us how you came to your current role as a learning and development manager at Valor and what your responsibilities are. Of course. Yeah. So I was a generalist within HR and my passion was always the learning development. So I'm quite an outgoing person. I like to talk, I like to get involved with people and, and see people develop skills, whether that be specifically related to their job role or whether it be just general life skills. Within the hospitality industry, you get a lot of younger people join and you see them flourish, you see their confidence come. And I don't think there's many industries that give that. So within learning and development, I think there's lots of different things that I'm responsible for. You can look at the onboarding side of it. So when team members join us, we need to make sure that they get off to a right start and we're giving them the skills that they need to be able to do their job brilliantly. So that's from when team members join us and then we have all of the compliance training that sometimes isn't as exciting as the developmental training that I focus on. So a big part of my role is looking at how we can progress our team members with us. So looking at succession planning, looking at how we can grow our own talent and how we can nurture that. So looking at, for example, this year we have different development programs in place for supervisors, managers at hotel level, senior managers and then general managers. I think this year we had around about 250 people go through that. And then when we look at internal promotions, for us it's really important to try and grow our own and really invest in people's development and seeing where they want to go to on the next level. So yeah, it's a wide, varied role. Yeah, yeah, but wonderful. And when it comes to, when you, you know, have a team of individuals, how do you approach identifying what learning techniques are best of them, what they can offer in what ways you can best help them? What is your sort of Step by step approach when it comes to seeing that person and seeing where they can go and how you'll help them get there. I think it all starts with an authentic career conversation. So we change the way that we do the typical appraisals within our business and we call them a valor check in now. So that whole process is led by the team member. And I think historically if you think of a performance review or an appraisal, it was always led by the manager. So we've turned it on its head and we, we allow the team members to lead that conversation. I think development and progression within our industry has changed. It used to be very traditional. So you used to go from a team member to a supervisor to assistant manager, where now people are looking at, okay, how can I go cross departments? How can I go at different levels rather than that traditional approach? So it's based on what the team member wants rather than what we want. By having an authentic conversation and really listening to your team, you can then plot the development that they're looking for and it might be that the manager will decide, okay, actually there's some development that I think that would be great for you. What do you think about it? But if the team member's not signed up for that, then there's no real point. They need to be passionate about what they want to do. Everybody learns in, in very different ways. So we need to be led by the team member rather than us leading them through that process. Yeah, I was going to ask about that because I'm sure, you know, with every individual it's different with how much they come to you with and how much you sort of work to identify the potential within them. So yeah, how do you strike that balance? Is it just intuition and just having these conversations and does it vary? It does vary by, by person. It really depends what their, their passion is. If they have got, you know, a goal that they want to strive to, if they've got a role that they need, you know, they want to get to, then we will work with them to get to them to get that role. Sometimes people don't see their own potential and if they don't, then that's their manager's role to, to identify that and then give them some feedback and say, you know, have you thought about this? You've got some excellent skills around X, Y and Z. We think that you'd be great for this role. What are your thoughts? So it is two way, but it really needs to come from the team member first. We don't just focus on traditional work skills. So we do focus around leadership skills and how they can do their job brilliantly, but we always wear focus on some of the softer skills as well. So whether that be things that they can use outside of work, whether that could be resilience, dealing with difficult people, so their life skills, as well as relating to the job as well. Yeah, and that's wonderful to hear. You know, this sort of more modern approach. I know you mentioned in the past it was quite linear. Very much so, yeah. Slightly boxed in, but wonderful to give them that freedom. And yeah, I think, like you say, sometimes it's hard for a person to step outside themselves and, and see what their potential is. So, yeah, it's fantastic to have those conversations. And I know we touched briefly on, you know, part of your role is helping with onboarding earlier and I just wanted to ask a little bit more about Valor's approach to that, you know, as well as having these conversations and what is your approach to sort of successfully onboarding new team members who are perhaps new to the group and even new to hospitality? It's all about being open and honest and I think if somebody is joining the hospitality industry at entry level and potentially haven't had any exposure, it can be a little bit daunting sometimes. So it's about before day one, making sure that we're reaching out to the team members and communicating with them and saying, okay, when you arrive, this is who you're going to be speaking to. So just be reassuring them before they. They step through the door. So it's about that communication before they start on day one. Day one, it's all about a really positive welcome, introducing them to the team at the hotel, making sure they understand everything that they need to. First and foremost, they understand us, what we're about, so understanding our values as a company and what, what they've signed up for and just really welcome into that hotel team and to our company as a whole, really making sure that they've got everything that they need to do their job, whether that be uniform, whether that be any training that they need to do, but really making sure that we don't overload them on that day one, because there is an awful lot that people will need to know. But looking at the onboarding process, we have an onboarding process that will last over three months. So we'll drip training into week one, week four, week, week eight, rather than just hitting it all, all on day one. Yeah, yeah, of course, yeah. It's the best way to take things in, isn't it? And again, sort of beyond the onboarding process, when you get to know these team members, what are some identifying signs just in your opinion, that someone has the potential to be a great future leader in hospitality? Are there any early signs? Is it just a matter of passion and what sort of things do you look out for? Passion is, is definitely one, but somebody taking the initiative, somebody that is curious so asking questions, you know, why are we doing this? Tell me more. Somebody that's inquisitive and somebody that you can see, you know, is helping other people and is, it's just for us it's all about being curious. So you can see it quite easily. And so I also, I wanted to ask you what role technology plays in learning and development. I know this is something you also work with. So how does Fallow employ that when it comes to kind of all aspects of somebody's learning journey with them? Technology is big within with any learning and development role. Like I have alluded to before, people learn in different ways. So gone are the days where, you know, we can look at taking people out of the business, say for example, for a full day and doing some form of face to face training. We need to make sure that we're looking at what else is out there. So whether that be looking at bite size learning, so whether it be micro learning, we have an LMS platform that we have lots of our compliance training on. But what we've tried hard to do in the last year is look at how we can use that for some bite size learning, whether that be around leadership skills, communication skills, teamwork, but also the softer skills. So we have a lot of resources on there around, well being. One of the most popular downloaded resources is actually the Adult Sleep book. I know that I've definitely downloaded it and referred to it myself a few times. And then when we're delivering trainers, you know, how can we make it engaging? How can we make sure that that learning sticks? You know, gone are the days where you just have, whether it be slides with words and words and words on, you know, how you're getting your learners engaged, how they're interacting and how they're sharing some of their experiences. We've done quite a lot of training over the last 12 months around belonging at Valor, so around diversity, equity and inclusion. And the learning that has really come out of that is from the team members sharing stories and sharing past experiences. I think there's a lot in there of how we learn from each other. So yeah, so technology, you know, whether that be different apps around micro learning, whether you use quizzes, whether you use videos, podcasts, for example, you know, people's brains will work in different ways. So we need to make sure that we're trying to cater for, for everybody. Yeah, yeah. I was going to ask if there was a sort of optimum balance between the tech side and the sort of human conversational side, but it sounds like people are sort of afforded the flexibility to, to choose their own best. Most definitely, I think with some of our compliance training, so anything relating to legislation, you know, we need to make sure that it is standardized and it's recognized by a certain body. But anything developmental wise, I think if you can try and reach out to as many different learning styles, it's hard for operators to stop and not be on their feet and not serve. So trying to engage their attention, whether it be for 60 minutes, 90 minutes or for six hours, we need to think differently because people that are operators aren't designed just to sit in, you know, some form of training room or whether it be on a virtual session, it's not their go to. So we have to try and try and use all the tricks of the trade. Yeah, yeah. And I guess on that note, sort of thinking about where tech can develop in this area, does that lie best then, do you think with things like apps more on the go things, how do you see that sort of developing? Do you think more hospitality groups will sort of take that same approach as well? Yeah, I think time is, is key for us and I think something that I've been looking into over the last couple of months and we'll be focusing quite heavily on, on next year is, is how we look at the micro learning a lot more and how we can condense it. Because I think just in general in life, people don't have buckets of time and everything is instant. So, you know, if we want to know anything, we just get our phones out and we'll, we'll Google it, we'll search it and everything is there. So if we're looking at learning, people want it short, they want it snappy and they want it engaging. So I think, you know, from a tech point of view, anything that will help you condense things and get a real clear message out there is, is key for the, the years to come. Yeah, absolutely. And, and how do, how do you measure the success of these approaches and see how, how it sort of resonates? Is it a matter of feedback? Do you just sort of see the results in, in the sort of operations higher up? How do you Sort of, you know, look at those metrics and understand how it works. You can see them, but you can measure them as well. So if bite sized content, for example, that we have on our platform, we can see how many people have downloaded it, how many people have interacted with it. When we're hosting live virtual sessions, we always generate feedback afterwards. So we'll analyze that and also just ask the question. So if we've focused on for example a session around building resilience, go back to the hotels and speak to the general managers and say, you know, okay, what, what other feedback did you have? Have you seen anything different? And then look at how we can really embed that. So it's, it's one thing running a course and somebody will, you know, join the course for, for 90 minutes. It's what we need to think about, what are they going to do with those skills gained and how can we really make that stick? So you, you know, making sure that we check in four weeks after they've done an event and said, you know, hope you really attended. Have you looked at these tips and refer it back? So they think, okay, yes, I need to bring that to the forefront of my mind. So yeah, feedback is really key and I think, you know, we're a very authentic and honest company. If things aren't right, then it's a safe environment to say actually, you know, maybe we could change things. But I think speaking to the general managers, the operations managers or the attendees saying okay, how was it and what's next? What else can we do to support you? Be the best version of you. Yeah, wonderful. And, and you know, fantastic. It's a safe space where yeah, people can give that feedback and, and yeah, help, help the group sort of grow together. And like, you know, I suppose like we say with individuals, it's, everyone has their own ways of learning. But yeah. Has there been a part of Valor's approach that you've seen particularly resonate with, with people? And have there been any trends? I, I imagine perhaps, you know, for Gen Z or younger people for example, there's quite a lot of engagement with this micro learning. Yeah, yeah. I think like I said before, the main focus for me this year since, since summer so August was we want to do development. As with any business, there's a lot of cost constraints this year but we need to develop our people. We're very passionate about that internal succession planning and that internal growth. So we needed to look at how can we do this differently. So we went on a bit of a journey and Introduced virtual live, virtual sessions, which was new for us. A lot of our training was always face to face, so taking it on to, you know, a platform, whether it be teams or. Or zoom, was. Was different. But for us, we've had really great success. I think we've done four different topics and we have 37 hotels in the UK and being able to reach people from, from, you know, from Plymouth and Southampton all the way up to St Andrews in Scotland is massive. So it brings different, not only different job roles, different generations for 90 minutes that we wouldn't have been able to reach those people if we would have been doing it face to face. So I think continually, and looking at how we improve that for next year and be able to reach more people is really key. Yeah, fantastic. And we've touched on it slightly, I guess, in terms of, you know, time and cost constraints that we've just mentioned. I was going to ask you, sort of in a wider sense, what you see as the current biggest challenges for learning and development, in a general sense, for the industry, and what would your advice be for navigating these? Currently, I've just mentioned the time and I think with our industry, you can't just close and say, okay, we're gonna do some training for an hour because we are 24 7, so that time is 1. But I think what we really need to do is focus on what it is that that person needs and let them lead their development, rather than us having a blanket approach across everybody and saying, okay, we're going to train everybody with this skill. If you have somebody attend training and they're not passionate about that subject or their heart's not in it or they don't really want to be there, you can tell. And that will affect the group dynamic. So look at what the team want and then make sure that you have some development in place that will get them to their ultimate goal. Yeah, yeah, great advice. And so pivoting away slightly, I also. I understand you're a lead for mental health first aiders. Yeah. So I wanted to ask you a bit about that. What inspired this? And yeah, can you tell us more about the work you do with. With the side of. Of course, yeah. It's been quite a. Quite a long journey. It was pre Covid. Now, I want to say around about 2018, mental health and general well being is something that I've always been passionate about. I've had people affected with poor mental health around me and it was when I was working closely with the general manager and his brother, unfortunately committed Suicide and seeing him go through that horrendous journey just spearheaded both of us to say, okay, what can we do to improve well being? How can we as leaders within the business get a, get our culture around wellbeing? So we went on a bit of a journey. I went and became a mental health first aider myself and again at that time it wasn't widely spoken about within our industry and me going on that there was, okay, well you know what, what's going to happen? So I said, well let me, let me become a mental health first aid and let's review it. So that then took us on a journey where we presented to the leadership team this is what we feel should be our policy. We got buy in from the whole leadership team. Then we went on and said, okay, we need to have a mental health first aider in each of our hotels. So we became that. We spearheaded a bit of an initiative that we used to call Wellbeing Wednesdays. So every Wednesday all of our hotels used to do something around wellbeing, whether it be walking clubs, yoga, healthy food and I think really over the last, you know, eight, nine years we've just gone on from strength to strength and I think now we currently have over 80 mental health first aiders across our hotels in central teams. We have well being champions in all of our hotels that meet virtually once a quarter to discuss and plan, okay, what are we doing around wellbeing? How can we expand on knowledge? How can we support the team? So yeah, it's been a really great journey. Really very rewarding seeing from where we've come to where we are now, where wellbeing is just part of our day to day. Yeah, yeah, it's, it's almost funny to think that it just wasn't a part of these conversations. What, why do you think that was the case and, and was Covid a sort of kick starting point or what do you think brought about this, this change in the industry? I think I can see it now in the last say five years that you know, it's a lot of it is out there and I think generally people are talking about mental health and people are talking about well being so that that helps. It just takes somebody who's passionate that to stop and think, okay, what can we do and what can we focus? And you know I will see different hotel companies now having, you know, their well being policies. But you know, when we were talking about this as a company it wasn't widely out there and you know, I would like to think that we were one of the first management companies within hospitality to really spearhead it, I think. And thankfully generally people talk about mental health quite commonly now, which is, which has helped. Yeah, yeah, wonderful. Yeah. What a brilliant thing to be a pioneer of. That's, that's incredible. And I guess what, what would your advice be to you know, hoteliers listening who, who want to, you know, strengthen their own well being initiatives within their operations, Perhaps don't know where to start. Do you think a similar plan as to valor. What would you advise be for them? Yeah, I would start. Start small, get people understanding why it's important. You know, we, everybody has mental health. Whether it be great mental health, whether some days it isn't great and acknowledging that no matter who you are, we will all have poor mental health at one point and we will deal with it differently. So I think being open and honest and saying, you know, nothing is going to go away. Gone are the days where, you know, years ago in the industry used to, okay, you know, when you come into work you leave all your problems at the back door type of thing. And you know, I remember 15 years ago and you know, people saying that to me and thankfully those days are gone. People will have problems and it's important as an employer that we recognize our team members will go through struggles. So what can we do to support them? Whether that be from a mental health point of view, whether that be financial, whether that be just healthy eating, whether it be exercise. There's lots of things that we can do to acknowledge. But I think the main thing, and it's a very simple thing that really doesn't cost anything, is just listening and just really listening to people non judgmentally. We don't have all of the answers and we can't fix people, but we can listen and then signpost our team members to support that they, that they need. You know, we, we can't just fix all of the problems but by listening to people and just asking those questions, you know, how are you? But then asking them again because you know, it's like when you say to somebody, are you, you know, how are you? And somebody will say okay, that's everybody's first response. But what we should be doing is asking them, are you really okay? And then that usually makes people stop and say, well actually I'm not having a great day. Okay, let's talk about it. Do you want to talk about it and really listening to your team? Yeah, yeah, I guess as well. Sort of having that intuition of understanding that there is something there that you can Just be there as a support. Yeah, you know, your team members, you see them day in, day out. And I think, you know, what we say to manage is, you know your team more than anything and you spend a lot of time with them. So if they're not their usual self, there is a reason. So just, just broach that subject. Just say, you know, how are things? How are you doing? And then take it from there. Yeah, wonderful. And I imagine it's resonated very well at Velur. Yeah, very much so, yeah. Brilliant. Again, coming back to sort of creating that environment of trust and support is crucial. So, yeah, that's really wonderful. So I guess, sort of, you know, looking back at, you know, learning and development in a wider sense and people development, how. What changes do you think you'd like to see in the hospitality industry in the coming years in this area? How do you think the industry can continue to evolve so it supports its people in the best way? And I think, like I've alluded to before is treatment the team members as individuals. So really see what it is that they want to do. And gone are those, like we talked about before, gone are those as traditional linear development pathways. Some people, you know, can refer to it as like squiggly pathways. You know, if I look at myself, you know, my natural progression from operations manager was to become a general manager and, you know, that wasn't right for me, you know, so the company developed me into what I wanted to do and, you know, they listened to me and that's what within a hospitality industry we need to do. You know, it's not, if you look at general managers, for example, it used to be always that we would get our general managers from a food and beverage background. You know, we've got great general managers in our company from front office background, from finance background. So it's really honing into, okay, what does that individual want to do? And let's help them get there. It might be that we have team members that are only with us for two or three years while they're at university because they want to go on and study something totally outside of our industry. That is absolutely fine. But let's make sure that they have, you know, those three years are absolutely great working for us and they'll get some different skills that they can use throughout their life. Yeah, absolutely. I think, you know, hospitality is such a wonderful industry for those transferable, definitely. And, and yeah, and for those that love the industry, it will be wonderful to see how the sort of leaders of tomorrow develop with that support behind them. Brilliant. I and I know we've touched on this earlier at the start of the episode, but just to finish off, what are you excited about for the next stages of Valor's learning and development journey? Okay. I think it's building on what we've done this year. So like I said before, we've had four different sessions from a virtual training point of view and we were unsure how they were going to land. They've landed really well. Looking at the feedback, people have said that they're really easy to fit into their day. They found them engaging. So it's really building on that and having a great program for 2026, but also looking at, you know, I mentioned before about the whole micro learning, so how we can use that across all of our hotels to really embed the learning. I think we need to make sure that the learning sticks. So 2026 for us will be looking at. Okay, how can we do that? How can we really get great team members? I've forgotten what I was going to say. And finally. Yes. What's next for Valor's learning and development strategy that you're excited about? So it's building on the success that we've had this year around our virtual training sessions. So let's really get a great programming for 2026. Taking. Taking all the feedback from our current courses and also taking feedback from the hotels. I think another thing that I'm really excited for next year is looking at how we can improve that knowledge retention of the learning, whether we use some different technologies, so whether it be bite size learning, whether it be some flip books with some videos. And another thing that we literally just about to launch in the new year is our ILM Level five. So this is aimed at senior hotel and central managers that they'll be able to do an apprenticeship and come out with an ILM Level 5 qualification at the end of it. So we've literally this week hosted a call and gave all of the information out and we're looking for nominations. So we look to have a cohort start in January next year. So let's see how that goes and then see how we can filter it down and see if we can potentially then go to level three. So trying to do something a little bit different for next year. Yeah, brilliant. Well, yeah, all the best with that. That sounds wonderful. Thank you. And finally, Natalia. We finish each episode with a question left by the last guest. Our previous guest was Henry Matson from Apron, which is an invoicing platform for hotels. He asked, well, he kindly left you with two questions, the first being what is your biggest headache in hospitality at Christmas time? And what tech or a bit of software do you wish was available to deal with this? Gosh, biggest headache within general hospitality or within L and D? I suppose within L and D, from your own perspective. Okay. I think the operators are probably going to hate my answer to this because when the hotels are very, very busy at Christmas, then we tend to step back and to leave them a little bit. So for me, I'm actually, I have two weeks off over Christmas, so the operators are definitely going to hate me for that. But I think I really use December as a time to. To review. Our hotels are very, very busy, you know, with, with party nights galore happening and people really enjoying the festive period. So within my role, it's a time to review. Okay, what's this year been like within L and D? What are we going to hit the ground running in. In January? So I don't think there's any technology. It's just me having time to. To review and then plan is. Is really helpful. So it's a little bit of a down time and then plan for the next year ahead. Yeah, yeah. And, well, again, on the Christmas note, his second question was, what bottle of wine would you like to be opening on Christmas Day? Oh, that one's much easier for me. It's probably going to be a nice Sauvignon Blanc. Nice Marlborough to New Zealand. Yeah. Nicely chilled, asked to be very chilled. Lovely. So, yeah, lovely. Well, yeah, enjoy that when it comes. I will. And finally, Natalia, do you have a question to leave our next guest? Be really keen to know how your next guest uses AI within the world of L and D within their organization. It's something that is very topical. It's something that we're all looking at. So, yeah, I'll be really keen to know how they. How are they using it to. To influence L and D. Yeah, it. Will be interesting to hear their answer. Yeah, we'll pass it on. Natalia, thank you so much for joining us. It's a pleasure. Lovely chatting. Thanks for listening to Checking In, a weekly podcast from hotel owner, the UK's trusted source of hotel industry news and analysis. If you like the podcast, make sure to subscribe on whichever podcast platform you listen to. To get more industry Insight, head to hotelowner.co.uk and subscribe for unlimited access. If you're interested in sponsoring episodes of the podcast, drop us a line at podcastotelowner.co.uk.",
    "words": 7002,
    "confidence": 0.9748504,
    "audio_duration": 2657
  },
  "utterances": [
    {
      "speaker": "A",
      "text": "Foreign.",
      "start": 240,
      "end": 480,
      "confidence": 0.65283203
    },
    {
      "speaker": "B",
      "text": "Welcome to Checking In, a weekly podcast from hotel owner, the UK's trusted source of hotel news and analysis. Each week we meet with seasoned hoteliers, industry insiders and hospitality entrepreneurs to share the real stories, lessons and ideas behind what makes great hospitality work. We'll unpack the decisions behind the success stories, the mistakes that shape them, and what you can learn from their experience. If you like the podcast, make sure to subscribe on your podcast platform of choice and for more information, visit hotelowner.co.uk or drop us a line at podcastotelowner.co.uk hi, I'm Heather, host of this episode where we speak to Natalia Dainty, learning and development manager at Valor Hospitality. I'm going to start that again. Hi, I'm Heather, host of this episode where we speak to Natalia Dainty, learning and development manager at Valor Hospitality. Natalia spoke about her journey from operations to HR and beyond, offers insights into how Valor's training programs support every individual's unique learning styles and her pioneering mental health first aider initiative and the impact it's having across valo. Hi Natalia, thank you so much for joining us and welcome to Checking in.",
      "start": 6720,
      "end": 85370,
      "confidence": 0.9803346
    },
    {
      "speaker": "A",
      "text": "It's my pleasure. Lovely to meet you.",
      "start": 85370,
      "end": 86930,
      "confidence": 0.98733956
    },
    {
      "speaker": "B",
      "text": "So yeah, to kick us off, can you tell us a little bit about your own career journey in hospitality and what attracted you to the industry in the first place?",
      "start": 88080,
      "end": 97760,
      "confidence": 0.99560547
    },
    {
      "speaker": "A",
      "text": "Of course, yeah. Gosh, it's been quite a long time. My parents were in the hotel industry so when I was born at a small age they had a bed and breakfast, then they went into larger hotels. So I think it was probably inevitable that I was going to go into the industry. I started at the bottom after going to college and university and just fell in love with it. I've been around people all of my life and I can't think of not being around people and being able to, whether it be from a guest perspective, help guests. In my early years, so I was all operational restaurant based, then into reception and then through to management, operations manager and then transferred my skills and thought okay, what can I do next? And that's where I came into the world of human resources. So yeah, the passion has always been there. I think having somebody like my mum and my dad as big figures in my life, I would always look up to them and see what they were doing and seeing how it affected other people. So it was always inevitable that I would follow suit.",
      "start": 97840,
      "end": 167890,
      "confidence": 0.9808254
    },
    {
      "speaker": "B",
      "text": "Yeah. And wonderful to have that hands on experience and that close perspective from a young age. Are there any sort of lessons in particular that your parents bestowed on you, do you think?",
      "start": 168380,
      "end": 183860,
      "confidence": 0.9669967
    },
    {
      "speaker": "A",
      "text": "Looking back at that time a lot, really? I think for me, resilience is key. You know, life in general isn't easy. Working in the hospitality industry is constant. You know, we never close and every day is very different. And I think that's what anybody who works in hospitality and who's passionate about it, I think that's what thrives, that's what makes it interesting. No two days are similar. You will have challenges and you know, being able to bounce back from all of the challenges that that brings, whether it be equipment based, whether it be people based, that's, that's really key. And I think parent wise, they always taught me, you know, whatever you want to do, you can do it. You just need to try your best, give it your all and, you know, strive for what it is that you really want to do.",
      "start": 183860,
      "end": 245030,
      "confidence": 0.97303694
    },
    {
      "speaker": "B",
      "text": "Yeah, yeah. Wonderful. And you know, so true what you say about, you know, no two days being the same. And it's something we hear a lot from people. It's that thrill and the kind of the yearning to figure out, okay, how do I solve this problem and put out this fire? And yeah, it's wonderful and just the heart of hospitality, isn't it? And yeah. So I know you spent time in operations. What led to that pivot then into the HR world? Was that just a natural progression or was it had something about it piqued your interest? What led to that?",
      "start": 245190,
      "end": 277840,
      "confidence": 0.9672607
    },
    {
      "speaker": "A",
      "text": "I think I'd been an operations manager for many years, probably about 12, 15, and my natural progression was to become a general manager. And that's what all my development was aimed at. And I think from a personal term we decided myself and husband to adopt our daughter who's now 11. And I think that was a journey. It was a big year for us. Took a year out on adoption leave and just reassessed what it was that I wanted to do. And I don't think it was right for me, my family and also my work for me to then go back, try and be a general manager because I wouldn't be able to give it my 110% due to work hours. You know, for me there was a reason why we wanted a family and I needed to be able to be there at weekends, at evenings. And being a hotel general manager, you're definitely not really at home a lot at know, evenings and weekends. So I just reassessed where I could transfer my skills to. And being an operations manager, for me it was all about working with people. So whether that be guests or whether it be Team members. And I thought, okay, where can I transfer my skills? And I thought, well, I really enjoy seeing people progress, seeing people develop from a team perspective and seeing them go on to different things, whether they be within our industry or whether they be outside of the industry. And that's when I thought, okay, let's try hr. It was hard at first because it is very different to operations. Being an ops manager, you're in control of a lot of people working in hr. You're working alongside and supporting people and it is very different. So it took a good six months, I think, to get my head into being within HR and then just went on from single site HR to an area people and culture manager and now as a specialist in learning. So, you know, since COVID a lot has changed, but I've been in my current role for about 20 months and learning and development for me within the whole people and culture is what I love. I love being able to facilitate some great conversations around people, being able to learn and just seeing them absorb that information and then do something with it and then go on to different roles, whether it be, you know, in the same hotel or in our different hotels. Hotels is. Is where I find my passion.",
      "start": 278480,
      "end": 437510,
      "confidence": 0.9736931
    },
    {
      "speaker": "B",
      "text": "Yeah, yeah. Incredibly rewarding and I'd love to dig more into that. And just going back to. I was going to ask about, you know, the adjustment obviously from going from operations into hr. What sort of, what transferable skills in particular do you think are extra beneficial in the HR world that you gained from. From operations and having that perspective?",
      "start": 437750,
      "end": 461910,
      "confidence": 0.9711022
    },
    {
      "speaker": "A",
      "text": "I think it's key. And if I look at the team that I work in there, actually quite a few of us that have worked in operations before coming into hr and you understand the hotels because you've been there, you've seen it firsthand, you've been in the operation, so you understand the constraints that hotels have. As I said before, we never close, so it is Constant. We're a 247 operation. So you need to be realistic at what demands they have. You need to be realistic at what's happening in the hotels, looking at their busy periods. And for me to land some training and development in, for example, the middle of December, it just wouldn't. It wouldn't land because for us that's a very busy period. So you need to have an understanding of what's going on in the hotels and being able to support them when they need it.",
      "start": 462470,
      "end": 518190,
      "confidence": 0.97850686
    },
    {
      "speaker": "B",
      "text": "Yeah. Would you say, in a way as well, it helps on a sort of trust level that you know, the people you're working with understand that you have understood.",
      "start": 518430,
      "end": 526800,
      "confidence": 0.9758925
    },
    {
      "speaker": "A",
      "text": "Very much so. Very much so. It gives you more credibility because you've, you've been in their shoes, you understand and you know, whether you've been within the restaurant or front office and then as an operations manager, they understand that you've been there, you've gone through what journey that they're going through. So you can help them come through it.",
      "start": 526800,
      "end": 547960,
      "confidence": 0.98926234
    },
    {
      "speaker": "B",
      "text": "Yeah, yeah. It's not something you can really read in a book and to understand. Baptism by fire. Brilliant. Well, yes. On to present day, can you. Yeah. Tell us how you came to your current role as a learning and development manager at Valor and what your responsibilities are.",
      "start": 548120,
      "end": 566260,
      "confidence": 0.96316326
    },
    {
      "speaker": "A",
      "text": "Of course. Yeah. So I was a generalist within HR and my passion was always the learning development. So I'm quite an outgoing person. I like to talk, I like to get involved with people and, and see people develop skills, whether that be specifically related to their job role or whether it be just general life skills. Within the hospitality industry, you get a lot of younger people join and you see them flourish, you see their confidence come. And I don't think there's many industries that give that. So within learning and development, I think there's lots of different things that I'm responsible for. You can look at the onboarding side of it. So when team members join us, we need to make sure that they get off to a right start and we're giving them the skills that they need to be able to do their job brilliantly. So that's from when team members join us and then we have all of the compliance training that sometimes isn't as exciting as the developmental training that I focus on. So a big part of my role is looking at how we can progress our team members with us. So looking at succession planning, looking at how we can grow our own talent and how we can nurture that. So looking at, for example, this year we have different development programs in place for supervisors, managers at hotel level, senior managers and then general managers. I think this year we had around about 250 people go through that. And then when we look at internal promotions, for us it's really important to try and grow our own and really invest in people's development and seeing where they want to go to on the next level. So yeah, it's a wide, varied role.",
      "start": 566260,
      "end": 686340,
      "confidence": 0.98255193
    },
    {
      "speaker": "B",
      "text": "Yeah, yeah, but wonderful. And when it comes to, when you, you know, have a team of individuals, how do you approach identifying what learning techniques are best of them, what they can offer in what ways you can best help them? What is your sort of Step by step approach when it comes to seeing that person and seeing where they can go and how you'll help them get there.",
      "start": 686500,
      "end": 713460,
      "confidence": 0.98226774
    },
    {
      "speaker": "A",
      "text": "I think it all starts with an authentic career conversation. So we change the way that we do the typical appraisals within our business and we call them a valor check in now. So that whole process is led by the team member. And I think historically if you think of a performance review or an appraisal, it was always led by the manager. So we've turned it on its head and we, we allow the team members to lead that conversation. I think development and progression within our industry has changed. It used to be very traditional. So you used to go from a team member to a supervisor to assistant manager, where now people are looking at, okay, how can I go cross departments? How can I go at different levels rather than that traditional approach? So it's based on what the team member wants rather than what we want. By having an authentic conversation and really listening to your team, you can then plot the development that they're looking for and it might be that the manager will decide, okay, actually there's some development that I think that would be great for you. What do you think about it? But if the team member's not signed up for that, then there's no real point. They need to be passionate about what they want to do. Everybody learns in, in very different ways. So we need to be led by the team member rather than us leading them through that process.",
      "start": 714350,
      "end": 804170,
      "confidence": 0.9756926
    },
    {
      "speaker": "B",
      "text": "Yeah, I was going to ask about that because I'm sure, you know, with every individual it's different with how much they come to you with and how much you sort of work to identify the potential within them. So yeah, how do you strike that balance? Is it just intuition and just having these conversations and does it vary?",
      "start": 804970,
      "end": 823450,
      "confidence": 0.98204345
    },
    {
      "speaker": "A",
      "text": "It does vary by, by person. It really depends what their, their passion is. If they have got, you know, a goal that they want to strive to, if they've got a role that they need, you know, they want to get to, then we will work with them to get to them to get that role. Sometimes people don't see their own potential and if they don't, then that's their manager's role to, to identify that and then give them some feedback and say, you know, have you thought about this? You've got some excellent skills around X, Y and Z. We think that you'd be great for this role. What are your thoughts? So it is two way, but it really needs to come from the team member first. We don't just focus on traditional work skills. So we do focus around leadership skills and how they can do their job brilliantly, but we always wear focus on some of the softer skills as well. So whether that be things that they can use outside of work, whether that could be resilience, dealing with difficult people, so their life skills, as well as relating to the job as well.",
      "start": 824770,
      "end": 895460,
      "confidence": 0.9798046
    },
    {
      "speaker": "B",
      "text": "Yeah, and that's wonderful to hear. You know, this sort of more modern approach. I know you mentioned in the past it was quite linear.",
      "start": 895700,
      "end": 902980,
      "confidence": 0.9566699
    },
    {
      "speaker": "A",
      "text": "Very much so, yeah.",
      "start": 902980,
      "end": 904100,
      "confidence": 0.9833577
    },
    {
      "speaker": "B",
      "text": "Slightly boxed in, but wonderful to give them that freedom. And yeah, I think, like you say, sometimes it's hard for a person to step outside themselves and, and see what their potential is. So, yeah, it's fantastic to have those conversations. And I know we touched briefly on, you know, part of your role is helping with onboarding earlier and I just wanted to ask a little bit more about Valor's approach to that, you know, as well as having these conversations and what is your approach to sort of successfully onboarding new team members who are perhaps new to the group and even new to hospitality?",
      "start": 904100,
      "end": 938320,
      "confidence": 0.9806428
    },
    {
      "speaker": "A",
      "text": "It's all about being open and honest and I think if somebody is joining the hospitality industry at entry level and potentially haven't had any exposure, it can be a little bit daunting sometimes. So it's about before day one, making sure that we're reaching out to the team members and communicating with them and saying, okay, when you arrive, this is who you're going to be speaking to. So just be reassuring them before they. They step through the door. So it's about that communication before they start on day one. Day one, it's all about a really positive welcome, introducing them to the team at the hotel, making sure they understand everything that they need to. First and foremost, they understand us, what we're about, so understanding our values as a company and what, what they've signed up for and just really welcome into that hotel team and to our company as a whole, really making sure that they've got everything that they need to do their job, whether that be uniform, whether that be any training that they need to do, but really making sure that we don't overload them on that day one, because there is an awful lot that people will need to know. But looking at the onboarding process, we have an onboarding process that will last over three months. So we'll drip training into week one, week four, week, week eight, rather than just hitting it all, all on day one.",
      "start": 939040,
      "end": 1030980,
      "confidence": 0.97795385
    },
    {
      "speaker": "B",
      "text": "Yeah, yeah, of course, yeah. It's the best way to take things in, isn't it? And again, sort of beyond the onboarding process, when you get to know these team members, what are some identifying signs just in your opinion, that someone has the potential to be a great future leader in hospitality? Are there any early signs? Is it just a matter of passion and what sort of things do you look out for?",
      "start": 1031060,
      "end": 1058009,
      "confidence": 0.9799186
    },
    {
      "speaker": "A",
      "text": "Passion is, is definitely one, but somebody taking the initiative, somebody that is curious so asking questions, you know, why are we doing this? Tell me more. Somebody that's inquisitive and somebody that you can see, you know, is helping other people and is, it's just for us it's all about being curious. So you can see it quite easily.",
      "start": 1058489,
      "end": 1087190,
      "confidence": 0.9827318
    },
    {
      "speaker": "B",
      "text": "And so I also, I wanted to ask you what role technology plays in learning and development. I know this is something you also work with. So how does Fallow employ that when it comes to kind of all aspects of somebody's learning journey with them?",
      "start": 1087510,
      "end": 1105520,
      "confidence": 0.97943467
    },
    {
      "speaker": "A",
      "text": "Technology is big within with any learning and development role. Like I have alluded to before, people learn in different ways. So gone are the days where, you know, we can look at taking people out of the business, say for example, for a full day and doing some form of face to face training. We need to make sure that we're looking at what else is out there. So whether that be looking at bite size learning, so whether it be micro learning, we have an LMS platform that we have lots of our compliance training on. But what we've tried hard to do in the last year is look at how we can use that for some bite size learning, whether that be around leadership skills, communication skills, teamwork, but also the softer skills. So we have a lot of resources on there around, well being. One of the most popular downloaded resources is actually the Adult Sleep book. I know that I've definitely downloaded it and referred to it myself a few times. And then when we're delivering trainers, you know, how can we make it engaging? How can we make sure that that learning sticks? You know, gone are the days where you just have, whether it be slides with words and words and words on, you know, how you're getting your learners engaged, how they're interacting and how they're sharing some of their experiences. We've done quite a lot of training over the last 12 months around belonging at Valor, so around diversity, equity and inclusion. And the learning that has really come out of that is from the team members sharing stories and sharing past experiences. I think there's a lot in there of how we learn from each other. So yeah, so technology, you know, whether that be different apps around micro learning, whether you use quizzes, whether you use videos, podcasts, for example, you know, people's brains will work in different ways. So we need to make sure that we're trying to cater for, for everybody.",
      "start": 1107840,
      "end": 1233940,
      "confidence": 0.97597086
    },
    {
      "speaker": "B",
      "text": "Yeah, yeah. I was going to ask if there was a sort of optimum balance between the tech side and the sort of human conversational side, but it sounds like people are sort of afforded the flexibility to, to choose their own best.",
      "start": 1234420,
      "end": 1252920,
      "confidence": 0.96318585
    },
    {
      "speaker": "A",
      "text": "Most definitely, I think with some of our compliance training, so anything relating to legislation, you know, we need to make sure that it is standardized and it's recognized by a certain body. But anything developmental wise, I think if you can try and reach out to as many different learning styles, it's hard for operators to stop and not be on their feet and not serve. So trying to engage their attention, whether it be for 60 minutes, 90 minutes or for six hours, we need to think differently because people that are operators aren't designed just to sit in, you know, some form of training room or whether it be on a virtual session, it's not their go to. So we have to try and try and use all the tricks of the trade.",
      "start": 1252920,
      "end": 1302250,
      "confidence": 0.9786601
    },
    {
      "speaker": "B",
      "text": "Yeah, yeah. And I guess on that note, sort of thinking about where tech can develop in this area, does that lie best then, do you think with things like apps more on the go things, how do you see that sort of developing? Do you think more hospitality groups will sort of take that same approach as well?",
      "start": 1302490,
      "end": 1322720,
      "confidence": 0.9718259
    },
    {
      "speaker": "A",
      "text": "Yeah, I think time is, is key for us and I think something that I've been looking into over the last couple of months and we'll be focusing quite heavily on, on next year is, is how we look at the micro learning a lot more and how we can condense it. Because I think just in general in life, people don't have buckets of time and everything is instant. So, you know, if we want to know anything, we just get our phones out and we'll, we'll Google it, we'll search it and everything is there. So if we're looking at learning, people want it short, they want it snappy and they want it engaging. So I think, you know, from a tech point of view, anything that will help you condense things and get a real clear message out there is, is key for the, the years to come.",
      "start": 1322960,
      "end": 1376460,
      "confidence": 0.9717018
    },
    {
      "speaker": "B",
      "text": "Yeah, absolutely. And, and how do, how do you measure the success of these approaches and see how, how it sort of resonates? Is it a matter of feedback? Do you just sort of see the results in, in the sort of operations higher up? How do you Sort of, you know, look at those metrics and understand how it works.",
      "start": 1376860,
      "end": 1400340,
      "confidence": 0.9794504
    },
    {
      "speaker": "A",
      "text": "You can see them, but you can measure them as well. So if bite sized content, for example, that we have on our platform, we can see how many people have downloaded it, how many people have interacted with it. When we're hosting live virtual sessions, we always generate feedback afterwards. So we'll analyze that and also just ask the question. So if we've focused on for example a session around building resilience, go back to the hotels and speak to the general managers and say, you know, okay, what, what other feedback did you have? Have you seen anything different? And then look at how we can really embed that. So it's, it's one thing running a course and somebody will, you know, join the course for, for 90 minutes. It's what we need to think about, what are they going to do with those skills gained and how can we really make that stick? So you, you know, making sure that we check in four weeks after they've done an event and said, you know, hope you really attended. Have you looked at these tips and refer it back? So they think, okay, yes, I need to bring that to the forefront of my mind. So yeah, feedback is really key and I think, you know, we're a very authentic and honest company. If things aren't right, then it's a safe environment to say actually, you know, maybe we could change things. But I think speaking to the general managers, the operations managers or the attendees saying okay, how was it and what's next? What else can we do to support you? Be the best version of you.",
      "start": 1400340,
      "end": 1498810,
      "confidence": 0.9714037
    },
    {
      "speaker": "B",
      "text": "Yeah, wonderful. And, and you know, fantastic. It's a safe space where yeah, people can give that feedback and, and yeah, help, help the group sort of grow together. And like, you know, I suppose like we say with individuals, it's, everyone has their own ways of learning. But yeah. Has there been a part of Valor's approach that you've seen particularly resonate with, with people? And have there been any trends? I, I imagine perhaps, you know, for Gen Z or younger people for example, there's quite a lot of engagement with this micro learning.",
      "start": 1498970,
      "end": 1532740,
      "confidence": 0.96218723
    },
    {
      "speaker": "A",
      "text": "Yeah, yeah. I think like I said before, the main focus for me this year since, since summer so August was we want to do development. As with any business, there's a lot of cost constraints this year but we need to develop our people. We're very passionate about that internal succession planning and that internal growth. So we needed to look at how can we do this differently. So we went on a bit of a journey and Introduced virtual live, virtual sessions, which was new for us. A lot of our training was always face to face, so taking it on to, you know, a platform, whether it be teams or. Or zoom, was. Was different. But for us, we've had really great success. I think we've done four different topics and we have 37 hotels in the UK and being able to reach people from, from, you know, from Plymouth and Southampton all the way up to St Andrews in Scotland is massive. So it brings different, not only different job roles, different generations for 90 minutes that we wouldn't have been able to reach those people if we would have been doing it face to face. So I think continually, and looking at how we improve that for next year and be able to reach more people is really key.",
      "start": 1532740,
      "end": 1622950,
      "confidence": 0.9799006
    },
    {
      "speaker": "B",
      "text": "Yeah, fantastic. And we've touched on it slightly, I guess, in terms of, you know, time and cost constraints that we've just mentioned. I was going to ask you, sort of in a wider sense, what you see as the current biggest challenges for learning and development, in a general sense, for the industry, and what would your advice be for navigating these?",
      "start": 1623190,
      "end": 1647450,
      "confidence": 0.9705772
    },
    {
      "speaker": "A",
      "text": "Currently, I've just mentioned the time and I think with our industry, you can't just close and say, okay, we're gonna do some training for an hour because we are 24 7, so that time is 1. But I think what we really need to do is focus on what it is that that person needs and let them lead their development, rather than us having a blanket approach across everybody and saying, okay, we're going to train everybody with this skill. If you have somebody attend training and they're not passionate about that subject or their heart's not in it or they don't really want to be there, you can tell. And that will affect the group dynamic. So look at what the team want and then make sure that you have some development in place that will get them to their ultimate goal.",
      "start": 1647450,
      "end": 1705990,
      "confidence": 0.97240496
    },
    {
      "speaker": "B",
      "text": "Yeah, yeah, great advice. And so pivoting away slightly, I also. I understand you're a lead for mental health first aiders.",
      "start": 1706150,
      "end": 1717150,
      "confidence": 0.95277625
    },
    {
      "speaker": "A",
      "text": "Yeah.",
      "start": 1717150,
      "end": 1717590,
      "confidence": 0.95214844
    },
    {
      "speaker": "B",
      "text": "So I wanted to ask you a bit about that. What inspired this? And yeah, can you tell us more about the work you do with. With the side of.",
      "start": 1717590,
      "end": 1725390,
      "confidence": 0.9677544
    },
    {
      "speaker": "A",
      "text": "Of course, yeah. It's been quite a. Quite a long journey. It was pre Covid. Now, I want to say around about 2018, mental health and general well being is something that I've always been passionate about. I've had people affected with poor mental health around me and it was when I was working closely with the general manager and his brother, unfortunately committed Suicide and seeing him go through that horrendous journey just spearheaded both of us to say, okay, what can we do to improve well being? How can we as leaders within the business get a, get our culture around wellbeing? So we went on a bit of a journey. I went and became a mental health first aider myself and again at that time it wasn't widely spoken about within our industry and me going on that there was, okay, well you know what, what's going to happen? So I said, well let me, let me become a mental health first aid and let's review it. So that then took us on a journey where we presented to the leadership team this is what we feel should be our policy. We got buy in from the whole leadership team. Then we went on and said, okay, we need to have a mental health first aider in each of our hotels. So we became that. We spearheaded a bit of an initiative that we used to call Wellbeing Wednesdays. So every Wednesday all of our hotels used to do something around wellbeing, whether it be walking clubs, yoga, healthy food and I think really over the last, you know, eight, nine years we've just gone on from strength to strength and I think now we currently have over 80 mental health first aiders across our hotels in central teams. We have well being champions in all of our hotels that meet virtually once a quarter to discuss and plan, okay, what are we doing around wellbeing? How can we expand on knowledge? How can we support the team? So yeah, it's been a really great journey. Really very rewarding seeing from where we've come to where we are now, where wellbeing is just part of our day to day.",
      "start": 1725390,
      "end": 1883220,
      "confidence": 0.9668636
    },
    {
      "speaker": "B",
      "text": "Yeah, yeah, it's, it's almost funny to think that it just wasn't a part of these conversations. What, why do you think that was the case and, and was Covid a sort of kick starting point or what do you think brought about this, this change in the industry?",
      "start": 1884100,
      "end": 1901140,
      "confidence": 0.96927816
    },
    {
      "speaker": "A",
      "text": "I think I can see it now in the last say five years that you know, it's a lot of it is out there and I think generally people are talking about mental health and people are talking about well being so that that helps. It just takes somebody who's passionate that to stop and think, okay, what can we do and what can we focus? And you know I will see different hotel companies now having, you know, their well being policies. But you know, when we were talking about this as a company it wasn't widely out there and you know, I would like to think that we were one of the first management companies within hospitality to really spearhead it, I think. And thankfully generally people talk about mental health quite commonly now, which is, which has helped.",
      "start": 1903060,
      "end": 1954290,
      "confidence": 0.97698873
    },
    {
      "speaker": "B",
      "text": "Yeah, yeah, wonderful. Yeah. What a brilliant thing to be a pioneer of. That's, that's incredible. And I guess what, what would your advice be to you know, hoteliers listening who, who want to, you know, strengthen their own well being initiatives within their operations, Perhaps don't know where to start. Do you think a similar plan as to valor. What would you advise be for them?",
      "start": 1954610,
      "end": 1982940,
      "confidence": 0.9522225
    },
    {
      "speaker": "A",
      "text": "Yeah, I would start. Start small, get people understanding why it's important. You know, we, everybody has mental health. Whether it be great mental health, whether some days it isn't great and acknowledging that no matter who you are, we will all have poor mental health at one point and we will deal with it differently. So I think being open and honest and saying, you know, nothing is going to go away. Gone are the days where, you know, years ago in the industry used to, okay, you know, when you come into work you leave all your problems at the back door type of thing. And you know, I remember 15 years ago and you know, people saying that to me and thankfully those days are gone. People will have problems and it's important as an employer that we recognize our team members will go through struggles. So what can we do to support them? Whether that be from a mental health point of view, whether that be financial, whether that be just healthy eating, whether it be exercise. There's lots of things that we can do to acknowledge. But I think the main thing, and it's a very simple thing that really doesn't cost anything, is just listening and just really listening to people non judgmentally. We don't have all of the answers and we can't fix people, but we can listen and then signpost our team members to support that they, that they need. You know, we, we can't just fix all of the problems but by listening to people and just asking those questions, you know, how are you? But then asking them again because you know, it's like when you say to somebody, are you, you know, how are you? And somebody will say okay, that's everybody's first response. But what we should be doing is asking them, are you really okay? And then that usually makes people stop and say, well actually I'm not having a great day. Okay, let's talk about it. Do you want to talk about it and really listening to your team?",
      "start": 1983020,
      "end": 2112060,
      "confidence": 0.9784084
    },
    {
      "speaker": "B",
      "text": "Yeah, yeah, I guess as well. Sort of having that intuition of understanding that there is something there that you can Just be there as a support.",
      "start": 2112540,
      "end": 2122490,
      "confidence": 0.9852129
    },
    {
      "speaker": "A",
      "text": "Yeah, you know, your team members, you see them day in, day out. And I think, you know, what we say to manage is, you know your team more than anything and you spend a lot of time with them. So if they're not their usual self, there is a reason. So just, just broach that subject. Just say, you know, how are things? How are you doing? And then take it from there.",
      "start": 2122810,
      "end": 2148820,
      "confidence": 0.98142225
    },
    {
      "speaker": "B",
      "text": "Yeah, wonderful. And I imagine it's resonated very well at Velur.",
      "start": 2148980,
      "end": 2154020,
      "confidence": 0.93571705
    },
    {
      "speaker": "A",
      "text": "Yeah, very much so, yeah.",
      "start": 2154100,
      "end": 2155500,
      "confidence": 0.96171874
    },
    {
      "speaker": "B",
      "text": "Brilliant. Again, coming back to sort of creating that environment of trust and support is crucial. So, yeah, that's really wonderful. So I guess, sort of, you know, looking back at, you know, learning and development in a wider sense and people development, how. What changes do you think you'd like to see in the hospitality industry in the coming years in this area? How do you think the industry can continue to evolve so it supports its people in the best way?",
      "start": 2155500,
      "end": 2190460,
      "confidence": 0.9775444
    },
    {
      "speaker": "A",
      "text": "And I think, like I've alluded to before is treatment the team members as individuals. So really see what it is that they want to do. And gone are those, like we talked about before, gone are those as traditional linear development pathways. Some people, you know, can refer to it as like squiggly pathways. You know, if I look at myself, you know, my natural progression from operations manager was to become a general manager and, you know, that wasn't right for me, you know, so the company developed me into what I wanted to do and, you know, they listened to me and that's what within a hospitality industry we need to do. You know, it's not, if you look at general managers, for example, it used to be always that we would get our general managers from a food and beverage background. You know, we've got great general managers in our company from front office background, from finance background. So it's really honing into, okay, what does that individual want to do? And let's help them get there. It might be that we have team members that are only with us for two or three years while they're at university because they want to go on and study something totally outside of our industry. That is absolutely fine. But let's make sure that they have, you know, those three years are absolutely great working for us and they'll get some different skills that they can use throughout their life.",
      "start": 2190460,
      "end": 2280070,
      "confidence": 0.97175205
    },
    {
      "speaker": "B",
      "text": "Yeah, absolutely. I think, you know, hospitality is such a wonderful industry for those transferable, definitely. And, and yeah, and for those that love the industry, it will be wonderful to see how the sort of leaders of tomorrow develop with that support behind them. Brilliant. I and I know we've touched on this earlier at the start of the episode, but just to finish off, what are you excited about for the next stages of Valor's learning and development journey?",
      "start": 2280480,
      "end": 2309150,
      "confidence": 0.9632794
    },
    {
      "speaker": "A",
      "text": "Okay. I think it's building on what we've done this year. So like I said before, we've had four different sessions from a virtual training point of view and we were unsure how they were going to land. They've landed really well. Looking at the feedback, people have said that they're really easy to fit into their day. They found them engaging. So it's really building on that and having a great program for 2026, but also looking at, you know, I mentioned before about the whole micro learning, so how we can use that across all of our hotels to really embed the learning. I think we need to make sure that the learning sticks. So 2026 for us will be looking at. Okay, how can we do that? How can we really get great team members? I've forgotten what I was going to say.",
      "start": 2309150,
      "end": 2365090,
      "confidence": 0.97888803
    },
    {
      "speaker": "B",
      "text": "And finally. Yes. What's next for Valor's learning and development strategy that you're excited about?",
      "start": 2367250,
      "end": 2372930,
      "confidence": 0.97746855
    },
    {
      "speaker": "A",
      "text": "So it's building on the success that we've had this year around our virtual training sessions. So let's really get a great programming for 2026. Taking. Taking all the feedback from our current courses and also taking feedback from the hotels. I think another thing that I'm really excited for next year is looking at how we can improve that knowledge retention of the learning, whether we use some different technologies, so whether it be bite size learning, whether it be some flip books with some videos. And another thing that we literally just about to launch in the new year is our ILM Level five. So this is aimed at senior hotel and central managers that they'll be able to do an apprenticeship and come out with an ILM Level 5 qualification at the end of it. So we've literally this week hosted a call and gave all of the information out and we're looking for nominations. So we look to have a cohort start in January next year. So let's see how that goes and then see how we can filter it down and see if we can potentially then go to level three. So trying to do something a little bit different for next year.",
      "start": 2374290,
      "end": 2456470,
      "confidence": 0.97646266
    },
    {
      "speaker": "B",
      "text": "Yeah, brilliant. Well, yeah, all the best with that. That sounds wonderful.",
      "start": 2456710,
      "end": 2460470,
      "confidence": 0.9781562
    },
    {
      "speaker": "A",
      "text": "Thank you.",
      "start": 2460470,
      "end": 2461110,
      "confidence": 0.9764404
    },
    {
      "speaker": "B",
      "text": "And finally, Natalia. We finish each episode with a question left by the last guest. Our previous guest was Henry Matson from Apron, which is an invoicing platform for hotels. He asked, well, he kindly left you with two questions, the first being what is your biggest headache in hospitality at Christmas time? And what tech or a bit of software do you wish was available to deal with this?",
      "start": 2461430,
      "end": 2487260,
      "confidence": 0.9735166
    },
    {
      "speaker": "A",
      "text": "Gosh, biggest headache within general hospitality or within L and D?",
      "start": 2487740,
      "end": 2495820,
      "confidence": 0.93858755
    },
    {
      "speaker": "B",
      "text": "I suppose within L and D, from your own perspective.",
      "start": 2497310,
      "end": 2499950,
      "confidence": 0.9597168
    },
    {
      "speaker": "A",
      "text": "Okay. I think the operators are probably going to hate my answer to this because when the hotels are very, very busy at Christmas, then we tend to step back and to leave them a little bit. So for me, I'm actually, I have two weeks off over Christmas, so the operators are definitely going to hate me for that. But I think I really use December as a time to. To review. Our hotels are very, very busy, you know, with, with party nights galore happening and people really enjoying the festive period. So within my role, it's a time to review. Okay, what's this year been like within L and D? What are we going to hit the ground running in. In January? So I don't think there's any technology. It's just me having time to. To review and then plan is. Is really helpful. So it's a little bit of a down time and then plan for the next year ahead.",
      "start": 2499950,
      "end": 2562760,
      "confidence": 0.97141147
    },
    {
      "speaker": "B",
      "text": "Yeah, yeah. And, well, again, on the Christmas note, his second question was, what bottle of wine would you like to be opening on Christmas Day?",
      "start": 2563000,
      "end": 2571960,
      "confidence": 0.9925365
    },
    {
      "speaker": "A",
      "text": "Oh, that one's much easier for me. It's probably going to be a nice Sauvignon Blanc. Nice Marlborough to New Zealand. Yeah. Nicely chilled, asked to be very chilled.",
      "start": 2571960,
      "end": 2583010,
      "confidence": 0.92869073
    },
    {
      "speaker": "B",
      "text": "Lovely. So, yeah, lovely. Well, yeah, enjoy that when it comes.",
      "start": 2583090,
      "end": 2586530,
      "confidence": 0.95252573
    },
    {
      "speaker": "A",
      "text": "I will.",
      "start": 2586610,
      "end": 2587170,
      "confidence": 0.9577637
    },
    {
      "speaker": "B",
      "text": "And finally, Natalia, do you have a question to leave our next guest?",
      "start": 2587730,
      "end": 2591170,
      "confidence": 0.995474
    },
    {
      "speaker": "A",
      "text": "Be really keen to know how your next guest uses AI within the world of L and D within their organization. It's something that is very topical. It's something that we're all looking at. So, yeah, I'll be really keen to know how they. How are they using it to. To influence L and D. Yeah, it.",
      "start": 2593010,
      "end": 2611460,
      "confidence": 0.971235
    },
    {
      "speaker": "B",
      "text": "Will be interesting to hear their answer. Yeah, we'll pass it on. Natalia, thank you so much for joining us.",
      "start": 2611460,
      "end": 2616620,
      "confidence": 0.98048097
    },
    {
      "speaker": "A",
      "text": "It's a pleasure. Lovely chatting. Thanks for listening to Checking In, a weekly podcast from hotel owner, the UK's trusted source of hotel industry news and analysis. If you like the podcast, make sure to subscribe on whichever podcast platform you listen to. To get more industry Insight, head to hotelowner.co.uk and subscribe for unlimited access. If you're interested in sponsoring episodes of the podcast, drop us a line at podcastotelowner.co.uk.",
      "start": 2616620,
      "end": 2642880,
      "confidence": 0.9739001
    }
  ],
  "chapters": [
    {
      "summary": "Checking In is a weekly podcast from hotel owner. Each week we meet with seasoned hoteliers, industry insiders and hospitality entrepreneurs to share the real stories, lessons and ideas behind what makes great hospitality work. If you like the podcast, make sure to subscribe on your podcast platform of choice.",
      "gist": "Checking In",
      "headline": "Checking In is a weekly podcast from hotel owner covering hospitality news",
      "start": 240,
      "end": 55900
    },
    {
      "summary": "Checking in with Natalia Dainty, learning and development manager at Valor Hospitality. Natalia talks about her journey from operations to HR and beyond. Offers insights into how Valor's training programs support every individual's unique learning styles and her pioneering mental health first aider initiative.",
      "gist": "Valor Hospitality Learning and Development Manager Natalia Dainty",
      "headline": "Heather speaks to learning and development manager Natalia Dainty",
      "start": 56940,
      "end": 174300
    },
    {
      "summary": "I think for me, resilience is key. Working in the hospitality industry is constant. No two days are similar. You just need to try your best, give it your all and strive for what it is that you really want to do.",
      "gist": "The Importance of Resilience in Hospitality",
      "headline": "Working in the hospitality industry is constant. No two days are similar",
      "start": 175260,
      "end": 264920
    },
    {
      "summary": "I'd been an operations manager for many years and my natural progression was to become a general manager. Took a year out on adoption leave and reassessed what it was that I wanted to do. Went on to become an area people and culture manager and now as a specialist in learning. Hotels is where I find my passion.",
      "gist": "Pushing the revolving door in HR",
      "headline": "You spent time in operations before moving into HR",
      "start": 264920,
      "end": 444870
    },
    {
      "summary": "I was going to ask about the adjustment obviously from going from operations into hr. What transferable skills in particular do you think are extra beneficial in the HR world that you gained from. operations and having that perspective?",
      "gist": "MR: Going from Operations into HR",
      "headline": "Going from operations into hr gives you a unique perspective on hotels",
      "start": 445030,
      "end": 559540
    },
    {
      "summary": "Valor's learning and development manager is responsible for onboarding team members. Looking at succession planning, looking at how we can grow our own talent. For us it's really important to invest in people's development and see where they want to go.",
      "gist": "What is the role of learning and development manager at Valor Hotel",
      "headline": "Valor has a learning and development manager who focuses on developing team members",
      "start": 559540,
      "end": 688660
    },
    {
      "summary": "It all starts with an authentic career conversation. We change the way that we do the typical appraisals within our business. The whole process is led by the team member. Development and progression within our industry has changed.",
      "gist": "In the Elevator With Team Members",
      "headline": "Developing your team starts with an authentic career conversation",
      "start": 689060,
      "end": 804170
    },
    {
      "summary": "How do you strike that balance? Is it just intuition and just having these conversations and does it vary? It really depends what their, their passion is. We don't just focus on traditional work skills. We always focus on some of the softer skills as well.",
      "gist": "How do you manage a team member's potential?",
      "headline": "How do you strike that balance between intuition and having these conversations",
      "start": 804970,
      "end": 917610
    },
    {
      "summary": "Valor's onboarding process will last over three months. We'll drip training into week one, week four, week, week eight, rather than just hitting it all on day one. What are some identifying signs that someone has the potential to be a great future leader in hospitality?",
      "gist": "Onboarding New Team Members",
      "headline": "Valor helps onboard new team members who are perhaps new to hospitality",
      "start": 918410,
      "end": 1087190
    },
    {
      "summary": "Technology is big within with any learning and development role. People learn in different ways. How can we make sure that that learning sticks? If you can try and reach out to as many different learning styles, it's hard for operators to stop and not serve.",
      "gist": "Technology and learning and development at Valor",
      "headline": "Technology is big within any learning and development role at Fallow",
      "start": 1087510,
      "end": 1303690
    },
    {
      "summary": "Time is, is key for us. How we look at the micro learning a lot more and how we can condense it. How do you measure the success of these approaches and see how it sort of resonates?",
      "gist": "Micro-Learning at the Hospitality Group",
      "headline": "Valor is looking at how to condense micro learning into shorter sessions",
      "start": 1304010,
      "end": 1624630
    },
    {
      "summary": "The biggest challenges for learning and development, in a general sense, for the industry. Focus on what it is that that person needs and let them lead their development. If you have somebody attend training and they're not passionate about that subject, you can tell.",
      "gist": "The challenges facing learning and development in the industry",
      "headline": "What are the biggest challenges facing learning and development in the IT industry",
      "start": 1626230,
      "end": 1708150
    },
    {
      "summary": "I understand you're a lead for mental health first aiders. What inspired this? And can you tell us more about the work you do with. Of course, yeah. It's been quite a. Quite a long journey. Now we currently have over 80 mental Health First Aiders across our hotels.",
      "gist": "Mental health first aiders at Covid hotels",
      "headline": "You're a lead for mental health first aiders at Accommodation Group",
      "start": 1709830,
      "end": 1889780
    },
    {
      "summary": "Covid was one of the first management companies within hospitality to really spearhead it. And thankfully generally people talk about mental health quite commonly now, which is, which has helped. Different hotel companies now having, you know, their well being policies.",
      "gist": "The rise of mental health in hospitality",
      "headline": "Covid was one of the first management companies to really spearhead well being initiatives",
      "start": 1892020,
      "end": 1961260
    },
    {
      "summary": "Everybody has poor mental health at one point and we will deal with it differently. It's important as an employer that we recognize our team members will go through struggles. Just be there as a support. Creating an environment of trust and support is crucial.",
      "gist": "Mental Well-Being",
      "headline": "Hoteliers should strengthen well being initiatives within their operations, says Velur",
      "start": 1961980,
      "end": 2163860
    },
    {
      "summary": "How do you think the industry can continue to evolve so it supports its people in the best way? Treatment the team members as individuals. See what it is that they want to do. It will be wonderful to see how the sort of leaders of tomorrow develop with that support behind them.",
      "gist": "The Future of Leadership in the Hospitality Industry",
      "headline": "What changes do you think are needed in the hospitality industry around people development",
      "start": 2166100,
      "end": 2297360
    },
    {
      "summary": "What's next for Valor's learning and development strategy? Building on the success that we've had this year around our virtual training sessions. Also looking at how we can improve knowledge retention of the learning.",
      "gist": "Valor Learning and Development: What's Next?",
      "headline": "What are you excited about for Valor's learning and development strategy next year",
      "start": 2297840,
      "end": 2460470
    },
    {
      "summary": "We finish each episode with a question left by the last guest. What is your biggest headache in hospitality at Christmas time? And what bottle of wine would you like to be opening on Christmas Day?",
      "gist": "Christmas Time",
      "headline": "We finish each episode with a question left by the last guest",
      "start": 2460470,
      "end": 2587170
    },
    {
      "summary": "Checking In is a weekly podcast from hotel owner. Be keen to know how your next guest uses AI within the world of L and D. If you're interested in sponsoring episodes, drop us a line at podcastotelowner. co. uk.",
      "gist": "Checking In: Using AI in the Hotel Industry",
      "headline": "Do you have a question to leave our next guest",
      "start": 2587730,
      "end": 2642880
    }
  ]
}