{
  "episode": {
    "title": "Breaking the Mould: Francisco Macedo on Redefining Hospitality Through Innovation",
    "guest": "Francisco Macedo, COO of Pavillion Club",
    "date": "2025-12-12",
    "duration": "48:00",
    "focus": "Innovation, leadership transformation, Master Innholders conference"
  },
  "transcription": {
    "text": "Welcome to Checking In, a weekly podcast from hotel owner, the UK's trusted source of hotel news and analysis. Each week we meet with seasoned hoteliers, industry insiders and hospitality entrepreneurs to share the real stories, lessons and ideas behind what makes great hospitality work. We'll unpack the decisions behind the success stories, the mistakes that shaped them, and what you can learn from their experience. If you like the podcast, make sure to subscribe on your podcast platform of choice and for more information, visit hotelowner.co.uk or drop us a line at podcastotelowner.co.uk hi, I'm Heather, host of this episode where we speak to Francisco Macedo, COO of Pavilion Club and Wilderness Reserve and chair of the Master Inn Holders upcoming Hotel Leadership Conference. Francisco discussed what we mean by the 2026 conference theme of Stronger Together, Breaking the mold, the key to navigating innovation and balancing tradition and transformation, and how intuition and empathy will define the leaders of tomorrow. Hi Francisco, welcome to Checking in and thank you for joining us. Well, thanks for having me. It's a pleasure to be here. Definitely one that, you know, I look forward to it having, having listened to it quite a lot of the previous, previous guests that you had. It's a pleasure to be here. Glad to hear it, Glad to hear it. Thank you so much. So, yeah, to, to start with, can you tell us what originally drew you to the industry and take us through your career journey and earlier roles, one. That probably most of you would never imagine unless you really know. I mean, as a child I always wanted to go to university medicine. I, so I didn't want to study hospitality. In fact, my parents told me all the time not to do so, so I, and, and you know, I really wanted to go to university. I had that mindset. But actually with my studies, at the same time I was studying, I was always kind of working in hospitality to earn some pocket money, as a lot of people do. And I think very quickly I realized that actually I really like the buzz, I really like the, the connection with people, new languages, all of that was kind of interesting and you know, I was meeting people all the time, so it's really that, that's kind of how I ended up getting in, in the industry and to be fair, from a very kind of low level in terms of starting as a, as a waiter and polishing cutlery all day to then run plates, to then do, do all things related to, to, to, to hospitality. So, so yeah, yeah, yeah. And you know, it's, it's so true what you say you know, even with things, hospitality really opens up the world for young people, doesn't it? And I think presents opportunities that, you know, not necessarily every industry can, in its, in its unique way. Can you take us more through some of the, the early roles you held and what that looked like in terms of progression, you know, after you got that, that taste for, for hospitality and the buzz at, you know, a young age? Ah, God, I literally did everything within an rtel operation from polishing cutlery all day, as I, as I mentioned to, you know, being running plates into tables, carrying trays, all that kind of thing. Clearing floors, housekeeping, pot wash, reception, all areas really. And, you know, I always say, and for sure I learned something across every single, every single rule, I think is that wide experience that actually gave me, give me a different perspective in everything that I do today, because I tend to think that I understand it. I might not be a perfect at it, but I understand it. I understand the processes and why people do certain things the way they do. But literally having worked across, you know, across the entire, entire departmental organization of an autel, it gave me, gave me a huge, huge skill, huge knowledge, for sure. Yeah. Yeah. And would you say, I guess, you know, when it comes to, you know, leading teams now as you do, does that experience and background, do you think that's beneficial in the sense of building trust with your team? Because they know that you understand the, you know, the trials and the tribulations and, and you've been in these positions and had these perspectives. Does that benefit culture? In some ways, for sure, I, I think, you know, it's. You meet a new team and, and you start talking to them and, and you don't have to tell them that you actually did the job or whatever it may be. You, as soon as you start talk the same language, people trust you. People trust that you know what you're talking about. You're not just making it up. You just didn't. You know, some people have this perception that, you know, general managers, directors, whatever title you have when you are at the top, that, you know, somehow you got there, but you're not quite sure how, how, what to do in each of these roles. But as soon as you start talking the same language and you're able to actually, you know, talk a few elements of it and they understand that you know what you're talking about. I think definitely the trust gets in and, and everything becomes easier. They will do more for you at that point because they, they believe in what you're saying at that point. It's very quick to get the trust when, when you do what you're talking about. Yeah, yeah. And I guess in terms of camaraderie, that that really helps as well. So, you know, you've been in the trenches together. Yeah, for sure. I mean, we're, we're a lot more, as an industry, as a profession, it should be a lot more about camarade than should really be about higher hierarchy, isn't it? I think if you can get the team on your side because they understand your views, but they understand that you know what you're talking, then the job becomes a lot easier and a lot more fun, too. So it's not like, oh, I gonna ask him a question just because he is a boss. You're asking the question because you're actually interested in the response and the point of view and so on. Yeah, brilliant. And I guess, you know, looking back at your career to date, were there any particular roles or moments or experiences that were most pivotal to defining where you are today? Or is that hard to say? Was, was each experience beneficial in its own right? I think each experience is beneficial on its own. Right. But without a doubt, probably the, the experiences where the pressure was extremely high and a small mistake could probably have a huge impact. Probably the ones that I kind of learned the most, and that goes from repositioning properties, you know, it taught me to. That you have to build a culture, you know, you have to get the team to believe in you. And, and before any results even appear, you know, to food and beverage, you know, taught me that you have to be. Your humility, your way you work with the team is very important because, I mean, ultimately, you can't deliver on your own. You need chefs, you need, you need the team delivering the food, you need, you need everyone coming together. And then, I guess leading luxury hotels has told me that leadership is a lot more about responsibility than it is about visibility. And I think you learn the most when your choices actually really matter and makes a difference. So I've learned across all of them, but certainly under pressure, I always felt that's where I learned the most. Yeah, I, I guess on a similar note, I suppose I, I was going to ask, you know, if there are any sort of particular challenges along the way, is there anything that stands out? I mean, I, I, there, There has been so many challenges. You know, you, you, when you try and operate hotels in different countries, different continents, there is a culture challenge, there is a, A legal challenge, there is political influence. There is so many. But I think you Know, at, at times. And you know, I became a restaurant. 19, 19 years old, restaurant manager for five star property. That was a challenge because, you know, people and, and my, my, my team was all much older than I was and had a, I guess you could say they had a lot more years of experience that they had too. So, so, you know, it becomes quite tricky at points. And I remember I had a director of restaurants, which now is a great friend. And he, he told me on kind of my first day or second day, he told me British could people like you and kids like you. Actually, that's how he kind of used it. He said, kids like you will come and go and I'm still going to be here, so just get on with it. And you know, he had worked for the business for over 30 years and, and, and you know, to be fair, he was right. You know, people would come and go. Yeah. And he would still stick around. So. So you have to bring all these people on the journey with you. Yeah. And, and you have to get them to trust you, irrespective of the age gap or, or wherever it is. And I think, you know, back 20, 25 years ago, this was a lot harder than perhaps it is today. Definitely 25 years ago, coming from Madeira Islands, small islands, and you know, having that sort of impact where people have been in the industry for many, many years before they became managers and you, you are the kid on the block and suddenly you are the boss as well. So, yes, it's quite, yeah, quite challenging. Let's put it on. Oh, baptism by fire. And what was your own approach to getting people on that journey with you and building that trust back then? How did you navigate that? Personally, I think, I think I've gone through different stages of my life and, and you know, it teaches you a few lessons along the way. Yeah, I've gone from. You have to be very autocratic and you just literally tell them and dictated to some extent and you tell them exactly what you want them doing and you hope that they deliver and then they don't deliver and then you get really frustrated and you're not sure as to why. And I think, you know, I did that very much at the beginning of my career and then, then I think over the years you kind of learned that you have to take people on the journey, you have to share your vision, you might still want them to achieve what you want them to achieve, but you almost have to instill them that idea. You have to show them what that may look like and you have to gain Their tr. Because if you've got their trust and you kind of try and shape their decision or their thought process, somehow they will, they will trust what you saying and they want and they will do it because they feel is the right way to do it and is the right thing to do. Yeah, but I think, you know, take, take people on the journey, build a relationship with them. Is, is probably, probably what I've learned over the years that, you know, I'm lucky enough that I've got, got a lot of team members over the years that I have worked with me for many years in, in a variety of different roles in a variety of different companies, businesses, countries even. And, and that's only happened because, because I trust them, they trust me, and I took the time to listen to them and a lot of the great ideas came from, came from the, the more junior positions, not necessarily from my bosses, I guess. Yeah, I think there's something to be said for fresh perspectives and new ideas as well in that sense. Yeah. I had a manager that used to tell me, you know, you always learn something from lazy people. At the time, I didn't quite understand exactly what he was saying. I was like, oh, what you're trying to say, look, Francisco or fm, most lazy people will find the quickest way to do it. So if you can learn something from them, learn the quickest way to do it. That's, I was like, yeah, okay, that's, that's excellent advice. Actually, I've never thought of that, but that's, yeah. Something to remember. I still haven't, I haven't learned that, that side of being lazy. But, but I, I think, you know, there is a lot to be said on, on the fact that a lot of people will find the quickest way to do it. And you know, as long as you do it legally, rightly, morally correct. Yeah. Quickest way to do it and way to deliver quickest way to achieve results by bringing the people on the journey with you. All of that. I think, you know, something that I, you know, I still still remember, like if it was yesterday. And it's funny, but it's so true. Yeah, yeah, no, I, I, I love that. And, and before we move on, I just wanted to ask you a little bit about your, you know, your new role as CEO of Pavilion Club in Wilderness Reserve. Can you just tell us a little bit about that and what your new responsibilities are? Absolutely, I mean, responsible for everything and anything. I guess I always joke that you're responsible for everything and you're responsible for nothing. Because you do need the team to be there and deliver for you. Yeah. Recent role taken as you are of Wilderness Reserve in Suffolk and our Pavilion Clubs in London. And Pavilion Clubs is, I mean, it's, it's a very interesting concept. It's not your traditional members clubs. It's kind of where you, you could say is a blend between your office and your networking relationship and your social life all comes together. The reality is, we all know in our industry in general, in life now, we've become more friends with the people we work with than the people we don't work with. Right? Yeah. Because we spend a lot of time together and therefore we end up becoming friends naturally. So Pavilion, Pavilion kind of gives a little bit of that. You know, you can have your office in the buildings and then you've got the club which you can use to host friends, meet friends, do new business. So you've got a variety of different ways that you can explore the benefits of being in a club. But it becomes your home away from home. Yet is your office, yet is your, your space to network and build new connections. And I always joke that it's almost like, you know, if you're running a big business and you've got several departments, imagine that, Wind Pavilion, you can have all those several departments, even if you just have a small business, because what is next door to you might be, might be someone that does something that actually it could help you on your long run. You know, it could be a business that you could be. End up working in partnership with. So it opens a lot of, of those naturally without having to worry about, okay, I have to go out and source a new partner or a new business to help me to deliver something for a client. And you know, all the events that we do, people networking, connecting, and generally there is this sense of, yeah, this sense of connection camaraderie, which is, which is more important than any, I guess, private members clubs per se. No, no disrespect, of course, you know, each brand and some very, very valid, powerful brands out there. But I think we just do something a bit different. And it's interesting. You sit in a club and you listen to some of the conversations and is, is great, the buzz is great, the, the connections that are made is great. And then Wilderness is, is a world of its own. Huge resorts, 7,000 acres of lands, 27 properties from ranging from one bedroom to 18 bedrooms, very top luxury hu of service provided, yet can be done on your own, on your own environment, could be done in a venue, can be done in, in the field it can be, it can be anything. Open lakes, man made lakes, you know, swimming pools, sauna, steam rooms. In, in most of the properties, your own pool, your own hot tub, you're in all your, all your own comforts in a way. I tend to describe. It's almost like we have 27 hotels in the resorts because, because they quite. Yeah, a bit of everything really. So yeah, fantastic. And you know, it's two, you know, quite, quite different operations there. How what is that experience like overseeing both, both Wilderness and, and Pavilion Club with being, being such different offerings for, for guests? I mean it's, it's fantastic. Yeah, we're very lucky. We've got a great team. We've got great owners who, who are very committed to the business and, and very inspirational really. I think you know, you sit with the owner for half an hour and you, your head is, is, is, is fine. You're getting new ideas by the second in a way. And, and you know, we've got a great team that is willing to, to almost do anything that it takes to make sure that the guest has the most amazing experience. Being that they're proposing, being that they're celebrating, being that they're doing, you know, they're just having some time away. If you take Wilderness. But then the same happens with Pavilion. Exactly the same. You know, the Pavilion Clubs, you know, the connections between our team and the, the lease holders of the offices or the members itself and we see them networking, having conversations all the time is so fantastic. You're kind of the buzz is real and that's, that's on both businesses. So we're lucky we've got great teams, we lucky we've got a great product which helps for sure. But, but yeah, no, he's, it's fantastic. And you know I sit in an office and I, I'm here at Wilderness at the moment and you're listening to, to the buzz and the conversations and the discussions and, and you're learning every single second about themselves even. Yeah, so it's, it's, it's incredible I. Guess kind of on the subject of, of networking. To move on, I wanted to ask you a master in Holders and yeah, for listeners who may not know, explain a bit more about this community and the, you know, the benefits it has for, for people in the, in the hotel industry. I mean mastering Holders is, is very much what, what some would say the creme de la creme is. You know, the, the, the best is, is about being the best ateliers in the country. And is, but it is very much a community, a community that's generally and genuinely wants to, to promote people and, and to promote our profession to others. You know, I sit on the boards of the Master and Holders. Obviously I'm organizing the conference, but sitting on the board it gives me the opportunity to help shape the future of our profession, our industry. And I see it, I guess I could say I see it as a privilege to, to be there, but as a huge responsibility too. And you know, I want definitely I want more leaders to be applying to become a Master in Holder so they can join our community, so they can help us spread the word so that we can help more people going through the ranks and profess progressing through the ranks in our industry and our profession and share the best practices. You know, it's challenging, It's a challenging industry in general. So we have to work together, we have to do everything together to raise the standards and to drive our profession and promote it. Certainly a priority of mine is definitely widening the access to the Master and Holders, but also the talent as we know exists everywhere. There is plenty of talents in our profession across the country, but there aren't many opportunities for them to progress or learn or develop it. And Master Holders provides these platforms for mentoring, provides you a platform of scholarships. And we are constantly and actively raising funds to support the scholarships, hence the conference. So we can hopefully get funds to support the scholarships that will then send what we would call the rising managers to institutions such as Cornell and Cranfield University. I mean that's an opportunity of a lifetime. I've attended Cornell and I can't tell you how much that has changed my career. But also my, the camaraderie, the connections that I've built. You know, I've got 40, 43 people that attended Cornell at the same time I did. And you know, to these days we drop a question on, on our WhatsApp group and we've got an answer within, within seconds of someone that faced a problem and has faced a similar problem, similar challenge or similar strategy or software or whatever may be. So it's definitely opening the doors. We want these programs to be changing the trajectory of a lot of our young rising managers that are coming through the ranks. And we want them to have the support and the knowledge to be able to move quickly and accelerate their capability and confidence really, which hopefully they then go and do the same. They then try and do the same, raise funds and then inspire others to join our profession and go into study, further our hospitality and continue to progress it's kind of, you know, we, you know, mastering holders really gives us that opportunity of, of getting hospitality professionals together to raise our standards, create opportunities for, for people across the industry. And, and yeah, quite frankly, you know, in the nicest possible way, it should be seen as a movement that is dedicated to drive excellence and collective growth. We're not interested on ourselves. We're interested in promoting the industry so we can, so more people can, can rise through the ranks with the right level of skill and knowledge. Yeah, fantastic. And you know, like you say, it's, it gives people that support that will stay with them throughout their, their careers and their lives and, and what a wonderful movement, like you say. And I know you just mentioned the conference there, so I wanted to touch on that a bit more as I know your chair. Yeah. Can you tell us more about this year's theme, which I believe is Stronger Together, Breaking the Mold. Can you. Yeah. Tell us what that means and, and what we can expect from next year? Yeah, very much. Stronger Together, Breaking the Molds. I mean, it's a huge pleasure to be the chair of, of the conference. It's something I always aspire to do. Going back to giving back to, to the industry, you know, it was something that I definitely wanted to do having, having benefited from funds that were raised through, through the com. Through the conference in previous years. The team is really what it is all about. I mean, you know, the secret is there is, is, you know, it's all about we need to get together to, to face the biggest challenges that we've got in our profession and our industry. We cannot be solving them on our. By ourselves. We, we know that, you know, so we are stronger together, but we also have to know that we have to start doing things differently. Otherwise if we do what we always done, we're always going to get the same results. So I have to do things different. So I think talent, sustainability, profitability, technology evolving against expectations that are rising by the day. They all require collaborative thinking. So we are stronger together than trying to solve the problems on by ourselves. You know, this conference is very much about that. It's about being provocative, challenge the status quo, doing things differently, get people to think differently. Some really well thought leadership, individuals that will open the eyes. You know, the speakers will just drive so much of the conference and our thoughts. And I think, you know, it's all about, I think everyone can expect diverse voices, new ideas, conversations that will at the point maybe stretch the comfort zone and, and we are coming together to discuss those challenges so we can hopefully reimagine our profession and the way it operates moving forward so we make it better for the future. That's, that's kind of what it is all about. Yeah, absolutely. And, and why would you say now is the perfect time to really think about this way of innovating? We've been innovating for a while, but I think, you know, you take Brexit, you take Covid, you take all the lockdowns, you take the, the latest budgets by the governments. Those are all challenges. You take that against us, A, a workforce that expect us to be different. You, a guest that has rising expectations. There is a lot of competition growing. They've seen the bigger, the better the newer product all the time. We have to be working together to, to almost forget the competitive approach and just work together to drive a solution that is sustainable on the long run. And, and our team drives through it. Because if we can get our team driving our drive. Yeah, we just have to get that happening and, and our guests will be happy and all of that will, will, will come together. But you know, we've had the challenges of increases on taxes, your challenges, you know, wages, utilities. Covid. Yeah. It literally has been like every year there is another, another spanner that's thrown into the work. So we, you know, if we don't do it now, God, you know, we'll have another year of huge challenges and at the end of the year we'll say, God, I wish I would have done it. Yeah. So, you know, that's why we're doing it. We're doing it now. And, and yeah, you know, I think, you know, I believe, really believe that will be, will be a conference that will be talked about for, for many months after that. And you know, from, from what you say, it sounds like a very diverse offering. Because I was going to say sometimes when people think of innovation, they, they sort of target just one area or another, you know, especially technology. So, yeah. Would you say then this will make people think differently in terms of looking at the industry as a whole and all these different areas that, you know, you just mentioned. Now, when it comes to how they can innovate across the board and not just with tech, I think if we. Talk about innovation, innovation is not technology alone. I think we all know we look at technology because it's been the flavor of the month, of the flavor of the year, because that's what we've been talking about for a while. But I think innovation sometimes is really just having the courage to question what we assume that is Fixed and actually redesign it and redesign it with a thought process in mind and, and try to deliver, try to deliver better experiences for our team, our guests and so on. For me, it starts with us asking why and refusing the answer. That's because that's how we always done it. I think that that's, that's innovation on itself. We don't need of course, yet there is AI, there is technology, there is all of that, but just challenging the status quo and, and doing it differently than what we always done. It's, it's innovating. Yeah, yeah, I guess it goes back to, you know, what we said earlier about bringing kind of fresh ideas and perspectives to the table and, and seeing how, you know, how things can be reworked. Oh, we definitely want people to be contributing it, not just attending the conference, being completely honest. You know, if, if leaders, you know, that's a 10 hour conference leave with new relationships, they share the commitments, the actions that they tend to take it further, then the conference will be, will be, will be a good starting point, you know, and hopefully they will be able to go further. Because the challenges I always find with conferences is that a lot of people at our level tends to attend, but more often than not we probably too busy to share all the knowledge that we get from those conferences. So actually we need to be opening the doors to our teams to attend these conferences more sometimes than we do it ourselves because they will take it, it will help their development and it will help them developing for sure. And they will be more willing to share their ideas because they're taking part on the journey and they seen that we're atelier where hospitality coming together to, to, to kind of make this profession go further. So we have to open the doors, I think. But keeping that connection, keeping, keeping the learnings from the conference going further than just the days of the conference is really what, what we aspire to do. Yeah, yeah, well, you know, it sounds like a fantastic networking opportunity and, and I'm sure the impact will, you know, hopefully be felt, felt, felt throughout the next year and beyond. And I guess again, thinking ahead, networking in this way and being a part of this community, having these conversations. What else would your advice be for hoteliers in terms of how should they start thinking ahead in the ways that they can innovate in their own operations? What sort of strategies should they be looking at and what would your advice be when they start to look to the future and think, think how should we do things differently? Cool. I think if we take AI as an example, which is the subject that a lot of people are talking about. So we might as well just embrace it. I think AI should be about removing frictions, really. It should be about speeding up decisions, should be about allowing our team to actually spend more time with guests and with the human touch. AI shouldn't be about removing, moving the human touch. It should be actually enabling our team to have more time for the human touch. So we should start by kind of thinking, okay, well that's kind of the starting point, looking at AI on the point that it's going to save us a lot of money and so on. And it may well do. If it does, that's a great advantage for sure. But if we can utilize AI to remove the pain points from both from a guest journey as well from a team journey, and I would say we have to consider both. If we can remove those pain points, then actually, you know, our team will spend more time connecting with each other, connecting with the guests. If they connect with our guests, generally what happens, the guests will spend more. If they feel comfortable, they'll spend more. If they spend more, the business does better. So if they connect with their colleagues and they've got a stronger connection with their colleagues because the AI has removed the frictions and yeah, annoyances and the frustrations, then they will stay in the business longer because they're developing relationships, they're becoming friends more than just work colleagues. So actually take that as an example and in everything we do, I look, and I always say this when I look into the future is how can it make our guest journey better and our team journey better? Because if we can take those two do the rest is easy. Yeah, yeah. Falls into place and yeah, I think that's a, it's a sentiment, you know, we've heard from a few people now. But it's the importance of looking at AI not in a fear of will it detract from the human experience, but how it can, you know, embellish it and give that time back. Instead of being on the phone 50 times a day, you've got the technology that sends you a notification or it creates a task or wherever is without you having to pick up the phone, get distracted from your day to day, whatever you are doing and it speeds up the process of delivery. We should definitely be embracing it so we can actually spend the time doing things that we really enjoy. No, it makes complete sense. It seems like a win win, but no, it's a very interesting area indeed to see, see how that develops and I guess it kind of touches on My, my next question, which was going to be, is there do you think the right balance between innovation and, you know, the traditional world of hotels? Kind of in a broad sense, is there a right balance? Is it important to still. To not innovate to such an extent it might alienate guests? What is your opinion on that? I think it has to be fit for purpose. A lot of times we, we put technology in place, we build apps, we do A, B, C and D, and we think that's what our guests want. A lot of times we don't ask our guests what they actually want, but we think, oh, it's quite nice. I used. Should be something really positive and I want to bring it into our business. I think, ask our guests, ask our team what challenges do they have and what technology, what being AI or something else, can be brought into the business and then fix their pain points by bringing that technology or, or process or wherever you bring into it, opposed to doing for the sake of doing it? You know, we think we know the answers. Most of the time, the answers are in front of our faces. We're just probably not asking the right people about this. Yeah, yeah, I think, you know, ask your team what's what, what's the pain points and what would make their life easier. You know, often in any job, I take my first questions to any of the team is, how can I help? You know, and it's a very simple question and you get a variant, varied responses for sure, but people then actually go, okay, yeah, yeah, you could help me if you do this, this, this and this. And reality is you probably can't solve it every challenge, but if you solve one, you've gained a trust, you help them on the journey, will make their life easier and they will do more for you. So, yeah, ask people, ask people what, what would make their life easier or better. And that's our guests, our team, our suppliers, everyone, the entire cycle. I, you know, I was going to ask, you know, where perhaps hoteliers do sometimes get it slightly wrong when it comes to, to looking to innovate their own operations. And so, you know, obviously communication is, is vital. Like you say, are there any other areas where you think that could be addressed? And, you know, your advice for those who are looking to start this journey of innovation? I mean, I think balancing the innovation and, and the traditional elements of hospitality are quite key. Going back to what I said, it should be about bringing more time, giving more time to people to spend time with their guests and their team. We don't want just tasks to be automated for the sake of being automated. I think. Don't follow trends just because you've seen it somewhere else. See it if it actually applies to your business, does it work for you? Does it work in your environment? Don't do it just because you've utilized in a different company. Do it because it actually fits and it solves the problem or it makes the problem be easier. But don't do it for the sake of doing. Don't do it because you've seen someone else doing it. Do all the details. Spend a lot more time investigating and analyzing it. So actually you don't have to then go back in the process and then make sure, sure you spend the time implementing it correctly. So. But don't go to OTT unless that's what your business does. You know, I, I stayed in an hotel, I won't name it for sure, a few years ago on a technology conference, to be fair, and we were staying in this hotel and you know, it had tech for everything from the light switches to the blinds to, to, to everything. Right. And toward the room service. It had a QR code, you could read your menu and so on. And then you would think, okay, well they've gone all these way, right? They've got technology for everything. But then to place the order for room service, you then needed to call. So you thought about the entire process and then you think how people can just order without speaking to anyone. So you've made everything for people not to speak to anyone, but then you need someone on the other end to take a phone call. And I think it's great advice what you say as well. You know, really thinking about one's own operations and how that fits because, you know, we have a variety of listeners from, from independents to the big names. And yeah, I guess that is important to, to really think about. It's not a one cup fits all solution. You have to define the problem and then you will look at the solutions to see if it fixes that problem. Otherwise there's no point to do it. Yeah, yeah, exactly, exactly. And, and so looking ahead into 20, 26 and beyond, I wanted to ask you what trends you see as defining the industry in, in the coming year? What are you excited about in terms of change and innovation that, you know, we've spoken about and. Yeah. What would your advice be for hoteliers to adapt to these. Yeah, I mean, even more than AI, I think, I think definitely I can see the trend that people are looking for. Even more personalization, even more connection, proper storytelling. Our Guests have higher expectations when it comes to the service delivery because there is, they've experienced more, they've seen more. It has become a lot more accessible for people to experience great, great service and, and great properties. I think people, our, our guests will be looking for those deep connections more so than the billion pounds that you've spent on a new development. They will be looking actually for the connection. Does it feel human? I think we'll see that more over the next few years than probably we have seen particularly since COVID but I think we will see even more. I think know they will be looking for experiences that give both the human connection as well as are commercially viable and price point is not too extravagant in a way. I think that's typically where I would say I think there's sustainability obviously easier to stay and, and, and better businesses embrace it pretty quickly and, and there are some very, very good specialists out there that can help them. But definitely that human connection, particularly in a world of AI, particularly in a world where you, you can go to ChatGPT and, and ask them what best hotels to stay, what, what to do and so on. You want them to have the connection and, and be there to read the guests and read, read the profile of your team too. So you're there to provide the service if they want to and if they don't want then just leave them alone too. So it's, it's about giving your guests what they really want? Yeah, yeah, yeah, I guess. Would you say that's in some ways a matter of intuition, just understanding what. And that's where AI, dare I say I might be proven wrong in 12 months or so, but I don't think AI will, will ever, will ever have this 100% correct. It may help, but I don't think be 100% correct. So that intuition, that reading of body language, that connection, that conversation is really what makes what will continue to make our industry succeed moving forward. Forward? Yeah, yeah, it's, it's the soul of the industry, I guess, isn't it that, that human touch and communication and, and just finally, you know, thinking back to, you know, the great work that Master in Holders does with, with young people and future leaders, I just wanted to ask you what in your opinion makes the great leaders of tomorrow and, and what gives you confidence in, you know, the, the future of the industry and you know, obviously I'm sure some great lessons will be learned from, from the upcoming conference and yeah, what excites you about that generation? I think the leaders of tomorrow, the ones that will try will be the ones that are emotionally intelligent. It plays a lot more now than, than he used to do many years back. They will be, ideally they will be tech savvy. There will be, they will know technology. They might not be specialists, but they will know technology. But they will be genuinely focused on people. They won't do it for the sake of doing. They will do it because they really care about their people. So they will lead with responsibility probably, rather than ego. And I guess, you know, what really gives me the confidence is that we've got an emerging generation that is entering our industry, our profession, and they, they are, they focus on values. They, they, they push a lot more for it. They don't do it just because you tell them to do it. They, the status quo. They're unafraid of challenging it and, and you know, almost unafraid of the consequences of challenging too. Yeah. And they are determined to, to make our profession better. Better for them and for the next generation too. So that to me, although at times is difficult to manage, for sure. It's, it's, it's incredible to see and, and will shape our industry moving forward. And yeah, I'm, I'm, I'm delighted to see it. More and more of it. Yeah. Yeah, fantastic. It's, you know, good to see this, this positivity and it will be really, really exciting to see, you know, the generations ahead in the industry. It's wonderful for sure. And finally, we finish each episode with a question left by the previous guest. And our last guest was Natalia Dainty, who's learning and development manager at Valor Hospitality. She asked, how would you use AI when it comes to developing your teams? That's, I mean, the world of AI. I think what AI can provide you, can provide you knowledge, can help you to find the responses a lot quicker in most cases and can help you define career pathways, can help you define different journeys, different courses, different training modules, different elements. AI won't teach you the emotional intelligence, but it might tell you, you how to react in certain cases. And that will, will be helpful too. So I think it's utilizing AI going back to what I say to, to remove the frictions of, of training. Is it, is it providing access a lot quicker, a lot easier? And if it is, then utilize AI to provide training and to make it easier for people to access at any point and, and so on. And if it isn't removing a friction, then just kind of embrace it, I don't think. Unless that's what your business does. Yeah, yeah, it's interesting to think about, you know, the ways in which you can use AI smartly. That's the key. And yeah. Finally, Francisco, do you have a question to leave for our next guest? I mean, I don't know exactly who that guest will be, but I guess if they could resist design one aspect, just one aspect of the Autel culture that everyone's current accepts as normal, what would that be? And I'm quite interested to, to then listening to what's going to be the answers because I'm sure we'll vary and we'll touch in different subjects. Yeah, yeah, yeah, that's a great question. It would be a really interesting to hear. Yeah. The other, the other guests perspective on that. Sure. Francisco, thank you so much for joining us. It's been great speaking with you. Thank you so much. Thanks for having me. It's been a pleasure to speak to you and talk through all things hospitality. Thanks for listening to Checking In, a weekly podcast from hotel owner, the UK's trusted source of hotel industry news and analysis. If you like the podcast, make sure to subscribe on whichever podcast platform you listen to. To get more industry insight, head to hotel owner.co.uk and subscribe for unlimited access. If you're interested in sponsoring episodes of the podcast, drop us a line at podcast hotel owner.co.uk. Com.",
    "words": 7774,
    "confidence": 0.9664372,
    "audio_duration": 2881
  },
  "utterances": [
    {
      "speaker": "A",
      "text": "Welcome to Checking In, a weekly podcast from hotel owner, the UK's trusted source of hotel news and analysis. Each week we meet with seasoned hoteliers, industry insiders and hospitality entrepreneurs to share the real stories, lessons and ideas behind what makes great hospitality work. We'll unpack the decisions behind the success stories, the mistakes that shaped them, and what you can learn from their experience. If you like the podcast, make sure to subscribe on your podcast platform of choice and for more information, visit hotelowner.co.uk or drop us a line at podcastotelowner.co.uk hi, I'm Heather, host of this episode where we speak to Francisco Macedo, COO of Pavilion Club and Wilderness Reserve and chair of the Master Inn Holders upcoming Hotel Leadership Conference. Francisco discussed what we mean by the 2026 conference theme of Stronger Together, Breaking the mold, the key to navigating innovation and balancing tradition and transformation, and how intuition and empathy will define the leaders of tomorrow. Hi Francisco, welcome to Checking in and thank you for joining us.",
      "start": 6960,
      "end": 76450,
      "confidence": 0.97936046
    },
    {
      "speaker": "B",
      "text": "Well, thanks for having me. It's a pleasure to be here. Definitely one that, you know, I look forward to it having, having listened to it quite a lot of the previous, previous guests that you had. It's a pleasure to be here.",
      "start": 77010,
      "end": 90830,
      "confidence": 0.93454665
    },
    {
      "speaker": "A",
      "text": "Glad to hear it, Glad to hear it. Thank you so much. So, yeah, to, to start with, can you tell us what originally drew you to the industry and take us through your career journey and earlier roles, one.",
      "start": 90910,
      "end": 105550,
      "confidence": 0.9787069
    },
    {
      "speaker": "B",
      "text": "That probably most of you would never imagine unless you really know. I mean, as a child I always wanted to go to university medicine. I, so I didn't want to study hospitality. In fact, my parents told me all the time not to do so, so I, and, and you know, I really wanted to go to university. I had that mindset. But actually with my studies, at the same time I was studying, I was always kind of working in hospitality to earn some pocket money, as a lot of people do. And I think very quickly I realized that actually I really like the buzz, I really like the, the connection with people, new languages, all of that was kind of interesting and you know, I was meeting people all the time, so it's really that, that's kind of how I ended up getting in, in the industry and to be fair, from a very kind of low level in terms of starting as a, as a waiter and polishing cutlery all day to then run plates, to then do, do all things related to, to, to, to hospitality. So, so yeah, yeah, yeah.",
      "start": 105550,
      "end": 172070,
      "confidence": 0.9748626
    },
    {
      "speaker": "A",
      "text": "And you know, it's, it's so true what you say you know, even with things, hospitality really opens up the world for young people, doesn't it? And I think presents opportunities that, you know, not necessarily every industry can, in its, in its unique way. Can you take us more through some of the, the early roles you held and what that looked like in terms of progression, you know, after you got that, that taste for, for hospitality and the buzz at, you know, a young age?",
      "start": 172070,
      "end": 196690,
      "confidence": 0.971393
    },
    {
      "speaker": "B",
      "text": "Ah, God, I literally did everything within an rtel operation from polishing cutlery all day, as I, as I mentioned to, you know, being running plates into tables, carrying trays, all that kind of thing. Clearing floors, housekeeping, pot wash, reception, all areas really. And, you know, I always say, and for sure I learned something across every single, every single rule, I think is that wide experience that actually gave me, give me a different perspective in everything that I do today, because I tend to think that I understand it. I might not be a perfect at it, but I understand it. I understand the processes and why people do certain things the way they do. But literally having worked across, you know, across the entire, entire departmental organization of an autel, it gave me, gave me a huge, huge skill, huge knowledge, for sure.",
      "start": 196930,
      "end": 259800,
      "confidence": 0.9392491
    },
    {
      "speaker": "A",
      "text": "Yeah. Yeah. And would you say, I guess, you know, when it comes to, you know, leading teams now as you do, does that experience and background, do you think that's beneficial in the sense of building trust with your team? Because they know that you understand the, you know, the trials and the tribulations and, and you've been in these positions and had these perspectives. Does that benefit culture?",
      "start": 259960,
      "end": 283780,
      "confidence": 0.98315895
    },
    {
      "speaker": "B",
      "text": "In some ways, for sure, I, I think, you know, it's. You meet a new team and, and you start talking to them and, and you don't have to tell them that you actually did the job or whatever it may be. You, as soon as you start talk the same language, people trust you. People trust that you know what you're talking about. You're not just making it up. You just didn't. You know, some people have this perception that, you know, general managers, directors, whatever title you have when you are at the top, that, you know, somehow you got there, but you're not quite sure how, how, what to do in each of these roles. But as soon as you start talking the same language and you're able to actually, you know, talk a few elements of it and they understand that you know what you're talking about. I think definitely the trust gets in and, and everything becomes easier. They will do more for you at that point because they, they believe in what you're saying at that point. It's very quick to get the trust when, when you do what you're talking about.",
      "start": 283780,
      "end": 344840,
      "confidence": 0.9665766
    },
    {
      "speaker": "A",
      "text": "Yeah, yeah. And I guess in terms of camaraderie, that that really helps as well. So, you know, you've been in the trenches together.",
      "start": 345320,
      "end": 351880,
      "confidence": 0.943532
    },
    {
      "speaker": "B",
      "text": "Yeah, for sure. I mean, we're, we're a lot more, as an industry, as a profession, it should be a lot more about camarade than should really be about higher hierarchy, isn't it? I think if you can get the team on your side because they understand your views, but they understand that you know what you're talking, then the job becomes a lot easier and a lot more fun, too. So it's not like, oh, I gonna ask him a question just because he is a boss. You're asking the question because you're actually interested in the response and the point of view and so on.",
      "start": 352600,
      "end": 384100,
      "confidence": 0.94993293
    },
    {
      "speaker": "A",
      "text": "Yeah, brilliant. And I guess, you know, looking back at your career to date, were there any particular roles or moments or experiences that were most pivotal to defining where you are today? Or is that hard to say? Was, was each experience beneficial in its own right?",
      "start": 384500,
      "end": 404490,
      "confidence": 0.9765718
    },
    {
      "speaker": "B",
      "text": "I think each experience is beneficial on its own. Right. But without a doubt, probably the, the experiences where the pressure was extremely high and a small mistake could probably have a huge impact. Probably the ones that I kind of learned the most, and that goes from repositioning properties, you know, it taught me to. That you have to build a culture, you know, you have to get the team to believe in you. And, and before any results even appear, you know, to food and beverage, you know, taught me that you have to be. Your humility, your way you work with the team is very important because, I mean, ultimately, you can't deliver on your own. You need chefs, you need, you need the team delivering the food, you need, you need everyone coming together. And then, I guess leading luxury hotels has told me that leadership is a lot more about responsibility than it is about visibility. And I think you learn the most when your choices actually really matter and makes a difference. So I've learned across all of them, but certainly under pressure, I always felt that's where I learned the most.",
      "start": 404570,
      "end": 477760,
      "confidence": 0.95940614
    },
    {
      "speaker": "A",
      "text": "Yeah, I, I guess on a similar note, I suppose I, I was going to ask, you know, if there are any sort of particular challenges along the way, is there anything that stands out?",
      "start": 478380,
      "end": 486780,
      "confidence": 0.95037204
    },
    {
      "speaker": "B",
      "text": "I mean, I, I, there, There has been so many challenges. You know, you, you, when you try and operate hotels in different countries, different continents, there is a culture challenge, there is a, A legal challenge, there is political influence. There is so many. But I think you Know, at, at times. And you know, I became a restaurant. 19, 19 years old, restaurant manager for five star property. That was a challenge because, you know, people and, and my, my, my team was all much older than I was and had a, I guess you could say they had a lot more years of experience that they had too. So, so, you know, it becomes quite tricky at points. And I remember I had a director of restaurants, which now is a great friend. And he, he told me on kind of my first day or second day, he told me British could people like you and kids like you. Actually, that's how he kind of used it. He said, kids like you will come and go and I'm still going to be here, so just get on with it. And you know, he had worked for the business for over 30 years and, and, and you know, to be fair, he was right. You know, people would come and go.",
      "start": 486860,
      "end": 572090,
      "confidence": 0.95889
    },
    {
      "speaker": "A",
      "text": "Yeah.",
      "start": 572170,
      "end": 572650,
      "confidence": 0.9217122
    },
    {
      "speaker": "B",
      "text": "And he would still stick around. So. So you have to bring all these people on the journey with you.",
      "start": 572890,
      "end": 578330,
      "confidence": 0.95246583
    },
    {
      "speaker": "A",
      "text": "Yeah.",
      "start": 578490,
      "end": 578970,
      "confidence": 0.9895833
    },
    {
      "speaker": "B",
      "text": "And, and you have to get them to trust you, irrespective of the age gap or, or wherever it is. And I think, you know, back 20, 25 years ago, this was a lot harder than perhaps it is today. Definitely 25 years ago, coming from Madeira Islands, small islands, and you know, having that sort of impact where people have been in the industry for many, many years before they became managers and you, you are the kid on the block and suddenly you are the boss as well. So, yes, it's quite, yeah, quite challenging. Let's put it on.",
      "start": 578970,
      "end": 615630,
      "confidence": 0.95909864
    },
    {
      "speaker": "A",
      "text": "Oh, baptism by fire. And what was your own approach to getting people on that journey with you and building that trust back then? How did you navigate that?",
      "start": 615940,
      "end": 626980,
      "confidence": 0.97175545
    },
    {
      "speaker": "B",
      "text": "Personally, I think, I think I've gone through different stages of my life and, and you know, it teaches you a few lessons along the way. Yeah, I've gone from. You have to be very autocratic and you just literally tell them and dictated to some extent and you tell them exactly what you want them doing and you hope that they deliver and then they don't deliver and then you get really frustrated and you're not sure as to why. And I think, you know, I did that very much at the beginning of my career and then, then I think over the years you kind of learned that you have to take people on the journey, you have to share your vision, you might still want them to achieve what you want them to achieve, but you almost have to instill them that idea. You have to show them what that may look like and you have to gain Their tr. Because if you've got their trust and you kind of try and shape their decision or their thought process, somehow they will, they will trust what you saying and they want and they will do it because they feel is the right way to do it and is the right thing to do. Yeah, but I think, you know, take, take people on the journey, build a relationship with them. Is, is probably, probably what I've learned over the years that, you know, I'm lucky enough that I've got, got a lot of team members over the years that I have worked with me for many years in, in a variety of different roles in a variety of different companies, businesses, countries even. And, and that's only happened because, because I trust them, they trust me, and I took the time to listen to them and a lot of the great ideas came from, came from the, the more junior positions, not necessarily from my bosses, I guess.",
      "start": 626980,
      "end": 735260,
      "confidence": 0.96926916
    },
    {
      "speaker": "A",
      "text": "Yeah, I think there's something to be said for fresh perspectives and new ideas as well in that sense.",
      "start": 735660,
      "end": 741460,
      "confidence": 0.9780616
    },
    {
      "speaker": "B",
      "text": "Yeah. I had a manager that used to tell me, you know, you always learn something from lazy people. At the time, I didn't quite understand exactly what he was saying. I was like, oh, what you're trying to say, look, Francisco or fm, most lazy people will find the quickest way to do it. So if you can learn something from them, learn the quickest way to do it.",
      "start": 741460,
      "end": 766220,
      "confidence": 0.97103244
    },
    {
      "speaker": "A",
      "text": "That's, I was like, yeah, okay, that's, that's excellent advice. Actually, I've never thought of that, but that's, yeah. Something to remember.",
      "start": 767580,
      "end": 775900,
      "confidence": 0.94261587
    },
    {
      "speaker": "B",
      "text": "I still haven't, I haven't learned that, that side of being lazy. But, but I, I think, you know, there is a lot to be said on, on the fact that a lot of people will find the quickest way to do it. And you know, as long as you do it legally, rightly, morally correct.",
      "start": 776620,
      "end": 791820,
      "confidence": 0.97275
    },
    {
      "speaker": "A",
      "text": "Yeah.",
      "start": 791820,
      "end": 792300,
      "confidence": 0.82747394
    },
    {
      "speaker": "B",
      "text": "Quickest way to do it and way to deliver quickest way to achieve results by bringing the people on the journey with you. All of that. I think, you know, something that I, you know, I still still remember, like if it was yesterday. And it's funny, but it's so true.",
      "start": 793800,
      "end": 811320,
      "confidence": 0.95404094
    },
    {
      "speaker": "A",
      "text": "Yeah, yeah, no, I, I, I love that. And, and before we move on, I just wanted to ask you a little bit about your, you know, your new role as CEO of Pavilion Club in Wilderness Reserve. Can you just tell us a little bit about that and what your new responsibilities are?",
      "start": 811480,
      "end": 827530,
      "confidence": 0.95399004
    },
    {
      "speaker": "B",
      "text": "Absolutely, I mean, responsible for everything and anything. I guess I always joke that you're responsible for everything and you're responsible for nothing. Because you do need the team to be there and deliver for you. Yeah. Recent role taken as you are of Wilderness Reserve in Suffolk and our Pavilion Clubs in London. And Pavilion Clubs is, I mean, it's, it's a very interesting concept. It's not your traditional members clubs. It's kind of where you, you could say is a blend between your office and your networking relationship and your social life all comes together. The reality is, we all know in our industry in general, in life now, we've become more friends with the people we work with than the people we don't work with. Right?",
      "start": 827530,
      "end": 880550,
      "confidence": 0.9608018
    },
    {
      "speaker": "A",
      "text": "Yeah.",
      "start": 880550,
      "end": 880910,
      "confidence": 0.84228516
    },
    {
      "speaker": "B",
      "text": "Because we spend a lot of time together and therefore we end up becoming friends naturally. So Pavilion, Pavilion kind of gives a little bit of that. You know, you can have your office in the buildings and then you've got the club which you can use to host friends, meet friends, do new business. So you've got a variety of different ways that you can explore the benefits of being in a club. But it becomes your home away from home. Yet is your office, yet is your, your space to network and build new connections. And I always joke that it's almost like, you know, if you're running a big business and you've got several departments, imagine that, Wind Pavilion, you can have all those several departments, even if you just have a small business, because what is next door to you might be, might be someone that does something that actually it could help you on your long run. You know, it could be a business that you could be. End up working in partnership with. So it opens a lot of, of those naturally without having to worry about, okay, I have to go out and source a new partner or a new business to help me to deliver something for a client. And you know, all the events that we do, people networking, connecting, and generally there is this sense of, yeah, this sense of connection camaraderie, which is, which is more important than any, I guess, private members clubs per se. No, no disrespect, of course, you know, each brand and some very, very valid, powerful brands out there. But I think we just do something a bit different. And it's interesting. You sit in a club and you listen to some of the conversations and is, is great, the buzz is great, the, the connections that are made is great. And then Wilderness is, is a world of its own. Huge resorts, 7,000 acres of lands, 27 properties from ranging from one bedroom to 18 bedrooms, very top luxury hu of service provided, yet can be done on your own, on your own environment, could be done in a venue, can be done in, in the field it can be, it can be anything. Open lakes, man made lakes, you know, swimming pools, sauna, steam rooms. In, in most of the properties, your own pool, your own hot tub, you're in all your, all your own comforts in a way. I tend to describe. It's almost like we have 27 hotels in the resorts because, because they quite. Yeah, a bit of everything really.",
      "start": 880910,
      "end": 1039509,
      "confidence": 0.9564279
    },
    {
      "speaker": "A",
      "text": "So yeah, fantastic. And you know, it's two, you know, quite, quite different operations there. How what is that experience like overseeing both, both Wilderness and, and Pavilion Club with being, being such different offerings for, for guests?",
      "start": 1039509,
      "end": 1056469,
      "confidence": 0.9614761
    },
    {
      "speaker": "B",
      "text": "I mean it's, it's fantastic. Yeah, we're very lucky. We've got a great team. We've got great owners who, who are very committed to the business and, and very inspirational really. I think you know, you sit with the owner for half an hour and you, your head is, is, is, is fine. You're getting new ideas by the second in a way. And, and you know, we've got a great team that is willing to, to almost do anything that it takes to make sure that the guest has the most amazing experience. Being that they're proposing, being that they're celebrating, being that they're doing, you know, they're just having some time away. If you take Wilderness. But then the same happens with Pavilion. Exactly the same. You know, the Pavilion Clubs, you know, the connections between our team and the, the lease holders of the offices or the members itself and we see them networking, having conversations all the time is so fantastic. You're kind of the buzz is real and that's, that's on both businesses. So we're lucky we've got great teams, we lucky we've got a great product which helps for sure. But, but yeah, no, he's, it's fantastic. And you know I sit in an office and I, I'm here at Wilderness at the moment and you're listening to, to the buzz and the conversations and the discussions and, and you're learning every single second about themselves even. Yeah, so it's, it's, it's incredible I.",
      "start": 1056469,
      "end": 1149150,
      "confidence": 0.9641603
    },
    {
      "speaker": "A",
      "text": "Guess kind of on the subject of, of networking. To move on, I wanted to ask you a master in Holders and yeah, for listeners who may not know, explain a bit more about this community and the, you know, the benefits it has for, for people in the, in the hotel industry.",
      "start": 1149150,
      "end": 1166810,
      "confidence": 0.98376155
    },
    {
      "speaker": "B",
      "text": "I mean mastering Holders is, is very much what, what some would say the creme de la creme is. You know, the, the, the best is, is about being the best ateliers in the country. And is, but it is very much a community, a community that's generally and genuinely wants to, to promote people and, and to promote our profession to others. You know, I sit on the boards of the Master and Holders. Obviously I'm organizing the conference, but sitting on the board it gives me the opportunity to help shape the future of our profession, our industry. And I see it, I guess I could say I see it as a privilege to, to be there, but as a huge responsibility too. And you know, I want definitely I want more leaders to be applying to become a Master in Holder so they can join our community, so they can help us spread the word so that we can help more people going through the ranks and profess progressing through the ranks in our industry and our profession and share the best practices. You know, it's challenging, It's a challenging industry in general. So we have to work together, we have to do everything together to raise the standards and to drive our profession and promote it. Certainly a priority of mine is definitely widening the access to the Master and Holders, but also the talent as we know exists everywhere. There is plenty of talents in our profession across the country, but there aren't many opportunities for them to progress or learn or develop it. And Master Holders provides these platforms for mentoring, provides you a platform of scholarships. And we are constantly and actively raising funds to support the scholarships, hence the conference. So we can hopefully get funds to support the scholarships that will then send what we would call the rising managers to institutions such as Cornell and Cranfield University. I mean that's an opportunity of a lifetime. I've attended Cornell and I can't tell you how much that has changed my career. But also my, the camaraderie, the connections that I've built. You know, I've got 40, 43 people that attended Cornell at the same time I did. And you know, to these days we drop a question on, on our WhatsApp group and we've got an answer within, within seconds of someone that faced a problem and has faced a similar problem, similar challenge or similar strategy or software or whatever may be. So it's definitely opening the doors. We want these programs to be changing the trajectory of a lot of our young rising managers that are coming through the ranks. And we want them to have the support and the knowledge to be able to move quickly and accelerate their capability and confidence really, which hopefully they then go and do the same. They then try and do the same, raise funds and then inspire others to join our profession and go into study, further our hospitality and continue to progress it's kind of, you know, we, you know, mastering holders really gives us that opportunity of, of getting hospitality professionals together to raise our standards, create opportunities for, for people across the industry. And, and yeah, quite frankly, you know, in the nicest possible way, it should be seen as a movement that is dedicated to drive excellence and collective growth. We're not interested on ourselves. We're interested in promoting the industry so we can, so more people can, can rise through the ranks with the right level of skill and knowledge.",
      "start": 1167130,
      "end": 1403590,
      "confidence": 0.96357316
    },
    {
      "speaker": "A",
      "text": "Yeah, fantastic. And you know, like you say, it's, it gives people that support that will stay with them throughout their, their careers and their lives and, and what a wonderful movement, like you say. And I know you just mentioned the conference there, so I wanted to touch on that a bit more as I know your chair.",
      "start": 1403830,
      "end": 1420630,
      "confidence": 0.9767501
    },
    {
      "speaker": "B",
      "text": "Yeah.",
      "start": 1421190,
      "end": 1421550,
      "confidence": 0.9900716
    },
    {
      "speaker": "A",
      "text": "Can you tell us more about this year's theme, which I believe is Stronger Together, Breaking the Mold.",
      "start": 1421550,
      "end": 1427230,
      "confidence": 0.9625267
    },
    {
      "speaker": "B",
      "text": "Can you.",
      "start": 1427550,
      "end": 1428030,
      "confidence": 0.97802734
    },
    {
      "speaker": "A",
      "text": "Yeah. Tell us what that means and, and what we can expect from next year?",
      "start": 1428030,
      "end": 1431950,
      "confidence": 0.9638238
    },
    {
      "speaker": "B",
      "text": "Yeah, very much. Stronger Together, Breaking the Molds. I mean, it's a huge pleasure to be the chair of, of the conference. It's something I always aspire to do. Going back to giving back to, to the industry, you know, it was something that I definitely wanted to do having, having benefited from funds that were raised through, through the com. Through the conference in previous years. The team is really what it is all about. I mean, you know, the secret is there is, is, you know, it's all about we need to get together to, to face the biggest challenges that we've got in our profession and our industry. We cannot be solving them on our. By ourselves. We, we know that, you know, so we are stronger together, but we also have to know that we have to start doing things differently. Otherwise if we do what we always done, we're always going to get the same results. So I have to do things different. So I think talent, sustainability, profitability, technology evolving against expectations that are rising by the day. They all require collaborative thinking. So we are stronger together than trying to solve the problems on by ourselves. You know, this conference is very much about that. It's about being provocative, challenge the status quo, doing things differently, get people to think differently. Some really well thought leadership, individuals that will open the eyes. You know, the speakers will just drive so much of the conference and our thoughts. And I think, you know, it's all about, I think everyone can expect diverse voices, new ideas, conversations that will at the point maybe stretch the comfort zone and, and we are coming together to discuss those challenges so we can hopefully reimagine our profession and the way it operates moving forward so we make it better for the future. That's, that's kind of what it is all about.",
      "start": 1432190,
      "end": 1566300,
      "confidence": 0.9653017
    },
    {
      "speaker": "A",
      "text": "Yeah, absolutely. And, and why would you say now is the perfect time to really think about this way of innovating?",
      "start": 1566940,
      "end": 1573940,
      "confidence": 0.97028923
    },
    {
      "speaker": "B",
      "text": "We've been innovating for a while, but I think, you know, you take Brexit, you take Covid, you take all the lockdowns, you take the, the latest budgets by the governments. Those are all challenges. You take that against us, A, a workforce that expect us to be different. You, a guest that has rising expectations. There is a lot of competition growing. They've seen the bigger, the better the newer product all the time. We have to be working together to, to almost forget the competitive approach and just work together to drive a solution that is sustainable on the long run. And, and our team drives through it. Because if we can get our team driving our drive. Yeah, we just have to get that happening and, and our guests will be happy and all of that will, will, will come together. But you know, we've had the challenges of increases on taxes, your challenges, you know, wages, utilities. Covid. Yeah. It literally has been like every year there is another, another spanner that's thrown into the work. So we, you know, if we don't do it now, God, you know, we'll have another year of huge challenges and at the end of the year we'll say, God, I wish I would have done it.",
      "start": 1575060,
      "end": 1663920,
      "confidence": 0.9621826
    },
    {
      "speaker": "A",
      "text": "Yeah.",
      "start": 1664400,
      "end": 1664960,
      "confidence": 0.8655599
    },
    {
      "speaker": "B",
      "text": "So, you know, that's why we're doing it. We're doing it now. And, and yeah, you know, I think, you know, I believe, really believe that will be, will be a conference that will be talked about for, for many months after that.",
      "start": 1665920,
      "end": 1680520,
      "confidence": 0.9613359
    },
    {
      "speaker": "A",
      "text": "And you know, from, from what you say, it sounds like a very diverse offering. Because I was going to say sometimes when people think of innovation, they, they sort of target just one area or another, you know, especially technology. So, yeah. Would you say then this will make people think differently in terms of looking at the industry as a whole and all these different areas that, you know, you just mentioned. Now, when it comes to how they can innovate across the board and not just with tech, I think if we.",
      "start": 1680840,
      "end": 1710850,
      "confidence": 0.9779939
    },
    {
      "speaker": "B",
      "text": "Talk about innovation, innovation is not technology alone. I think we all know we look at technology because it's been the flavor of the month, of the flavor of the year, because that's what we've been talking about for a while. But I think innovation sometimes is really just having the courage to question what we assume that is Fixed and actually redesign it and redesign it with a thought process in mind and, and try to deliver, try to deliver better experiences for our team, our guests and so on. For me, it starts with us asking why and refusing the answer. That's because that's how we always done it. I think that that's, that's innovation on itself. We don't need of course, yet there is AI, there is technology, there is all of that, but just challenging the status quo and, and doing it differently than what we always done. It's, it's innovating.",
      "start": 1710850,
      "end": 1771410,
      "confidence": 0.9678464
    },
    {
      "speaker": "A",
      "text": "Yeah, yeah, I guess it goes back to, you know, what we said earlier about bringing kind of fresh ideas and perspectives to the table and, and seeing how, you know, how things can be reworked.",
      "start": 1771890,
      "end": 1782130,
      "confidence": 0.98609644
    },
    {
      "speaker": "B",
      "text": "Oh, we definitely want people to be contributing it, not just attending the conference, being completely honest. You know, if, if leaders, you know, that's a 10 hour conference leave with new relationships, they share the commitments, the actions that they tend to take it further, then the conference will be, will be, will be a good starting point, you know, and hopefully they will be able to go further. Because the challenges I always find with conferences is that a lot of people at our level tends to attend, but more often than not we probably too busy to share all the knowledge that we get from those conferences. So actually we need to be opening the doors to our teams to attend these conferences more sometimes than we do it ourselves because they will take it, it will help their development and it will help them developing for sure. And they will be more willing to share their ideas because they're taking part on the journey and they seen that we're atelier where hospitality coming together to, to, to kind of make this profession go further. So we have to open the doors, I think. But keeping that connection, keeping, keeping the learnings from the conference going further than just the days of the conference is really what, what we aspire to do.",
      "start": 1782370,
      "end": 1870260,
      "confidence": 0.9738692
    },
    {
      "speaker": "A",
      "text": "Yeah, yeah, well, you know, it sounds like a fantastic networking opportunity and, and I'm sure the impact will, you know, hopefully be felt, felt, felt throughout the next year and beyond. And I guess again, thinking ahead, networking in this way and being a part of this community, having these conversations. What else would your advice be for hoteliers in terms of how should they start thinking ahead in the ways that they can innovate in their own operations? What sort of strategies should they be looking at and what would your advice be when they start to look to the future and think, think how should we do things differently?",
      "start": 1870500,
      "end": 1906080,
      "confidence": 0.9787965
    },
    {
      "speaker": "B",
      "text": "Cool. I think if we take AI as an example, which is the subject that a lot of people are talking about. So we might as well just embrace it. I think AI should be about removing frictions, really. It should be about speeding up decisions, should be about allowing our team to actually spend more time with guests and with the human touch. AI shouldn't be about removing, moving the human touch. It should be actually enabling our team to have more time for the human touch. So we should start by kind of thinking, okay, well that's kind of the starting point, looking at AI on the point that it's going to save us a lot of money and so on. And it may well do. If it does, that's a great advantage for sure. But if we can utilize AI to remove the pain points from both from a guest journey as well from a team journey, and I would say we have to consider both. If we can remove those pain points, then actually, you know, our team will spend more time connecting with each other, connecting with the guests. If they connect with our guests, generally what happens, the guests will spend more. If they feel comfortable, they'll spend more. If they spend more, the business does better. So if they connect with their colleagues and they've got a stronger connection with their colleagues because the AI has removed the frictions and yeah, annoyances and the frustrations, then they will stay in the business longer because they're developing relationships, they're becoming friends more than just work colleagues. So actually take that as an example and in everything we do, I look, and I always say this when I look into the future is how can it make our guest journey better and our team journey better? Because if we can take those two do the rest is easy.",
      "start": 1906320,
      "end": 2027100,
      "confidence": 0.96028936
    },
    {
      "speaker": "A",
      "text": "Yeah, yeah. Falls into place and yeah, I think that's a, it's a sentiment, you know, we've heard from a few people now. But it's the importance of looking at AI not in a fear of will it detract from the human experience, but how it can, you know, embellish it and give that time back.",
      "start": 2027100,
      "end": 2046380,
      "confidence": 0.97928727
    },
    {
      "speaker": "B",
      "text": "Instead of being on the phone 50 times a day, you've got the technology that sends you a notification or it creates a task or wherever is without you having to pick up the phone, get distracted from your day to day, whatever you are doing and it speeds up the process of delivery. We should definitely be embracing it so we can actually spend the time doing things that we really enjoy.",
      "start": 2047180,
      "end": 2073319,
      "confidence": 0.9616499
    },
    {
      "speaker": "A",
      "text": "No, it makes complete sense. It seems like a win win, but no, it's a very interesting area indeed to see, see how that develops and I guess it kind of touches on My, my next question, which was going to be, is there do you think the right balance between innovation and, you know, the traditional world of hotels? Kind of in a broad sense, is there a right balance? Is it important to still. To not innovate to such an extent it might alienate guests? What is your opinion on that?",
      "start": 2074119,
      "end": 2108740,
      "confidence": 0.972665
    },
    {
      "speaker": "B",
      "text": "I think it has to be fit for purpose. A lot of times we, we put technology in place, we build apps, we do A, B, C and D, and we think that's what our guests want. A lot of times we don't ask our guests what they actually want, but we think, oh, it's quite nice. I used. Should be something really positive and I want to bring it into our business. I think, ask our guests, ask our team what challenges do they have and what technology, what being AI or something else, can be brought into the business and then fix their pain points by bringing that technology or, or process or wherever you bring into it, opposed to doing for the sake of doing it? You know, we think we know the answers. Most of the time, the answers are in front of our faces. We're just probably not asking the right people about this. Yeah, yeah, I think, you know, ask your team what's what, what's the pain points and what would make their life easier. You know, often in any job, I take my first questions to any of the team is, how can I help? You know, and it's a very simple question and you get a variant, varied responses for sure, but people then actually go, okay, yeah, yeah, you could help me if you do this, this, this and this. And reality is you probably can't solve it every challenge, but if you solve one, you've gained a trust, you help them on the journey, will make their life easier and they will do more for you. So, yeah, ask people, ask people what, what would make their life easier or better. And that's our guests, our team, our suppliers, everyone, the entire cycle.",
      "start": 2108740,
      "end": 2217740,
      "confidence": 0.9750506
    },
    {
      "speaker": "A",
      "text": "I, you know, I was going to ask, you know, where perhaps hoteliers do sometimes get it slightly wrong when it comes to, to looking to innovate their own operations. And so, you know, obviously communication is, is vital. Like you say, are there any other areas where you think that could be addressed? And, you know, your advice for those who are looking to start this journey of innovation?",
      "start": 2217980,
      "end": 2241790,
      "confidence": 0.9854417
    },
    {
      "speaker": "B",
      "text": "I mean, I think balancing the innovation and, and the traditional elements of hospitality are quite key. Going back to what I said, it should be about bringing more time, giving more time to people to spend time with their guests and their team. We don't want just tasks to be automated for the sake of being automated. I think. Don't follow trends just because you've seen it somewhere else. See it if it actually applies to your business, does it work for you? Does it work in your environment? Don't do it just because you've utilized in a different company. Do it because it actually fits and it solves the problem or it makes the problem be easier. But don't do it for the sake of doing. Don't do it because you've seen someone else doing it. Do all the details. Spend a lot more time investigating and analyzing it. So actually you don't have to then go back in the process and then make sure, sure you spend the time implementing it correctly. So. But don't go to OTT unless that's what your business does. You know, I, I stayed in an hotel, I won't name it for sure, a few years ago on a technology conference, to be fair, and we were staying in this hotel and you know, it had tech for everything from the light switches to the blinds to, to, to everything. Right. And toward the room service. It had a QR code, you could read your menu and so on. And then you would think, okay, well they've gone all these way, right? They've got technology for everything. But then to place the order for room service, you then needed to call. So you thought about the entire process and then you think how people can just order without speaking to anyone. So you've made everything for people not to speak to anyone, but then you need someone on the other end to take a phone call.",
      "start": 2241950,
      "end": 2360410,
      "confidence": 0.97216994
    },
    {
      "speaker": "A",
      "text": "And I think it's great advice what you say as well. You know, really thinking about one's own operations and how that fits because, you know, we have a variety of listeners from, from independents to the big names. And yeah, I guess that is important to, to really think about. It's not a one cup fits all solution.",
      "start": 2360650,
      "end": 2380230,
      "confidence": 0.9680555
    },
    {
      "speaker": "B",
      "text": "You have to define the problem and then you will look at the solutions to see if it fixes that problem. Otherwise there's no point to do it.",
      "start": 2380870,
      "end": 2387270,
      "confidence": 0.9777919
    },
    {
      "speaker": "A",
      "text": "Yeah, yeah, exactly, exactly. And, and so looking ahead into 20, 26 and beyond, I wanted to ask you what trends you see as defining the industry in, in the coming year? What are you excited about in terms of change and innovation that, you know, we've spoken about and. Yeah. What would your advice be for hoteliers to adapt to these.",
      "start": 2387350,
      "end": 2412400,
      "confidence": 0.9669367
    },
    {
      "speaker": "B",
      "text": "Yeah, I mean, even more than AI, I think, I think definitely I can see the trend that people are looking for. Even more personalization, even more connection, proper storytelling. Our Guests have higher expectations when it comes to the service delivery because there is, they've experienced more, they've seen more. It has become a lot more accessible for people to experience great, great service and, and great properties. I think people, our, our guests will be looking for those deep connections more so than the billion pounds that you've spent on a new development. They will be looking actually for the connection. Does it feel human? I think we'll see that more over the next few years than probably we have seen particularly since COVID but I think we will see even more. I think know they will be looking for experiences that give both the human connection as well as are commercially viable and price point is not too extravagant in a way. I think that's typically where I would say I think there's sustainability obviously easier to stay and, and, and better businesses embrace it pretty quickly and, and there are some very, very good specialists out there that can help them. But definitely that human connection, particularly in a world of AI, particularly in a world where you, you can go to ChatGPT and, and ask them what best hotels to stay, what, what to do and so on. You want them to have the connection and, and be there to read the guests and read, read the profile of your team too. So you're there to provide the service if they want to and if they don't want then just leave them alone too. So it's, it's about giving your guests what they really want?",
      "start": 2412800,
      "end": 2530890,
      "confidence": 0.9748467
    },
    {
      "speaker": "A",
      "text": "Yeah, yeah, yeah, I guess. Would you say that's in some ways a matter of intuition, just understanding what.",
      "start": 2531050,
      "end": 2537320,
      "confidence": 0.96393144
    },
    {
      "speaker": "B",
      "text": "And that's where AI, dare I say I might be proven wrong in 12 months or so, but I don't think AI will, will ever, will ever have this 100% correct. It may help, but I don't think be 100% correct. So that intuition, that reading of body language, that connection, that conversation is really what makes what will continue to make our industry succeed moving forward. Forward?",
      "start": 2537640,
      "end": 2563240,
      "confidence": 0.9514914
    },
    {
      "speaker": "A",
      "text": "Yeah, yeah, it's, it's the soul of the industry, I guess, isn't it that, that human touch and communication and, and just finally, you know, thinking back to, you know, the great work that Master in Holders does with, with young people and future leaders, I just wanted to ask you what in your opinion makes the great leaders of tomorrow and, and what gives you confidence in, you know, the, the future of the industry and you know, obviously I'm sure some great lessons will be learned from, from the upcoming conference and yeah, what excites you about that generation?",
      "start": 2563640,
      "end": 2597550,
      "confidence": 0.9829299
    },
    {
      "speaker": "B",
      "text": "I think the leaders of tomorrow, the ones that will try will be the ones that are emotionally intelligent. It plays a lot more now than, than he used to do many years back. They will be, ideally they will be tech savvy. There will be, they will know technology. They might not be specialists, but they will know technology. But they will be genuinely focused on people. They won't do it for the sake of doing. They will do it because they really care about their people. So they will lead with responsibility probably, rather than ego. And I guess, you know, what really gives me the confidence is that we've got an emerging generation that is entering our industry, our profession, and they, they are, they focus on values. They, they, they push a lot more for it. They don't do it just because you tell them to do it. They, the status quo. They're unafraid of challenging it and, and you know, almost unafraid of the consequences of challenging too.",
      "start": 2597790,
      "end": 2667410,
      "confidence": 0.9594464
    },
    {
      "speaker": "A",
      "text": "Yeah.",
      "start": 2667490,
      "end": 2668050,
      "confidence": 0.9641927
    },
    {
      "speaker": "B",
      "text": "And they are determined to, to make our profession better. Better for them and for the next generation too. So that to me, although at times is difficult to manage, for sure. It's, it's, it's incredible to see and, and will shape our industry moving forward. And yeah, I'm, I'm, I'm delighted to see it. More and more of it.",
      "start": 2668690,
      "end": 2691620,
      "confidence": 0.96449655
    },
    {
      "speaker": "A",
      "text": "Yeah. Yeah, fantastic. It's, you know, good to see this, this positivity and it will be really, really exciting to see, you know, the generations ahead in the industry. It's wonderful for sure. And finally, we finish each episode with a question left by the previous guest. And our last guest was Natalia Dainty, who's learning and development manager at Valor Hospitality. She asked, how would you use AI when it comes to developing your teams?",
      "start": 2691940,
      "end": 2722710,
      "confidence": 0.979217
    },
    {
      "speaker": "B",
      "text": "That's, I mean, the world of AI. I think what AI can provide you, can provide you knowledge, can help you to find the responses a lot quicker in most cases and can help you define career pathways, can help you define different journeys, different courses, different training modules, different elements. AI won't teach you the emotional intelligence, but it might tell you, you how to react in certain cases. And that will, will be helpful too. So I think it's utilizing AI going back to what I say to, to remove the frictions of, of training. Is it, is it providing access a lot quicker, a lot easier? And if it is, then utilize AI to provide training and to make it easier for people to access at any point and, and so on. And if it isn't removing a friction, then just kind of embrace it, I don't think. Unless that's what your business does.",
      "start": 2724630,
      "end": 2784370,
      "confidence": 0.9676387
    },
    {
      "speaker": "A",
      "text": "Yeah, yeah, it's interesting to think about, you know, the ways in which you can use AI smartly. That's the key. And yeah. Finally, Francisco, do you have a question to leave for our next guest?",
      "start": 2784770,
      "end": 2798370,
      "confidence": 0.97789055
    },
    {
      "speaker": "B",
      "text": "I mean, I don't know exactly who that guest will be, but I guess if they could resist design one aspect, just one aspect of the Autel culture that everyone's current accepts as normal, what would that be? And I'm quite interested to, to then listening to what's going to be the answers because I'm sure we'll vary and we'll touch in different subjects.",
      "start": 2799730,
      "end": 2826020,
      "confidence": 0.95911855
    },
    {
      "speaker": "A",
      "text": "Yeah, yeah, yeah, that's a great question. It would be a really interesting to hear. Yeah. The other, the other guests perspective on that.",
      "start": 2826100,
      "end": 2834130,
      "confidence": 0.92813957
    },
    {
      "speaker": "B",
      "text": "Sure.",
      "start": 2835010,
      "end": 2835410,
      "confidence": 0.57470703
    },
    {
      "speaker": "A",
      "text": "Francisco, thank you so much for joining us. It's been great speaking with you.",
      "start": 2835970,
      "end": 2839650,
      "confidence": 0.9897112
    },
    {
      "speaker": "B",
      "text": "Thank you so much. Thanks for having me. It's been a pleasure to speak to you and talk through all things hospitality. Thanks for listening to Checking In, a weekly podcast from hotel owner, the UK's trusted source of hotel industry news and analysis. If you like the podcast, make sure to subscribe on whichever podcast platform you listen to. To get more industry insight, head to hotel owner.co.uk and subscribe for unlimited access. If you're interested in sponsoring episodes of the podcast, drop us a line at podcast hotel owner.co.uk.",
      "start": 2840290,
      "end": 2872120,
      "confidence": 0.9890206
    },
    {
      "speaker": "A",
      "text": "Com.",
      "start": 2880550,
      "end": 2880710,
      "confidence": 0.29418945
    }
  ],
  "chapters": [
    {
      "summary": "Checking In is a weekly podcast from hotel owner, the UK's trusted source of hotel news and analysis. Each week we meet with seasoned hoteliers, industry insiders and hospitality entrepreneurs to share the real stories, lessons and ideas behind what makes great hospitality work.",
      "gist": "Checking In",
      "headline": "Checking In is a weekly podcast from hotel owner covering hospitality news and analysis",
      "start": 6960,
      "end": 93070
    },
    {
      "summary": "Hospitality really opens up the world for young people, doesn't it? And I think presents opportunities that not necessarily every industry can. Can you take us through some of the early roles you held and what that looked like in terms of progression.",
      "gist": "A Taste for hospitality in your early years",
      "headline": "Can you tell us what originally drew you to the hospitality industry",
      "start": 94350,
      "end": 261240
    },
    {
      "summary": "As soon as you start talk the same language, people trust you. People trust that you know what you're talking about. And in terms of camaraderie, that that really helps as well. It should be a lot more about camarade than should really be about higher hierarchy.",
      "gist": "Your experience and camaraderie",
      "headline": "Do you think experience and background can help build trust with your team",
      "start": 261800,
      "end": 385460
    },
    {
      "summary": "Under pressure, I always felt that's where I learned the most. From repositioning properties, to food and beverage, to leading luxury hotels. You learn the most when your choices actually really matter and makes a difference.",
      "gist": "The Importance of Leadership",
      "headline": "Looking back at your career to date, were there any particular roles or moments",
      "start": 386340,
      "end": 477760
    },
    {
      "summary": "I became a restaurant manager at 19, 19 years old. That was a challenge because my team was all much older than I was. Back 20, 25 years ago, this was a lot harder than perhaps it is today. You have to get them to trust you.",
      "gist": "A Taste of running a hotel",
      "headline": "There has been so many challenges running hotels over 25 years",
      "start": 478380,
      "end": 614840
    },
    {
      "summary": "Take, take people on the journey, build a relationship with them. A lot of the great ideas came from, came from the, the more junior positions, not necessarily from my bosses. If you can learn something from lazy people, learn the quickest way to do it.",
      "gist": "Taking the people on a journey",
      "headline": "Francisco says you have to take people on the journey with you",
      "start": 614840,
      "end": 813720
    },
    {
      "summary": "Recent role taken as CEO of Wilderness Reserve in Suffolk and Pavilion Clubs in London. Pavilion Clubs is a blend between your office and your networking relationship and your social life all together. Absolutely responsible for everything and anything.",
      "gist": "Pavilion Club's new role",
      "headline": "You recently took on new role as CEO of Wilderness Reserve and Pavilion Clubs",
      "start": 814520,
      "end": 1046509
    },
    {
      "summary": "How what is that experience like overseeing both, both Wilderness and, and Pavilion Club with being such different offerings for, for guests? I mean it's, it's fantastic. We've got a great team. Great owners who are very committed to the business.",
      "gist": "The Experience of Wilderness and Pavilion Club",
      "headline": "How what is that experience like overseeing both Wilderness and, and Pavilion Club",
      "start": 1046909,
      "end": 1151630
    },
    {
      "summary": "Mastering Holders provides platforms for mentoring, provides you a platform of scholarships. We are constantly and actively raising funds to support the scholarships, hence the conference. A priority of mine is widening the access to the Master and Holders. We're interested in promoting the industry so we can.",
      "gist": "A message about the Master and Holders Community",
      "headline": "Master in Holders brings together hospitality professionals to promote the profession",
      "start": 1152190,
      "end": 1415430
    },
    {
      "summary": "This year's theme is Stronger Together, Breaking the Mold. Tell us what that means and what we can expect from next year. It's about being provocative, challenge the status quo, doing things differently, get people to think differently.",
      "gist": "The Conference's 2017 Theme",
      "headline": "This year's conference theme is Stronger Together, Breaking the Mold",
      "start": 1415670,
      "end": 1568300
    },
    {
      "summary": "And why would you say now is the perfect time to really think about this way of innovating? We have to be working together to, to almost forget the competitive approach and just work together to drive a solution that is sustainable on the long run.",
      "gist": "Expert: Now is the perfect time to innovate",
      "headline": "Now is the perfect time to really think about this way of innovating",
      "start": 1568900,
      "end": 1684920
    },
    {
      "summary": "When it comes to innovation, innovation is not technology alone. It's challenging the status quo and doing it differently than what we always done. We need to be opening the doors to our teams to attend conferences more sometimes than we do it ourselves.",
      "gist": "Holiday Industry's Commitment to Innovation",
      "headline": "Talk about innovation, innovation is not technology alone",
      "start": 1685720,
      "end": 1886230
    },
    {
      "summary": "I think AI should be about removing frictions, really. Should be about allowing our team to spend more time with guests and with the human touch. Is there the right balance between innovation and the traditional world of hotels?",
      "gist": "How to innovate in the future of hospitality",
      "headline": "What else would your advice be for hoteliers in terms of how should they innovate",
      "start": 1887190,
      "end": 2217740
    },
    {
      "summary": "Don't follow trends just because you've seen it somewhere else. Balance the innovation and, and the traditional elements of hospitality are quite key. Don't go to OTT unless that's what your business does. Do all the details. Spend a lot more time investigating and analyzing it.",
      "gist": "The journey of innovation in hospitality",
      "headline": "I think balancing innovation and, and the traditional elements of hospitality are key",
      "start": 2217980,
      "end": 2389990
    },
    {
      "summary": "Looking ahead into 20, 26 and beyond, I wanted to ask you what trends you see as defining the industry in the coming year. Even more than AI, I think people are looking for even more personalization, even more connection, proper storytelling. What gives you confidence in the future of the industry?",
      "gist": "Leading the Future: Hotel Industry",
      "headline": "Looking ahead into 20, 26 and beyond, what trends do you see defining industry",
      "start": 2390550,
      "end": 2703510
    },
    {
      "summary": "How would you use AI when it comes to developing your teams? Natalia Dainty, learning and development manager at Valor Hospitality. Is it, is it providing access a lot quicker, a lot easier? If it is, then utilize AI to provide training.",
      "gist": "How to Develop Your Teams With AI?",
      "headline": "How would you use AI when it comes to developing your teams",
      "start": 2704070,
      "end": 2794730
    },
    {
      "summary": "Francisco, do you have a question to leave for our next guest? If they could resist design one aspect, just one aspect of the Autel culture that everyone's current accepts as normal, what would that be?",
      "gist": "Checking In",
      "headline": "Checking In is a weekly podcast from hotel owner. co. uk",
      "start": 2794730,
      "end": 2880710
    }
  ]
}